[{"review_id": "oYy0htqVN4W7E-mKWPtLwQ", "user_id": "EOJwlTPy7gy485rOchz5aA", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 4.0, "date": "2010-11-04", "text": "I have yet to find a better Chinese food restaurant in Pittsburgh.\n\nIt's a great place to come for a low-key and relaxing dinner. The food is averaged-priced for a Chinese restaurant which is a nice touch, being that it is located in Shadyside. I always have leftovers too-their proportions are huge!\n\nThe beef with scallions is delicious and so is the cheese wontons. The chicken lettuce wraps are pretty good too. The sweet and sour chicken was okay...the chicken was great but I found the sauce to be a little stickier than I prefer (maybe it's just me though).I do wish they would have crab rangoons though.\n\nGreat little Chinese restaurant.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "m9cZR9wWsSJ-A04C8FAIEw", "user_id": "cs0KKAZICsJGhHc-BODN3A", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 3.0, "date": "2016-03-06", "text": "I don't usually rate this low but the reason why it's even getting a third star is because of service and the family type atmosphere.  My main complaint is that their pancakes are cooked in bacon fat and the taste is obvious.  For a someone who doesn't eat pork, I'm really grossed out.  I think things like this should always be disclosed.  Another issue I have is with their omelette, we ordered two and both came out with so much egg that you barely tasted the fixings.  Aside from that, the coffee was good, the potatoes were good and so wad the service.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "TBpQa89GpnNS7tw606KgNg", "user_id": "6ZaL6fBlKx5tb8c9opl7rQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2015-11-13", "text": "Finally visited this place.  We arrived and had a blip with service.  We were told to sit anywhere, so we sat right in the middle.  We waited a full ten minutes with waitress after wait passed us by and wait on the droves of people that came in after us.  We decided to move to the near empty counter and place our orders.  \n\nI ordered the \"Health Nut\" omelette with the banana bread and the wife ordered the biscuits and gravy egg plate.  My healthy choice was made very well and was tasty after the addition of some spice it was great.  The banana bread was the highlight of the meal though. The wife said hers was okay, but was rather bland tasting.  We are going to give it another try.  \n\nPlace was very busy, very clean and bright.  We met the owner \"Igs\" and another waitress and they were very nice.  He apologized for the earlier blip and thanked us for staying.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "rLfJi5LftaPFuoaj3c_Byw", "user_id": "dJ_AhP3TpmZblvuLgz_r5Q", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2016-05-01", "text": "This was our first time here and omg it was above  of what we expected . It was really packed and seem like we were going to wait for a while but  we were wrong ,we actually got seated right away. \n\nOur grandparents loved it too and were so pleased . Service was on top of their game.  We cant wait for  our next date", "useful": 2, "funny": 0, "cool": 2}, {"review_id": "U8Ccs-5EYxyv-daJ83FVzg", "user_id": "kTny8RFBPj9du2aIRb8V0A", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 2.0, "date": "2016-07-29", "text": "I used to LOVE this place came every weekend. Then I moved and haven't been in a few years. Had a craving for their spuds drove about 20 minutes. The food has gone downhill. Ordered a veggie burger and they must have just Cooked a meat patty on the same spot. Whole veggie patty tasted like charred meat and oil. Not exactly what a vegetarian wants to eat. The spuds weren't soft and fresh like they used to be. Only good thing was the waitress was very nice and helpful. Wish they would have been the same quality like I remembered.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "BiNj6M6X9f6JzNNlo2uPww", "user_id": "jY1shXf_LQVhSoUyoXqQRQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2015-07-09", "text": "This is the best family friendly family owned and operated breakfast house in town! I have never had bad service at this restaurant. They are always super busy - and the food is always great. They have amazing omelets, but I absolutely love their homemade corned beef hash and eggs! \n\nThe restaurant walls are themed anything and everything Chicago - as the owners are from Chicago. Great food at a great price.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "sL9wNm4luLHgY3MiVW85_g", "user_id": "KUwmXka6hNDZ7wNP-_rIRQ", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 5.0, "date": "2012-08-05", "text": "I came here often when I worked across the street. The pizza is great and tasty. The prices are great (they do discounts off the original price all the time I think) and have great lunch specials. Definitely worth going to one day.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "oDw9wf8Rwq5znzpU8FitxQ", "user_id": "39GNj-qiHPpDAXQ4gyvO4g", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2013-12-28", "text": "The food was delicious I had the California Omelette I highly recommend it! The staff is very nice and attentive will definitely come back.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "u7rD4Y9bvSRrvy53coUXOA", "user_id": "LjDSVQGLLiOO7NCfvmV_MQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2012-03-11", "text": "I recently discovered this location a month ago and am glad that is saves me a drive from the Charleston location I used to frequent.  Even though this location is popular and busy I've always been able to find a seat with minimal wait times.  I was satisfied that it was clean, specials were communicated on the chalk board as soon as you walk in, and everyone is really friendly.\n\nWhat I really enjoy here is the basic breakfast since it's one of my favorite meals, I got the ham and eggs with toast.  Sure what I choose is a basic breakfast but I loved how it's all freshly made and the ham was cooked well and not overly salty.  I've eaten here with friends who've gotten the \"Kitchen Sink Omelet\" and various sandwiches and everyone has always left full and with boxes for the leftovers.\n\nIf you're up for a clean, friendly, and delicious breakfast/lunch place with friends I'm sure anyone can find something on the menu.  I've already added this to one of my options on weekend mornings.", "useful": 2, "funny": 1, "cool": 1}, {"review_id": "f9J8MlH1Pc89C_6hCYtWfA", "user_id": "oIxsWOWytMmV4bf_ffo01w", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 4.0, "date": "2013-06-15", "text": "Now this...is really good pizza!\n\nI'm glad I finally got the opportunity to stop by!\n\nRight away, I was pleased to see that my \"pizza by the slice\" options were not just limited to cheese and pepperoni. They have an amazing variety here everything from veggie, chicken parmesan and white pizza to a meat lovers, Sicilian and even a lasagna just to name a few.\n\nI went with a slice of the white pizza and my friend went with the lasagna...pretty much the white pizza but topped with meatballs. Can you say Yum?!\n\nBoth were very, very good. No, really they were VERY good! \n\nHere's the rundown: the slices are large and very filling...one slice can definitely fill you up! They are not overly greasy and the crust is winning...seriously... It's Perfect! \n\nThis place is definitely a gem in the area! I'm sure to be a regular!", "useful": 9, "funny": 3, "cool": 4}, {"review_id": "AUZ0Aaz9Nd97MVvi8yEMkQ", "user_id": "UyXqGEKod-veD6m6Hq0EDw", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 4.0, "date": "2017-11-05", "text": "I had takeout delivered from here: chicken lo mein and 2 bowls of wonton soup (one for now, one for later). I can't be the only one who has done that before. The lo mein was rather greasy but still flavorful and good. Now that I've had better wonton soup, I now realize that China Palace's wasn't the best but still pretty tasty. I like a good strong broth, and their's qualifies as such. This food is a little bit more pricey than your average chine food, however the portions are big.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "vwDMRdB7OfPfu-qdYbF7ZQ", "user_id": "SerdK2DW_2R7z1b9WU97fg", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 3.0, "date": "2017-01-08", "text": "The pizza was not bad, and the mozzarella sticks were decent. I need to try it fredher I guess. I ordered to go and it took me a few minutes to get into it. I love the prices and I'll be back to give them a more fair shot at impressing me.", "useful": 0, "funny": 1, "cool": 0}, {"review_id": "T3CDtUa81Mt9jyKsyZSVTQ", "user_id": "Hf1dov8HZLiXvfrxIeTZVw", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 4.0, "date": "2017-04-03", "text": "I like the pizza at this place. It's one of the few places that have BBQ Chicken slices and they're good. They don't have it normally in the afternoon after 4pm but I went there today for lunch and it was there so I had to indulge.", "useful": 0, "funny": 1, "cool": 0}, {"review_id": "F5PbPBF_tBKUY5EzZdTOTQ", "user_id": "OCvJlFXTM4EUCgiBVutqGA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2014-06-28", "text": "For a home style weekend local breakfast joint, this places kills. Great friendly service. Potato slices are interesting and the large whole eggs are a beautiful bright orange color - showing their good quality. Avoid the steak though.", "useful": 3, "funny": 1, "cool": 1}, {"review_id": "wyvybEAqtW_BR7pxs61XVw", "user_id": "VZRxANvyTm2ixS6jYDGgEw", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2012-10-01", "text": "Fave place for breakfast when I get too lazy. This place by far, has the best eggs benedict! The potatoes are so good! Homemade potatoes and the best service. Goes hand in hand. The waitress was always attentive, and mind you, I have been here more than a few times. Consistent and wonderful service and food!", "useful": 2, "funny": 1, "cool": 1}, {"review_id": "73QG2_oegXu8RJ0zBAmZSw", "user_id": "f91ypIuKs5XxTQrOjwcdhA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2018-06-23", "text": "Found this place about a month ago, so close to home and the food is fantastic. Gets a lot of people from Sun City but the place itself is great.  Very clean , good atmosphere and the food is great. Not much more to say other than this will be a regular spot for us.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "-UplR9QThKHKLl_Z1c1VMQ", "user_id": "9VsUfMdfdATg7Pzf_Ypk3w", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 4.0, "date": "2015-07-10", "text": "A bit on the pricey side. The food is good, but just a little too far of a drive for me. If I'm in the area I would definitely stop by for a slice. When the pizza is good one doesn't mind spending a little extra for it. Big NY style slices is always a plus.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "fUte1I_Iui-a4X5FZJY62A", "user_id": "A8TRpa--43-mbig73xfhrA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2015-04-28", "text": "Wifey brought me here, she was actually looking for this other breakfast spot that had breakfast bagels but it wasnt there anymore. So we decided to check out this restaurant being it was right there and we were hungry. \n\nYou walk in and get that old school diner feel (which I like) with counter and all. We were seated immediately and asked what we would like to drink. Menu is huge! So many options and you can even pick from their lunch menu. I actually intended on ordering the eggs benedict when something caught my eye....LOBSTER BENEDICT!! Holy crap that sounds freaking good. \n\nSo within 15 minutes I had this delicious and awesome looking meal sitting in front of me, I drenched it with tapatio and dug right in. This has got to be the best egg benedict I have ever had. I don't think I would even try anything else on the menu and risk missing out on this the next time I come. They were not stingy with the lobster meat either, you savor every bite. \n\nWith this awesomeness came these potatoes that were similar to chips only soft, they were equally delish, especially mix with the yolk from the eggs benedict. The service was great, she checked up on us quite often and refilled our drinks as needed. The eggs benedict was like $11 so for $3 more try it with lobster, you will not regret it.", "useful": 10, "funny": 3, "cool": 5}, {"review_id": "C9ZX9r3-_71xcUB6HzGawg", "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 3.0, "date": "2010-07-29", "text": "This place was \"OK,\" but I probably wouldn't go back. Food was kind of low end Chinese although service and atmosphere were fine. Not really bad, just not good either.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "I0ftTKLJo3395FNPuk4kYg", "user_id": "s4cki7AiOrOjb5r-ZpbJUw", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 4.0, "date": "2011-11-01", "text": "So I've lived near Lorenzo's Pizzeria for a few years but have never tried it.  They just opened a new place at Tyvola and Yorkmont and it's called Junior's Pizzeria.  There is no other pizza place near here, and definitely no NY Style pizza place too close to here.  A few coworkers tried the pizza a couple of weeks ago and they loved it.  Today, we got a couple of large pizzas (18\" each) and they were tasty.  It's 100x better than Luigi's (if I was from NYC I would insert a cliched \"hands down\" here).  Why is it better?  There are several reasons.  First, the crust is a little thicker (although not as thick as Libretto's).  Second, they use a lot more cheese, which probably explains some of their higher prices.  Finally, their ingredients are fresher.  Their mushrooms are the fresh kind and not the slimy canned ones.\n\nIt's about $18 for a large one topping pizza cut into 8 big slices, but it's almost worth it.  The menu is a little scaled down from Lorenzo's as all of the places here really only cater to lunch customers.  I'm glad that Junior's opened near the office and will be returning there for slices on a regular basis.", "useful": 7, "funny": 0, "cool": 0}, {"review_id": "yWJN5MLVUCBvNgyzczsmnw", "user_id": "2VABkVdFhHGMo7wAqfofGA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 2.0, "date": "2011-05-02", "text": "This place was not very good. I'm happy that I had a coupon (2 for 1), but I won't be coming back. The service was alright, but the food was not tasty... just kind of bland. I didn't get an omelet; I ordered a hamburger. I've had better hamburgers at Jack in the Box. I'm serious. Anyway... Try it for yourself, you may have a different opinion.", "useful": 4, "funny": 0, "cool": 1}, {"review_id": "O6MaGdNcLf0GVK5NGGjcMQ", "user_id": "bkr_Mo4Ns_k5TB4ei6VELw", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 3.0, "date": "2016-06-23", "text": "Went here for lunch, and it's a pretty good deal. About $7.50 for bowl of soup (hot and sour, egg drop, or wonton), rice (white, brown or fried) and a meat dish. I got to try the chicken and garlic and general tsao's. The chicken and garlic sauce was good, but I disliked the veggie that they cooked with. Not sure what it was, tasted almost like a bitter celery. I ate all the chicken out of it but left the veggie. It's kind of hard to know what you're going to get since the lunch menu has no description of the dish, just very generic names. The general tsaos sauce was good but the chicken was a little dry. I liked the soups although the hot and sour could have been both hotter and more sour.\n\nIt's certainly not the most amazing food, but for convenience and good service, I'll probably return for lunch.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "GPDlydUtSVST2neGXLQaRw", "user_id": "3Nn6oTTT_nW0P4tv_HMVew", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2016-09-27", "text": "Love it here...their banana bread is awesome! Egg Wite omelet is the best! Service is great", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "_UFcUlHyEt1SGmeQL65Ikg", "user_id": "21W8iTZGWdCk1utgudcToQ", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 1.0, "date": "2014-11-22", "text": "Had a craving for Chinese the other day while I was in Shadyside and wandered into China Palace.  How this place can stay in business in an area that I consider to be more sophisticated is a real mystery.  It was just awful and the service was terrible.\n\nI wanted to have the assorted appetizer platter, but asked if I could substitute one of the items with dumplings.  Our waiter had to ask the manager.  After much whispering, the manager came back to me and told me that I could have dumplings...then I asked if I could get the fried dumplings with that instead of steamed.   Well I was met with an outraged \"NO\"!!!!  It kind of surprised me that I got this kind of reaction.  I was told that the chef would have to fry 2 dumplings just for my platter.  I looked around and there were only 2 other people in the entire restaurant.  Isn't that what they're supposed to do?  Cook food for people to eat?  I would have never asked if I thought it would be such a big deal.  \n\nAnyway, the food was not very good.  In fact, it was awful.  \n\nWere they having an off day?   I'm not sure they were.   There's never any reason to be rude to your patrons.  No need to ever return.", "useful": 5, "funny": 1, "cool": 0}, {"review_id": "rxhmyQYi0nko2iq81JDDhw", "user_id": "FTZyZbr1eF7s3Ss7uSLcXQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 3.0, "date": "2011-10-10", "text": "Friendly environment, comfortable decor, and an amazing menu. I ordered the Sparticus, which was an omelet with asparagus and mushrooms ( amazing concept right). I went with the pancakes instead of the bread. By the end of meal I felt like I was going to explode.\n\nLet me tell you that small stack of pancakes packed a powerful punch. The omelet was cooked to perfection and the potatoes were ok. I would say skip the cheese sauce and get a side of gravy or ranch instead. The ice tea tasted freshly brewed which was nice on a rainy day. \n\nThe server was quick on the draw and never let our cups run dry. The chances of me being on this side of town again for breakfast are about slim to none, but if you find yourself in the same situation give it a shot.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "I-8JUdDqrnN0REhWgsALuw", "user_id": "pkq41Qh9yGOI_4pwdVmmDg", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2011-06-01", "text": "Well, 3rd time is a charm! I stumbled upon this place when I decided to NOT wait for at a minimum of an hour to eat (lets just call them B.C, you know the place that has the red velvet pancakes) then went to try another place, that was no longer in business (Aloha something), then right next door was the Omelet House.\n\nI didn't expect anything of the place since I have never heard of anyone I know that had been at this place. Soon as I got out the car, I was walking up towards the entrance and an old man who walked in with me, asked me right away \"how many ?\" I replied, \"4; 2 kids, 2 adults please\" .  He sat us at the booth. I am not sure who he was, but he was older, italian man, after we were seated, he disappeared. (lol maybe he was a ghost)\n\nAnyhow, I was amazed when I saw the MENU. I browsed thru the whole thing and went with the \"The Kitchen Sink\" which had EVERYTHING you can think of. It had a disclaimer below it \"Warning: For Adventurous people only\" or something to that effect. Well, so I order the darn thing. It had everything you can think of: zucchini, peppers, sausage, steak, chicken, mushrooms, marinara sauce, ham, broccoli, tomatoes, onions to name the few. \n\nI LOVE LOVE LOVE their potato SPUDS. Its like fresh potato chips. =)\nI loved it so much i ordered an extra side of it (the fat girl in me requested for an extra side) =P\n\nWell I will definitely be going back for the Kitchen Sink omelet. The stuffed french toast i wasn't too thrilled about and neither was I with the breakfast special and the regular french toast.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "uW0-EyAjmqAxEz0jqc2-cQ", "user_id": "lMpEj892FujXVk5ISmAGVg", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2015-08-19", "text": "Great family, friendly restaurant. We came here with my Dad this past weekend to get breakfast, and I chose to get a the California Club. I took the tomatoes and avocados off. Yuck. LOL But the potato spuds little sliced up potatoes, were perfectly cooked, they were delicious. \n\nMy Dad and Boyfriend both got an Omelet which they are known for and it was huge, practically took up the whole plate. \n\nWould love to go back in next time in town visiting.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "wYs0G-UwsWM__0-6ZW2j_A", "user_id": "gMRbRiQdam0Wgb_K6sR_sQ", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 1.0, "date": "2015-06-30", "text": "Horrible. Do not go here. Crappy service and food. I ordered a beef stew, which tasted like rotten flesh. Could not eat it. My partner ordered a chicken dish - he asked the waiter beforehand if it was deep fried and the waiter said no - however, it came deep fried! Waiter clearly did not know what he was talking about. He was also very rushed - kept wanting to clear out plates and gave us the bill immediately after we are without checking if we were done! There are better Chinese places on Pittsburgh - this place should be shut down! There is nothing Chinese about the food!", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "y6-2TRdKcibVC837A8xtAQ", "user_id": "7m4hy4IKBCuwNNzvM_aY4g", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2016-10-28", "text": "This is a yummy neighborhood breakfast spot has a real neighborhood feel and great staff food is super yummy", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "-8pI003FuOWxoLn_ncX06w", "user_id": "5IaHGddT0RLq1-S5LbP1iw", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 2.0, "date": "2016-01-07", "text": "Can't say I've ever been impressed with any delivery Chinese food I've had in Pittsburgh. I'm not expecting anything crazy, but I have had quality American Chinese food and a little flavor/quality goes a long way.\n\nOur delivery order was over $40 for 2 entrees, veggie wonton soup and 2 veggie egg rolls. For the quality of this food, that is WAY TOO EXPENSIVE for the quantity and quality of the food. We could have gone to many other places around the city and gotten a quality meal for that price.\n\nWe ordered General Tso's and Beef & Broccoli, one $13 and the other $14. I wasn't overly impressed by either... both were pretty bland and nothing to write home about. Honestly I probably wouldn't have been able to tell the difference between the two meats if I was blindfolded... they didn't taste different at all! The broccoli was cooked well and still had a nice crunch to it.\n\nThe egg rolls were ok, but it's kind of impossible to mess those up. I was really excited that they had Veggie wonton soup. It had been so long since I've had wonton soup because I don't eat pork, but the broth was extremely bland and I found myself adding a ton of salt and pepper to flavor it.\n\nThis is only one of 2 places that will deliver to the Polish Hill area, so it looks like I'll be going for take-out next time.", "useful": 3, "funny": 0, "cool": 3}, {"review_id": "-mUl655QlvYOUut9ODdKdA", "user_id": "8dxkcmAXY4ttrVFD1GhbdQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2016-12-12", "text": "For us, this is a good nearby location for a breakfast place. Been here twice and figured I should write a review.\n\nThe restaurant is located in a strip mall in Summerlin and share the same area with the Smiths grocery store, Savers and some other small stores and restaurants. \n\nThe restaurant is family owned and the atmosphere is nice and family friendly.\n\nThe service was exceptional on both times. I just love their homemade pumpkin and banana nut bread. \n\nWe had stuffed French Toast with blueberry, American Cheddar Cheese Omlette and Chili Verde Omelette. The taste was flavorful and the portions are huge.\n\nWhen we came here for lunch, I had their homemade chicken noodle soup which was fresh and tasty. Also their BLT sandwich were amazing.\n\nIt's a great value with wonderful service.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "6Xv3j41ZTprt9cRCjr650w", "user_id": "xKQ1qs55RYhicqYA8jG9Vg", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2018-04-12", "text": "Great sliders. My friends omelet was so big she took half home. Nice choice of substitutes for fries. Plus, it's a Chicago owner--Cubs, Bears, Black Hawks  every where, even our Golden Knights.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "UmZL3aYi_AjGzSmArY0pug", "user_id": "NrpzAH3EoNhWUR8OysUhBQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2018-05-27", "text": "Great eats here! Super-sized portions, so if you are a fan of value, you've found your place here.  They know what they're doing on this food, all of it is splendidly cooked, and consistently.  Try the muffins that come with most entrees at breakfast or brunch.  The only issue is waiting for a table occasionally.  And the booths can feel a bit small sometimes.  But the wait staff is usually pleasant and patient.  You will not leave hungry.", "useful": 3, "funny": 2, "cool": 2}, {"review_id": "-c2GWwmARR79nmNkIJotTw", "user_id": "6pzA8EDhHgW3A5-rBObhBA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2018-02-22", "text": "Feeling famished and needing a gigantic meal to fill you up. Come and visit Omelet House for a satisfying meal that will leave you feeling like you consumed 2 days worth of food, lol. Actually everything is large in portions and they can make your order half sizes as well. The menu is quite extensive with omelettes being the main feature, which included 40 different variety of omelette and the option of customizing. Each order comes with your choice of starch that includes hash browns, fries or potatoes studs. Plus your selection of bread or homemade banana bread or pumpkin bread.\n\nOur omelette were made just right and was very filling. The hash browns were cooked evenly with a good amount of crisp and soft like texture and they were seasoned to our liking. However, the homemade Pumpkin and Banana Bread was spot on! Moist and soft throughout and it wasn't dried out. It had this nostalgic flavor that reminded me my childhood years when my family would baked fresh bread. Special shoutout to our awesome server, John! :)\n\n2018 Yelp Review #20", "useful": 16, "funny": 11, "cool": 16}, {"review_id": "_rJF0hMYCwS1odyXaqoDaA", "user_id": "jTvATg85gVhS0kifVfK-lA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2014-01-23", "text": "Unpretentious place - family owned . Good breakfast but also a place we like to go for salads and soups for dinner ( although they close a little early - 7pm:((.  Great service !  Try the fried zucchini - good stuff", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "zKWEb3cPX2lWy814j9_tNw", "user_id": "PKEzKWv_FktMm2mGPjwd0Q", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 3.0, "date": "2017-07-12", "text": "16 of us gathered here for a breakfast before some returned to Northern California. Most of the group hiked the day before and this was a chance to get together with some friends who don't hike and enjoy some time together.\n\nMany thanks to the staff for accommodating us.  We all were served in a timely manner and coffee was refilled often and without having to ask.\n\nI had the house special omelette called \"My Little Chick-A-Dee\" which was an omelette made with chicken breast cubes, broccoli, onions, and cheddar cheese. I had my choice of hash browns or fried potatoes and I opted for the hash browns.  I also got rye toast.  \n\nYou can see from my photo that it's a large omelette.  I went here many, many years ago and I remembered how large their portions were.  The omelette was good but it was no match for the great company at breakfast.  \n\nThe Omelet House Summerlin is A-OK!", "useful": 12, "funny": 7, "cool": 11}, {"review_id": "RLn8H02Xt0Tnx3TrIvwvJg", "user_id": "uEvusDwoSymbJJ0auR3muQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2013-07-01", "text": "Neighborhood friendly restaurant that serves up some manly portions!\n\nOur neighbor recommended that we come in and try this place out.  The Omelet House is located in the Smiths shopping center and is owned by a Sicilian/Chicago family...so I knew I was in good hands.\n\nPortions are a nice size so bring your appetite.  Plenty of options from omelets...of course to eggs benedict and LOBSTER benedict to the yummiest buttermilk pancakes I've ever had to...lunch and dinner which I will be back to sample too!\n\nVery friendly service!", "useful": 4, "funny": 1, "cool": 5}, {"review_id": "88Jmj-LW-BHIrLZ1p32NDQ", "user_id": "QCtHk02W_Asu2LFfdmGQDA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 3.0, "date": "2013-09-20", "text": "Pretty good hidden little spot for breakfast in Summerlin.  Really, it is kinda hidden.  If I didn't see the bunch of people coming out of this little place on a Sunday morning I might have never thought to look in this corner of the strip mall!  It's located in the Smith's shopping center off of Rampart and Lake Mead.  \n\nSeems like this Omelet House is owned by a family that is from Chicago, so the decor reflects as much.  I have no problem with that, the home of Michael Jordan and the Chicago Hot Dog (one of my fav sinful snacks) are OK with me.  It was super busy on a Sunday morning, good mix of locals and what seemed to be a bunch of church goers.  Praise be!  Hallelujah!  I got the Spirit inside me!  Sorry, sorry...too many Madea movies lately.\n\nAfter a short wait we were seated by our nice hostess.  I'm thinking she may be one of the owners, her native Chicago accent was present!  A few short minutes later our waitress presented herself and brought us our drinks of water and coffee.  \n\nThe menu at The Omelet House is almost typical with lots of other breakfast joints here in Vegas.  Lots and lots of breakfast items, with a mix of burgers, sandwiches, salads, and soups.  I know this place does dinner as well, but I didn't get to go through that menu so we'll just focus on breakfast and lunch.  I really like how this Omelet House has a sprinkling of Chicago in their menu, they have some good looking stuff.  Specialties like Chicago dogs, and Italian beef sandwiches can be had for your meal.  There are a number of omelettes and breakfast specials to choose from, it can be overwhelming.\n\nI stuck with what I like from these breakfast joints, a Club Sandwich.  Yes, a Club Sandwich.  In this case at The Omelet House, a California Club.  Comes with turkey, avocado, lettuce, tomato, and mayo on white or wheat bread.  Also a side of potato spuds (think chips), fries, soup or salad.  I don't know what it is about a Club Sandwich that I like so much.  Might be the nostalgia of when we used to go to restaurants as a kid my Mom would always order a Club Sandwich and share some with me.  Might be that 3rd layer of bread that made a Club Sandwich seem so darn special.\n\nAnyway, the Club Sandwich at The Omelet House was good.  A nice sized portion, big looking sandwich.  The bread was nice and toasted, the veggies were fresh, and the fries were tasty.  Not the best Club Sandwich I've ever had because this one needed more mayo (lots please), and some bacon!  This sandwich would have been off-the-cuff with some crispy bacon!  It was just missing a punch of salt.\n\nThe wifey had a corned beef omelet with potato spuds.  Large omelet!  Very tasty too.  The salty corned beef went great with the delicate eggs.  Add some Tabasco and it was some good eats.  But I have had better omelettes elsewhere.  Breakfasts also come with your choice of toast, english muffin, pumpkin nut bread, banana nut bread, or tortillas.  We got the banana nut bread and it was yummy.  Not too dry, lots of bananas!  \n\nIt's a tad pricy to eat at The Omelet House I'm guessing because it is Summerlin after all.  Much of the menu ranges from the $7 - $10 area for entree type dishes.  So if you're a cheapy look at the menu accordingly.  Service is fast since you will probably be eating with a million other people.  But they are nice for the most part.  Probably be back here again for a meal, just wouldn't be my top choice.", "useful": 4, "funny": 2, "cool": 2}, {"review_id": "RXYne76-ZzRrJRDx6Cu5dA", "user_id": "kjaUSiRWhR9bF9KxOMbVvg", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 5.0, "date": "2016-02-21", "text": "If you don't know NY style pizza, then you won't know there's a real difference from what you're currently eating from your favorite place! Junior's is the real deal, pies done right, and in a true NY fashion! We stumbled across this place after getting off a flight in Charlotte. We made a point to give them a try after seeing they had true White Pies! Although this occasion we didn't try one, instead we went with a Sicilian and a Pepperoni. You've never had a real Sicilian until you've had someone from NY that knows what they're doing make you one! Junior's knows! Thick, chewy, and yet light all at the same time! Their sauce is phenomenal, as well as the quality of the pepperoni on their pies! After also enjoying a very good Caesar salad, I just realized that anything here was going to be spot on. After talking to the guys a bit while we were there, we found that indeed they are from NY! Do yourself a favor and stop going to your local Italian spot, and take advantage of this real gem right near the airport! We'll be back!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "IVM7IXrI5AO8skU7nvO8tg", "user_id": "y3FcL4bLy0eLlkb0SDPnBQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2017-04-29", "text": "Omelet House - Summerlin, Las Vegas\n\nJust let me get their customer service out of way first.  The Omelet House has superb customer service.  There's never been a wait, the entire staff is great, and the food is served with the quickness. \n\nOmelet House has been around for a couple of years now.  They serve breakfast, lunch, and Italian food.  I have yet to try any of their Italian dishes, but I have tried their breakfast and burgers.  Of course, the highlight is their omelets.  The Omelet House has a long list of omelets ranging from your basic cheese to their everything omelet dubbed \"The Kitchen Sink\".  They have close to 25 different omelets with cool names to them.  Their omelets come with two slices of bread and potato chips.  Honestly, I've never been a huge fan of potato chips with my omelets, but always end up eating them anyway.  Omelet House has an extensive list of other food options.  But let's be real.  This is the Omelet House.  I'm getting omelets. Besides, I was born to eat omelets.  My name is even in the word omelet.  Overall, I'm a fan. I'm just surprised that I haven't dined here more often. \n\nMY FAVORITES:\n-Meat Lover's ($11.99):  Made with at least 6 eggs, a ton of cheese, bacon, ham, sausage, and ground beef.  This is my go-to omelet.  6 eggs is a lot, especially when it's stuffed with a bunch of protein.  Get this if you want to be full.\n\n-Double Yolk Burger ($12.95): I'm not a huge fan of the bun, but love the rest.  This burger is two 1/2 lb. patties of lean Angus beef, bacon, American cheese, Thousand Island dressing, and an egg.  Keep in mind that their burgers are leaner, which to some may mean less taste.  I think it's perfect. \n\nTIP #1:  They serve Italian food.  I never noticed the Italian food on the menu. \nTIP #2:  Their omelets are made with 6 large eggs.  If this is too big, you can get their half order.  They only take off a $1. So, I recommend that you get a full order.  Best bang for your buck! \nTIP #3:  Their chili with cheese is packed with a lot of cheese.  Not bad. Good if you got chili cravings. \nTIP #4:  Restaurant is a lot larger in the inside than it appears from the outside. \nTIP #5:  Opens at 7:00 AM.  Closes at 7:00 PM.", "useful": 7, "funny": 5, "cool": 7}, {"review_id": "pT6BPAZNrDOMXncEIVh_7w", "user_id": "McDGTZ5J4ViG46PNrkPOfA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2017-05-15", "text": "I have come to this place for many years and through a couple of owners.  This place is a consistent performer when it comes to good food.  Of course, their specialties are omelets, but you can get plenty of other things, including lunch items as well.   The omelet selection has to be close to 20 different types of omelets (maybe more).  I have tried plenty of them but a couple of things I am consistent about getting is the pumpkin bread as my choice of bread that comes with the meal and the \"spuds\" which are sliced and seasoned potatoes.  Also, although it isn't a typical breakfast item, they have the best fried zucchini ever.  My family usually orders a batch of this as well as an appetizer.\n\nWhile the place can get busy, we haven't ever had to wait an extraordinary amount of time to be seated and the staff is always very pleasant and nice.\n\nOverall, this is a great place to dine.  We like it.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "CCWpZnp-CHfhLWj6D-JZ4g", "user_id": "WAb5zPq711dVH7GzxZpLNw", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2014-07-05", "text": "Everyone is always so amazingly nice here and when I need an omelette fix, this is the perfect place to be", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "T96oZ5ZgTGITEp7WCG3Q6w", "user_id": "QvLg2kxqHHahxxOlHlEIZw", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 3.0, "date": "2016-01-21", "text": "This is a good breakfast place, but I found it a little pricey for what was ordered.\n\nThe omlets are very generous in size, and you won't leave hungry. The accompanying pastry is very good, and I usually take it home to enjoy later. Potatoes are decent, but for some reason, they don't always arrive hot.\n\nI have had the Kitchen Sink Omlet, and the Mexican Style Omlet. The Kitchen sink was just too big for me, but lived up to its billing. The Mexican Style, was a good breakfast.\n\nService was very good, and the server was very personable. \n\nMy only complaint was the cost. It was about $40 for a party of two, and that's more like a decent diner out.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "pS9iM0e488tDkoazuPjMgg", "user_id": "535H0AVY41CWfHGjYhEoKQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2015-05-10", "text": "My Dad had a appointment  at Shephard Eye center just down the street. Not knowing the area I went on Yelp to find a breakfast place, was very surprised to see Omelet House Summerlin. We had been to the Charleston location many times and never knew about this place. They are located in the back corner of a shopping center. The place was not very busy. They have a lot of booths and the decor is nice and bright. Same menu as other local. Dad got the Pigskin (ham & cheese) I got the Jolly Green Giant (veggie) omelettes. Though it was not on the menu the waitress asked if we wanted the smaller omelettes, we both said yes. They have the flavored creamers for your coffee (big plus) and the service was great. Omelettes were fabulous as always and the homemade potato chips were nice and crispy. We got the banana bread to go. Glad to know about this location. We will be back.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "yMbNw_rBEDNtGj_bs8uqHA", "user_id": "O4s9lPLMbT981mu5JMCFYQ", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 3.0, "date": "2017-01-04", "text": "The reason I like China Palace is the cheap lunch special (11-3pm). Comes with rice, hot and sour soup, and choice of meat. The restaurant has a mellow vibe and there's a bar to watch sports. Service is delightful, especially the ol lady! The full menu offers many options but overall the food is just meh.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "esAQmdoQAkmv3X3nSeA4Mg", "user_id": "vTDIfVV-JFfyc6XZMkpk-g", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 3.0, "date": "2016-08-30", "text": "Too much food!  \n\nI had the pasta bowl special with garlic knots and a drink. \n\nPasta seemed a little over done (I prefer al dente)\nSauce was good.  Could have used more peppers. \n\nOverall a good value; just only ate about 1/3 of the food.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "6Ul0ltkZMXRu3Wz-ltkLVw", "user_id": "rwxysHWeugwQ1sJFI4AQdw", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2016-07-17", "text": "This is a great little gem in the heart of the Sun City Summerlin area.  You can tell its popular with the locals the moment you walk in and it still carries that feel of a diner you remember going to with your parents when you were a kid.  Service is always great and the staff is super friendly.  They've got an extensive menu of pretty much every omelette under the sun, but ironically I can't resist the Eggs Benedict.  Tried multiple dishes here and none fail to impress.   Between the Chile Verde Omelette, to the Nutella French Toast and the Eggs Benedict with lobster it's all gravy, no pun intended.  Omelette House, I salute you.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "Q3XzcKk1bZemSOdEK6D0eg", "user_id": "-8BrIcsVPbGhv6EAEqbBfA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2011-05-01", "text": "We love stopping  by for breakfast or lunch. They have a nice variety of menu items for either one. The staff is friendly and the service is quick. This is your basic cafe fare, but they do it very efficiently.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "kxBTzDKsrycXvJU2w3gVNQ", "user_id": "O5VAQ-dbR2Bk0OZLL1L0Ig", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 2.0, "date": "2018-05-30", "text": "Service is good...that's where the good stops. Huge omelet but over cooked and I asked for onions sauteed did not happen. Coffee luke warm. Heinze jam tasted like shit. The worst potatoes ever. I mean seriously the owner needs to try his own food and be honest. Dont penny pinch on the small stuff it just adds to the miserable experience. 20 bucks with tip..they need to step up their game....maybe they have a following but it wasnt to my taste or quality level. I would rather have a smaller , higher quality meal.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "TxALRGtfNix8GQmNDmk25Q", "user_id": "9eRRQL3JwekCLFPY25tO2A", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2014-07-02", "text": "This is a bit overdue and reflects several trips to the Omelet House. The service is good, the omelet selection is huge, and the several I've had are each delicious. I'll continue to frequent this place whenever I'm in the mood for a good breakfast. Be warned that the Sunday brunch crowd can be large. That said, they do a pretty good job of moving people through.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "E0vydWjPK9d_1o29fmaWQw", "user_id": "Cfwvos6oFlDquGiI2Qy1gQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2018-01-03", "text": "I've been to this restaurant dozens of times over the past years.  It is family owned and operated.  I've seen one remodel which made the place look much nicer to go along with the very nice people who work there.  The food and service has been consistently very good.  We typically go for breakfast items.  Once in a while we order lunch.  I cannot resist patty melts!  It very much feels like a neighborhood family diner.  It is located in a very busy shopping center so parking may be a struggle at times.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "SLKWvQLjLZvY84rZ_pxFTQ", "user_id": "zh8-XfjqlwAxf--RS4azzg", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 3.0, "date": "2011-02-07", "text": "I've passed by this place on Walnut Street many times without so much as a glance.  But when I returned to Pittsburgh after a trip to DC, I was tired and hungry.  I remembered I had an All Menus coupon for takeout, and China Palace was one of the participating restaurants.\n\nThis is the friendliest Chinese eatery for a Pittsburgh vegetarian/vegan.  There are tons of dishes with wheat gluten and soy protein in addition to the more standard tofu.  They even offer veggie shrimp on the menu.\n\nI ordered a spinach and seaweed salad, and the Sizzling Sensation, which is wheat gluten and stir-fried vegetables in a very peppery sauce.  The salad was pretty much what you'd expect, and the Sizzling Sensation definitely perked up my taste buds.  I usually love black pepper, but this was a little much for me.  The vegetarian dishes aren't cheap, running around $12-15 for an entree, though the minimum order for delivery is $12.  The portion size provides at least 2, if not 3, servings.\n\nI should also note that I placed this order on Super Bowl Sunday and wouldn't have been surprised if it arrived later than my requested delivery time--but it even arrived a few minutes early.", "useful": 2, "funny": 1, "cool": 0}, {"review_id": "y9T_MjcICGcmrHW0XUHRmw", "user_id": "OvQtTXbpzJFGhbjNqWjGOA", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 5.0, "date": "2013-04-01", "text": "This is my favorite place in the area, and I would eat here everyday if I could. Their vegan options are extensive and amazingly delicious. The won-ton soup is vegan friendly too, at least that's what the server told me. Portion sizes are generous, the soy protein is to die for and the price is right. This place is a little piece of heaven for vegetarians and vegans, but omnis won't know the difference.\n\nI've visited this location a handful of times, and each experience has been nothing but pleasant. I have tried the fried mushrooms, the sesame soy protein, the orange soy protein, the sweet & sour soy protein, the wheat gluten veggie mix, the general tso soy protein and the hot and sour soup. \n\nMy favorite is the sesame soy protein, but I plan to try all of the soy protein dishes at some point. The wheat gluten is tasty, but it's not the best I've ever had. I prefer the meaty and solid texture of the soy protein over tofu and wheat gluten. \n\nThe spicy dishes are never spicy. You can always ask for extra chile paste like I do though. It's weird that they aren't spicy enough, but that could be because this area isn't as likely to have a preference for the spicy foods. \n\nMy last visit here on April 1st was definitely the most memorable. The sweetest young male was our server. He forgot sesame on our sesame soy protein, and he apologized profusely and fixed it. He kept bringing us refills, especially on my diet coke. Restaurants can be a little stingy with soda refills, but he was generous. He also gave us free rice refills, and since we all love rice, we were immensely grateful. I can't say enough good things about this kid, but I hope the tip we left him conveyed our gratitude.\n\nChina Palace is a win for sure!", "useful": 5, "funny": 3, "cool": 3}, {"review_id": "fcEEP2ELCOW9rtS2eeQCqQ", "user_id": "TP84hS-tDZGv0vEDSowrxQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 5.0, "date": "2015-08-21", "text": "I guess that I forgot to review this place in the past, but I had relatives visit, and we decided to go  there.\nVery, very good.\nI have a big appetite and I can get a 6 or 8 egg omelet in this place...Yeah baby!\nThey have at least 20 different kinds of omelets listed on the menu, but they had no problem mixing and matching various options, which was great for the kids.\nMy relatives commented on the great service, and I would have to agree.\nThey frequently asked if we needed re-fills on our drinks, and when I decided to order something last minute, they brought it out more quickly that I had expected.\nMy relatives also commented on the affordable price, and again, I would have to agree.\nI don't see a flaw.", "useful": 0, "funny": 1, "cool": 2}, {"review_id": "sbeI3m1ca0N9xrIa9D7gFg", "user_id": "kGhgiNW1OVTRTz390q9GvA", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 4.0, "date": "2012-07-02", "text": "Being a life long Charlottean, I'm sure I don't know much about \"real\" NY style pizza and my wife is happy to confirm this fact, along with the complaint often voiced by transplants from parts North that there is no good pizza in Charlotte. We have tried them all and Luigi's and Luisa's Brick oven were about the best. Working on a strong pizza craving we stopped into Junior's Pizzeria the other day for a slice. Let me say that the first slice was so good we ordered another and considered a whole pie but decided to pass...for now. I had pepperoni and Sausage and my wife had just Pepperoni, they were both stellar in all aspects of the pizza maker's art. The crust is thin and flavorful, a combination that is surprisingly hard to come by. The cheese was perfect and plentiful, toppings obviously high-quality. I loved that it came to the table piping hot, in fact too hot to eat and the crust was so crisp. The familiar orange grease dripped onto the plate and we were in heaven. Once i get my fill of pizza I will branch out and try some of the other offerings and I'll be sure to Yelp about it. The smell alone when you walk in will transport you to your favorite Italian restaurant or maybe your Grandmother's kitchen. The decor is the standard NY sports stuff and the service is mostly Self-service, but you won't keep coming back again and again for the service, it will be the craving for Junior's pizza.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "gjOe6s21QHJtlG1TAqdnAg", "user_id": "_AwABkxw1joJPXn-j9dNiA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 3.0, "date": "2013-02-23", "text": "Good food, huge servings. Decent service.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "ZSAooJbMZrYZLTkCoEtrLA", "user_id": "F3lu1icxJX5A5tCw-jVpTg", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 4.0, "date": "2012-11-25", "text": "Long time no eat, China P.\n\nI grew up eating this stuff. Not joking. I think my parents took me here when I was 5 years old. I am now 24 (just abouts!) and I still eat at China Palace and love it. You really must come here for their dinner. FAR FAR FAR superior to their lunch!\n\nPortions are fucking massive. And tasty. We spent about $85 for 4 people and still had 2 days worth of leftovers. Hell yes.\n\n\nPROTIP: If you come here and you secretly wanted to go down the street to Sushi Too instead, rejoice! They are owned by the same people and you can order from Sushi Too if you know what you want (they don't have Sushi Too menus at China Palace, obviously!) They will oblige. That is how cool they are.\n\nOh, and get the Wonton Soup, Hot Tea, and the Shrimp Soong. You are welcome. ;P", "useful": 2, "funny": 1, "cool": 2}, {"review_id": "CUPHF6IEtgJPlzgetUmEYA", "user_id": "DoRCeCcJbrsM2BiAKj3trA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2014-11-24", "text": "Staff and service were top notch, owner was very nice.\nI had the Eggs Benedict and added a side of banana bread. The Eggs Benedict was delicious, loved their \"potato chips\", dip those in the Hollandaise....yum!\nMy husband got the Chili Verde Omelet and they were accommodating and allowed him to add jalapenos to it. It was tasty as well. Our friends enjoyed their breakfast as well. I'm surprised more people don't know about this place. the dining room is large. We went on a Sunday morning about 9:30 and it was half empty but there were plenty of people both coming and going, so they were busy. The crowd was mainly older folks but it's because it's location is so close to Sun City.\nI would go back again if given the chance.", "useful": 4, "funny": 1, "cool": 2}, {"review_id": "Vo3wSUmKNrHsiIH8MzkCkg", "user_id": "erJ1HQwavgZx4996SMIxrA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2011-11-04", "text": "The Bugsy Siegel omelet is the stuff dreams are made of. Okay maybe just my dreams but still. The tender chunks of italian roast beef and melted mozzarella cheese inside of an omelet are pure heaven to me. The home style potatoes are equally delicious. This location seems less busy than the other and usually has 2 for 1 coupons in the paper. The service is always prompt and friendly.", "useful": 5, "funny": 1, "cool": 1}, {"review_id": "vGcpbtBLTdyMkCW61-TROA", "user_id": "tUbgawKxrOmLUuv0KUKZvA", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 4.0, "date": "2015-08-22", "text": "Went here for lunch during my break.  Lasagna, 3 garlic knots and a drink for less than 10 bucks. The hearing time took ages but it was worth the wait. Huge piece, fluffy, not doughy, garlic knots and enough extra sauce to satisfy anyone. Bummed that it took so long but I'd do it again. Mid level food quality for a place like this but we'll made and relatively clean place. Bathrooms were either tied up or closed and the ladies room said it was out of order.  Fix that shit! People need to wash hands before eating with them.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "et9kHL4zvR7xqngSVug5Tg", "user_id": "PQAR1z013WjtH6bMl5295A", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 2.0, "date": "2017-09-01", "text": "Searching for best pancakes in Vegas. These won't make the top 5. Fluffy but lacking flavor, suspect they use a pre-made mix. Also, the bottom side of the pancake was strangely elastic and difficult  to cut even with a knife. You get what you pay for. This place is very cheap so go for a deal but don't expect high quality ingredients. Lastly, I know it's hot in Vegas but the AC at this location doesn't do the job so the dining area was stuffy and uncomfortable at least when I was there on a weekend morning.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "voLNJMZn_bPQ6SKKrhLV2w", "user_id": "WM7MFrRP-7YFuGBAJ6quRQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 3.0, "date": "2014-05-30", "text": "Gr8 omelets and Italian food.  Neighborhood breakfast/lunch spot w/decent service.  Food seems sometimes inconsistent.  Can have gr8 baked ziti and then awful chicken picatta.  Nice lunch specials.  The Pilgrim sandwich is my favorite.  Good ambience and business can be conducted.  Go w/smaller omelette.  Family friendly.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "BP3J_vOHjZhBJQFh0gEfhA", "user_id": "SwgCR62v2RKU3mQo1S-dlQ", "business_id": "AYL_y8ahquUW0o-cvIyLbg", "stars": 4.0, "date": "2012-02-04", "text": "These guys have some great pizza!  The little plaza at the intersection of Yorkmont and Oak Lake has become a bit of a dining village with Jersey Mike's, Salsarita's, Nana's, the Hibachi place, and now Junior's.  If you're not in the mood for Yorkmont Cafe, you can probably find something in this little plaza.  But we're talking about the pizza!\n\nReally good  New York-style pizza.  The interior is decorated with TV's and New York sports logos.  I'm happy to report they are Mets fans, and not fans of that other New York baseball team.  The slices are huge and the service is fast.  For work lunch, that's what I'm looking for.  It is a little on the expensive side, but it's good 'za.\n\nThey're also open Saturdays till 8:00pm, which is a win for Hyatt Place and Doubletree guests.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "x_MQ0dwDmkYPURUTq-a3Iw", "user_id": "No5P-cOQQEf0Atgc9Vi84g", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 3.0, "date": "2016-04-02", "text": "Cute mom and pop place .. Have lots of options but the food is just average... We've had the burger and also had breakfast here and it's you basic stuff... No wow factor for the food I think it's great for the older folks that live in sun city", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "Fe22GUHgO4KLxeO-K-UliQ", "user_id": "CRF5c-Vo90Ulzd2vJhuprQ", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 2.0, "date": "2018-05-30", "text": "Well I'll say this, food is good but service is not their strong suit. \n\nWaitress came by only once and luckily I knew what I wanted right away otherwise I would've kept waiting for who knows how long! She literally kept staring at me every time she walked by like she was purposely avoiding me! \n\nWaited 25 mins waiting on my check. Although I wanted to order more food I didn't see that happening. It's a bit of a drive but I'd say go to the location in Henderson, much better service!", "useful": 3, "funny": 2, "cool": 2}, {"review_id": "C4d6y1vRVCdvDEBgTaQrAg", "user_id": "3I2wGF73UOPMuwSuzMCYWQ", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 4.0, "date": "2013-08-10", "text": "Good Chinese food is hard to find. Food is well made, priced right, and portion size was large. No real complaints. We ordered deliver which came super fast. Apparently the owners of China Palace also own Sushi Too which explains why my wife was able to order sushi over the phone even though it was not on their menu. Very Cool.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "-PuFi_-f27Rl_vrQOZa7jA", "user_id": "hRzmJCPmV1_ggM5jSxq2bA", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2012-05-25", "text": "Eggs are the best and in my view under rated food. This little joint is in the strip mall by Smiths on Lake Mead & Rampart. I ran in there for lunch on a weekday. I was seated at the counter and ordered an omelet with ham, mushrooms and Swiss. It was enormous and served with home made chips, coffee and toast. Simply delicious. \n\nThe restaurant is near Sun City so it is frequented by a mainly older crowd but I did see a few 'youngsters' , including a girls with a bunch of carrots tattooed on her leg! Most original!", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "UR-VDMPOGg71_PGMl2SDeQ", "user_id": "p30VbeNZC6mzRUTL6lg69w", "business_id": "0jtRI7hVMpQHpUVtUy4ITw", "stars": 4.0, "date": "2014-09-08", "text": "Haven't been here for awhile   The corned beef hash and home cut potatoes are still great. The service is always friendly.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "Gl5BdmyPV_h_SoNQMJ1hwg", "user_id": "gxRw9c2lvijXBNhKU5i7_g", "business_id": "f2FfutZhb4F-m1Ob0EdYaw", "stars": 4.0, "date": "2010-08-28", "text": "I liked it.  Huge portions, not too expensive, and it's really nice inside.  I like my cheesy general tsos, what can I say.  It's not cuisine, but if you want a big fat plate of sweet and sour pork in a relaxed ambience it's great.\n\nI'm psyched that they deliver.", "useful": 0, "funny": 0, "cool": 0}]