[{"review_id": "U-ICB4559Qv5MR03jgX1kg", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "oi3FWENKZ5y_bDCpEb8yOw", "stars": 5.0, "date": "2018-02-11", "text": "This review is wayyy over due. We visited this place a while back...I have the most sweetest memories of this restaurant. We were sitted at the patio, I ended up ordering the Rib-eye that just melted away in my mouth. That night I remember, everything was just Perfect!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "MVAlf-39F_sU1ruKPTHTGQ", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "hihud--QRriCYZw1zZvW4g", "stars": 3.0, "date": "2018-02-11", "text": "Clean. I admit they got the best kimchi soup. But the quality of the meat wasn't all that best.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "ndJHfE7GPlFTg25QlAP95Q", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "siuAD-vFRYAjozc332wq3g", "stars": 5.0, "date": "2018-02-11", "text": "One of my favorite place here in Las Vegas. Always pair your food with a glass of your favorite wine~ because you def gonna wanna with this romantic atmosphere!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "RrYb4vhJSgCtVb29pEmiHw", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "bAysF6IiT2JsBOyvxAUb4w", "stars": 3.0, "date": "2018-02-11", "text": "Well, So so.. I got a skincare here.. which wasn't too bad. But sorry, I've got a better place to go to.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "O3Zoe9ECdPRqUFjKl2g4VQ", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "_5eMIsRbyoY_aOw0jwIHHA", "stars": 5.0, "date": "2018-05-24", "text": "One of my goto place if I'm having any issues with my car. Excellent service. Everybody's very well trained. They follow up with me in a timely manner. Always very happy with their work. I feel very welcomed everytime I visit. Love their smiles!", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "OH-dmBL5bo8FzUST-lHHjQ", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "NvKNe9DnQavC9GstglcBJQ", "stars": 4.0, "date": "2018-02-11", "text": "Not bad... casual diner style. I believe this place opens very late.. 24hours perhaps. It's not the best, but def better than other 24hours diners around here", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "HNVEYQv15RVmey2zJsOVsQ", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "sqnr6XgcNNk26GHPq1_IpA", "stars": 2.0, "date": "2018-02-11", "text": "Ehhh... don't get me wrong..I love the organic stuff.. but the stylist messed up on my roots color, I had to visit another salon to fix it. The color correction costed me almost triple. I ended up spending about $800 on correcting this mistake. Plus the initial cost of $290 at this salon. Not a happy customer!", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "1ZFuxH42fUC2BQbqdA3oIg", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "pH0BLkL4cbxKzu471VZnuA", "stars": 5.0, "date": "2018-02-11", "text": "Fresh! This place really know how to make good sushi. Although staffs aren't the friendliest... I always tend to return to this place.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "UEWpc0g2gRhtz0aUJcjj7g", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "IRbgMt0cVuzK1KSppU16_Q", "stars": 4.0, "date": "2018-02-11", "text": "Fancy place. Excellent service. Mediocre food. They have private booths which was very impressive settings!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "n4bbG1S_AXN9Bwe627O5Ug", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "Vbal-AZnu2w6NttIKfdjDg", "stars": 5.0, "date": "2018-02-14", "text": "I'm not surprised to see an A+ reviews for this place. No doubt this is one of hidden gems of Las Vegas. Cozy settings with good coffee lists. And talk about an excellent customer service! Perfect place for anybody who's been looking for an authentic coffee for once.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "arCBldo5B6Xw8lQY4a6guQ", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "2m4092MsMzEHkuxodaj6-g", "stars": 3.0, "date": "2018-02-11", "text": "For three people, we ordered so much food.. one table wasn't enough. Half of the food were good, and the rest of the half.. wasn't my style. Mixture of Chinese/Japanese.. I wasn't really digging the Chinese food here. So, 3 star it is.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "Y4-qtf553bz4xNjJw2E1WQ", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "1nF8Me63cpxIkFK8Ysx-DA", "stars": 5.0, "date": "2018-02-11", "text": "A very casual hot pot place. 5 Stars because the mushroom stock actually contains real Mushroom! And they also got Spam. I can't say no to SpAM!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "91033bbZY3-FnpZaB5cfQA", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "JkncPZ1jFi0_n23Ptl8jGQ", "stars": 5.0, "date": "2018-06-18", "text": "First time here to get my gel manicure, and Tweety did such an amazing job. She followed my instructions well on just how I wanted my nail to look like. Very details oriented and she took time to do my French manicure. Another satisfied customer here:) I will definitely return to do my next fill!", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "KfA0ZqgLBdjtZmwxQ6XKEA", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "fAo-3jt3oD69nwnr5M6FLQ", "stars": 5.0, "date": "2018-02-11", "text": "Excellent service. I can't find any decent Chinese restaurant here in Vegas, I'm glad I came across this place. Five Stars~", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "xYW_8-TR5I6eIQLvFcca7w", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "qVO3l9Q0-KVQE7W9JL9ePw", "stars": 5.0, "date": "2018-02-12", "text": "If you're Korean, you can't miss this place. This is the biggest Korean Super market in Las Vegas..If you're up to some Korean home cooking tonight, you better start from here. P.s. if you're planning to grab some Kimchi, skip this place. W Mart on Sahara carries Kimchi that taste hundred million times better", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "3wmdlWk9grgrK_m7FxEoCg", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "beuVp5CZxCdNvQIIPBS2rw", "stars": 5.0, "date": "2018-05-24", "text": "Who can say no to Hot Pot..... I'm planning to keep my relationship with this place for a very long time. Casual dining place. Always feel comfortable walking in with my flip flops. Love the soup base. Quality of the meat isn't too bad. This is a Chinese Hot Pot restaurant.. don't be looking for Shabu Shabu here please.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "4jEtEacQ49BZ4XBhptDkpA", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "umXvdus9LbC6oxtLdXelFQ", "stars": 5.0, "date": "2018-02-12", "text": "What's up with the long line. I'll give six stars if it wasn't for such a long wait. But for now.. five stars only! Lol this place has the best desserts in town. The best. The Best!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "6JudHHqQ70RgPIlkEJwXzw", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "Lq9rYrwvWV5QDBYzq7MGHQ", "stars": 5.0, "date": "2018-02-11", "text": "What a great place for a tapanyaki nights! The food is amazing. I couldn't stop complimenting through out the entire dinner course!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "kV54ZcD02h6PCjsL8fjT5A", "user_id": "zKXzUMRSUMmG6PKFbDxmdw", "business_id": "kRgAf6j2y1eR0wOFdzFAuw", "stars": 4.0, "date": "2018-02-12", "text": "Ehh.. I guess I kinda like this place. They got some cute little tapas and a so so wine list. When I got no place to go for my wine nights, I will return~", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "r7W86HaTnQwXsgiDAa1IJA", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "EnCIojgP5KTr1leaysFE3A", "stars": 4.0, "date": "2015-10-23", "text": "It's always nice exploring new spots off the strip when I'm visiting Vegas. So many times have I been stuck eating at a hotel out of convenience because no one else wanted to leave. I've wanted to come here for awhile despite my bad experiences with arepas at other spots. It's located north of the strip in what looks like sketchier area with \n\nArepa is like a sandwich, but the meat is sandwiched between 2 flatbreads made of maize dough. The corn bun was crispy on the edges and much softer in the center.\n\nArepas:\n1) Reina Pepiada consists of chicken breast, avocado, mayo, and cilantro. I was expecting the chicken breast to be dry, but it was actually the opposite. \n2) Wood Fire Beef: This was fantastic! I added on avocado, cheese, and egg, which made it even better. The small pieces of juicy, tender beef were so yummy.\n\nThe empanadas were also pretty good, but the winner is definitely the arepas.\n\nDrinks:\nMango - Thick, sweet drink that was really mangoey.\n\nService: They got my order wrong and gave me pulled pork instead. They apologized and gave me an extra empanada for the inconvenience. SCORE!", "useful": 5, "funny": 0, "cool": 2}, {"review_id": "4arRWsuVhhfQcm8rTDxEjQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "awI4hHMfa7H0Xf0-ChU5hg", "stars": 5.0, "date": "2013-07-26", "text": "Awhile some of my friends kept talking about how good Oyster Bar was, so I decided to go to Harrah's to check it out. I was confused by their recommendations because the menu there was mediocre. At least the oysters were delicious. It turns out I was going to the WRONG one! My girlfriend and I were so excited to check this place out that we decided to leave the club early to eat here.\n\nThis place is called Oyster Bar for a reason. It's only a bar consisting of 14-18 chairs, so you can imagine that standing in line can take a long time. It took about 1 hour for us to get seated when there were only about 4 groups ahead of us.\n\nFood:\n1) Oysters of the day is a great appetizer. They were very fresh and large. I've actually haven't seen oysters this big. \nhttp://www.yelp.com/biz_photos/oyster-bar-las-vegas-2?select=FDG_fUoUjs-KavTq8D0Hng#JkeczflLv7omKCAepuho0Q\n2) Pan Roast Level 8 Spicy had a decent kick, but not enough to satisfy my spicy Asian taste buds. I think I'll go for level 10 next time. The tomato cream sauce was so creamy and savory that I couldn't put my spoon down. The portions here were so large that I had to take it to go despite my large appetite.\nhttp://www.yelp.com/biz_photos/oyster-bar-las-vegas-2?select=FDG_fUoUjs-KavTq8D0Hng#SdiA6-GgqYBGLTXtsph7pQ\n3) Gumbo - out of the few times I've tried gumbo, the gumbo here would have to be the best out of those experiences. The red brick roux was by far the best. \nhttp://www.yelp.com/biz_photos/oyster-bar-las-vegas-2?select=FDG_fUoUjs-KavTq8D0Hng#Mdd4OMnfoQf_Z8YFx5krig", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "UxQmxfTBwWP7Lvxe32FsyQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 3.0, "date": "2012-01-27", "text": "Wicked Spoon, located in the Cosmopolitan, is definitely hyped up and was a disappointment since it didn't live up to my expectations. It was awesome that we didn't need wait in an hour long line because my friend was an invited guest of the hotel.\n\nThe theme of the buffet is unique in that each item was already portioned in various \"spoons\" which were pretty much mini pots rather than in pans.\n\nEverything was a hit or miss and there were a lot of misses.\nHits:\nFried chicken\nsmoked salmon \nMac n Cheese\nChocolate covered strawberries\nStrawberry shortcake\n\nMisses:\nPrime Rib - Bland\nMoroccan Chicken - dry\nEggs Benedict - ham was tough\nBanh Mi - bland\nBBQ pork buns - dry\nCod -overly cooked\nShrimp - impractical. 2 shrimps per mini cup with minimal cocktail sauce\n\nThere were more items but I tried too many to recall all of them.", "useful": 2, "funny": 1, "cool": 1}, {"review_id": "KFyEZkp1nmTcjXYSvbx6yw", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "CiYLq33nAyghFkUR15pP-Q", "stars": 4.0, "date": "2015-10-13", "text": "I had such a fantastic experience the first time when it was on the strip near the Wynn that I crave it whenever I come to Vegas. I was very disappointed to find out after coming out of the XS that the location changed to somewhere far off strip. Finally when I had a car in Vegas, I took full advantage of it and drove over for a mid-afternoon snack. You definitely need to make the drive when you can to Tacos El Gordo. The Adobada fries are amazing!\n\nThe line system is kind of inconvenient. If you want Adobada/Al Pastor and Asada you have to wait in 2 different lines. If you want buche/lengua/tripa it's another line. So if you want a variety of meats, you could potentially be standing in 3 long lines. I recommend that you come with a group so you can split yourselves into each line. I wanted tripa tacos, but i decided against it because it meant I would have to wait an additional 30 minutes and I was on a time crunch.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "XfUNpovq2wEoxOkoStfGdQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "esBRj9uPRzwxaW4Lz1XGLA", "stars": 4.0, "date": "2012-06-12", "text": "Can you ever go wrong with bacon wrapped scallops?! Such soft scallops wrapped with slightly crispy bacon... Enough said.\nhttp://www.yelp.com/biz_photos/esBRj9uPRzwxaW4Lz1XGLA?select=pLRczvnXA6XtDrUDhjzxag#08IrO9UivhSGlb0dMWiMhQ", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "A-gFsm2B1E_tJEghfRVuUw", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "vchjO0Vs5FwW2tpFnCimqg", "stars": 4.0, "date": "2011-04-04", "text": "The Westgate Towers are awesome! My friends stayed in one of the suites and it was very nice. You could live comfortably here.\n\nDecor of the Hotel:\nVery modern and clean. As you come to check in, it looks like a nice LA club and lounge. All they needed was some bumpin music and I would've got my rage on in the lobby. The lounging area is very comfortable and there is a glass wall in which you have a view of the pool area. \n\nSuites:\n1) fully-furnished kitchen\n2) living room with several couches with a pull-out bed.\n3) View of the strip\n4) Remote Controlled projection screen that doubles as a curtain to block the sun.\n5) Jacuzzi right next to the bedroom\n\nService:\nThe staff were excellent in taking care of our requests. Hooked it up when something was wrong such as the jacuzzi not functioning.\n\nPool:\nNice pool area, but there's only one. This attracts a younger crowd.\n\nCasino:\nNo casino. You would have to go to the main hotel gamble..\n\nParking:\nShare a parking lot with the miracle mile shopping area. It's a little bit of a  walk. You can always valet. It's only one floor below the front desk check-in.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "pPPgnuE9cpYcwgNpP9Jl_Q", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "eoHdUeQDNgQ6WYEnP2aiRw", "stars": 4.0, "date": "2012-01-27", "text": "I don't need to go to NY anymore for frozen hot chocolate! I've failed in coming here over 15 times I came to Vegas. I came here strictly for dessert. Talk about a sugar rush! It gave me the energy to walk around the strip, and then I crashed in the room. It's ok. It was worth it! I came here around 3 and the wait was over 45 minutes!\n\nDecor:\nLooks like it was decorated by females for females. White walls with a souvenir shop consisting of hello kitty, domo, and other dolls. \n\nDessert:\n1) Signature Frozen Hot Chocolate - It's ok here. I've tried the one in NY and it's definitely not as good here. I'm pretty sure the other flavors are much better than the original.\n\n2) Hazelnut Amaretto Frozen Hot Chocolate - If you like the almond hazelnut amaretto flavor, this is HIGHLY RECOMMENDED. If you're not familiar with the flavor, you'll become a fan. It wasn't too icy and it was perfectly blended.  It was a little sweet because of the whipped cream. I guess I should've requested no whipped cream.  I wish I had more room in my stomach for dessert!\n\nService:\nGood and friendly service. All the staff members were very friendly and willing to help everyone out. \n\nIf the wait is long, eat something quick inside Caesars and come back in time for your name to be called.", "useful": 2, "funny": 0, "cool": 1}, {"review_id": "UD-ivx_vhIGLtZJwd308SQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "NIF9q-xwMzYkmFyE2BCJDQ", "stars": 5.0, "date": "2013-07-19", "text": "I love The Light! It's my new favorite Vegas club! There is always access to the main dance floor.\n\nPros:\n1) HUGE, so there's plenty of room\n2) Great ventilation\n3) Cirque du Soleil performers hanging from the ceilings\n4) Sold line up of DJs spinning every weekend\n5) Consistent access to the dance floor, while at other clubs, they block off the dance floor.\n6) Entire wall full of LED monitors\n\nCons:\n1) Dance floor is small, but larger than many of the other clubs in Vegas\n2) Hella crowded around the bar closest to the entrance, so it's difficult to get to the other side", "useful": 6, "funny": 2, "cool": 3}, {"review_id": "XFjhNcIOndmLr4CRuuU7bw", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "J3FUxMAHfCl-WFo86u5DqA", "stars": 4.0, "date": "2011-04-13", "text": "3.5 Stars\nThis show is hilarious!  \n\nI was staying at the Palazzo and my group of friends and I decided to go watch this show last minute. I guess they were trying to fill up the seats last minute and I ended up paying $45 for seats in the 6th row on the left side. For a $45 show it was definitely worth it. I wouldn't pay more than  $60 for the show.\n\n- There's a lot of visual effects from the paint they use. \n- Lot of audience interaction. They'll find people to bring up on stage to be humiliated. Some of the best parts of the show included audience members.\n- Be prepared to get dirty if you're in the front. \n- There were slow parts when I thought, \"just move on!\"\n\nOverall: Good, entertaining show. If you have to pay a lot, you're better off watching another show.", "useful": 2, "funny": 1, "cool": 1}, {"review_id": "Yiu61Lb2_p70HlMTgp89VQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "YhCAJ8acd1X7GkCHPhD8Xw", "stars": 2.0, "date": "2014-07-10", "text": "My friends and I came here because we wanted to eat something quick at the hotel we were staying at, and since most of our options during lunch were limited, we decided to come here.\n\nFood:\nAmerican Wagyu was just okay. When you see the words wagyu and truffle in the name and/or description, you can't help, but get excited to see how they executed the dish. I'd have to say that it was quite the fail. While I did taste the truffle, it did little to mask the dryness and blandness of the meat.\n\nBuffalo Fries - I don't know why it's one of their specialties. It's just fries with bleu cheese and buffalo sauce on the side. It definitely doesn't warrant the price tag.\n\nService: Our server was a ghost! I didn't see him/her at all. Someone else took our order and a different person brought out our food.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "kOT8d3XDcWnBzqsWoyAWCg", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "DnalbBqgX7afqSYgO5R8iQ", "stars": 1.0, "date": "2012-06-08", "text": "I really don't like coming to this chain. The food is soooo horribly bad that I don't understand how it's successful. The majority of my friends who I was with in Vegas  with apparently have no taste buds.\n\nAppetizer:\nCompared to the other entrees, the lettuce wraps were pretty good. However, as a standalone plate, it was nothing special. Anything will taste pretty bomb compared to the pizzas and pastas that I mentioned below.\n\nPastas:\nI tried about 3 different pastas from our group and they were ALL sooo dang bland! You can make better pasta by heating up some Prego and boiling some noodles at home. Definitely NOT worth even considering them. \nhttp://www.yelp.com/biz_photos/DnalbBqgX7afqSYgO5R8iQ?select=dcidkX-AUWWi2rO_efvwKg#dcidkX-AUWWi2rO_efvwKg\n\nPizzas:\nThe bread was crusty... Nothing can ruin a pizza like messed up bread when it's supposed to be freshly baked.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "WNZJ6_0HSCTsFXskf4aTqw", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "Rw-xnNlDuwekyMw_THUfGg", "stars": 3.0, "date": "2011-04-04", "text": "I came here because it was the most convenient place to go to and it was right next to the sportsbook. This isn't really a place you should go to if it's out of the way. The items don't come with sides, so you have to order it.\n\nI ordered the triple decker sandwich which contained pastrami and brisket. The pastrami was decent, but the brisket killed the sandwich for me. \n\nThe spicy fries weren't really that spicy. It just had a little cayenne pepper. Not really worth it.  You should order the garlic parmesan fries instead.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "E2qYzEtQtYs3rd9sa-qlWA", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "7sPNbCx7vGAaH7SbNPZ6oA", "stars": 3.0, "date": "2013-06-10", "text": "I initially heard about this place from a friend who mentioned oxtail chili cheese fries and I was immediately intrigued. Sadly, I couldn't eat it during that trip, so on my next Vegas trip, I decided to make a stop here before heading to the strip. Thank goodness this place closes late because I didn't think we'd make in time from LA. This would be the first time I tried a burger with Asian infused flavors.\n\nFood:\n1) Ronin Burger was good, but not spectacular. I enjoyed the Angus beef, caramelized onions, the gooey fried egg, and the crispy texture of the coleslaw. However, along with the Miso Goma, Yuzu and Citrus Aioli, it was too saucy and it had too much sweet flavor going on in a burger. I actually prefer a more savory rather than sweet flavor on a burger.\nhttp://www.yelp.com/biz_photos/bachi-burger-las-vegas?select=V5kPRRaoHF6UCdwU-3-XWg#7CC4LhQgNIOvut_ilHgPEg\n\n2) Oxtail Chili Cheese Fries tasted just like chili cheese fries. The chili was surprisingly light for chili. I could tell that there was a little bit of a difference in texture, but the flavor of the oxtail wasn't obvious. If it oxtail weren't mentioned in the name, I wouldn't have known that there was oxtail in there. There definitely wasn't a noticeable difference enough for me to spend that money on it.\nhttp://www.yelp.com/biz_photos/bachi-burger-las-vegas?select=V5kPRRaoHF6UCdwU-3-XWg#i_RIwA6P6rcLwhxdKJVBBg\n\n3) Truffle Fries were some of the best I've had, but the sauce was only drizzled on the top, so there definitely wasn't enough of it for the rest of the fries.\nhttp://www.yelp.com/biz_photos/bachi-burger-las-vegas?select=V5kPRRaoHF6UCdwU-3-XWg#TcId2ISk5G8_x0SGno4Stw\n\nService:\nOur server was friendly; Food was brought out in a timely fashion; Refills were constantly given.", "useful": 2, "funny": 2, "cool": 2}, {"review_id": "B6TTMRC6llm7tkLxSvuSng", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "5shgJB7a-2_gdnzc0gsOtg", "stars": 5.0, "date": "2012-03-01", "text": "I've heard so much about Firefly from some locals, so I FINALLY had the opportunity to check this AAAMMAZZING place out. It definitely lives up to the hype and everyone's raving recommendations. I'm starting to think that I need to venture off the strip for better tasting food for cheaper prices.\n\nAmbiance:\nFirefly has an amazing vibe. It's dimly lit, quiet, and chill. I like how you can sit on couches as opposed to chairs. You can sit comfortably on the couches while you sip on some delicious sangrias.\nhttp://www.yelp.com/biz_photos/5shgJB7a-2_gdnzc0gsOtg?userid=0f_0XfO2qcgNwSJAHwfR9g\n\nFood:\n1) Filet Mignon Sliders - Sliders are always a safe bet. SOOOO GOOOOOOOODDD. The meat was tender and the caramelized onions, of course, are always welcome on a burger\nhttp://www.yelp.com/biz_photos/5shgJB7a-2_gdnzc0gsOtg?select=qUWwQJqRjOxq2kpOnK43hA\n\n2) Smoked Salmon Toasts - if you like the fresh salmon taste, this is definitely a must! capers, pickled red onions and dill sour cream were great on the smoked salmon. yummmm\nhttp://www.yelp.com/biz_photos/5shgJB7a-2_gdnzc0gsOtg?select=WCj5SXOvDukxgxMhv4lLVw\n\n3) Shrimp Ceviche - very fresh.\nhttp://www.yelp.com/biz_photos/5shgJB7a-2_gdnzc0gsOtg?select=Da3M9N2PDmtRd6QiH9azrQ\n\n4) Tuna Tartare - Didn't taste as fresh as the shrimp ceviche or the salmon, but it was still pretty dang good.\nhttp://www.yelp.com/biz_photos/5shgJB7a-2_gdnzc0gsOtg?select=UlE5AF8h0VoL7UxC8CO8JQ\n\n5) STUFFED DATES were PERFECT! Even after reading all the reviews, I was still skeptical since I hate dates. However, I will ALWAYS order the dates here because they were bacon-wrapped and contained smoked almond, red wine reduction and blue cheese. The bacon combined with the almond, reduction, and reduction masked the flavor of the dates. Whatever they did, it WORKS.\n\n6) Firefly Fries - can't go wrong with parmesan, herbs, and garlic aioli on fries. Not too salty, but enough flavor and perfectly fried.  \nhttp://www.yelp.com/biz_photos/5shgJB7a-2_gdnzc0gsOtg?select=WLctqbU82YT1yw6nSKfLBQ\n\n7) Manchego Mac n' Cheese - I love mac n' cheese and it didn't disappoint here.\n\n8) Grilled octopus - FAIL. Overcooked and too chewy.\n\nParking:\nPlenty of free parking in the strip mall parking lot. Not crazy like the strip.", "useful": 4, "funny": 1, "cool": 2}, {"review_id": "XBW9sLlFs1VVsGPgR6q9Hw", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "iCQpiavjjPzJ5_3gPD5Ebg", "stars": 4.0, "date": "2013-07-02", "text": "Holy crap the wait was soo long! I must've waited at least an hour. It was such a tease because I could see the pizzas and smell the aroma of freshly baked pizza, but the line was moving at a snail's pace! If I didn't see a line of people extending out of the place I wouldn't have been able to find it. It's just a hallway riddled with albums and artwork on the 3rd floor right outside of Marquee.\n\nI ordered the sausage, pepperoni, and bell pepper pizza. The sausages were amazing; they weren't the typical types that you encounter at many pizza joints. I liked the sauce and the crust. The combination of sausages and pepperoni was too salty. One or the other would've been perfect.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "Zvx0PlVvadZChoWVAf9eKg", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "qSP6RqBJUyJRsQKTarlo6g", "stars": 4.0, "date": "2012-01-30", "text": "Looks like a spooky, haunted mansion.\nGreat After Hours place to party!\n\nMusic;\nIt was pretty much house music when I went, which was fun!\n\nParking:\nIt can get pretty busy, so you'll most likely have to valet, which will take awhile.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "QQPDhRcm1xsHVc2-Sw4gDQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "YQ--LJ7pvjiDSqNv0TuKTQ", "stars": 5.0, "date": "2014-12-14", "text": "As soon as I touched down in Vegas, my friends were craving Tacos El Gordo, so we walked all the way over there from the Venetian only to find out that it was closed! We were disappointed at first, but that disappointment disappeared as I discovered Grimaldi's was at the Grand Canal Shops on our way back to the hotel. \n\nI wasn't able to try the Grimaldi's when I was in NYC yet, so we rallied on over for one of my best NY style pizza experiences in my life for the following reasons\n1) Ingredients were delicious\n2) Marinara sauce was incredible\n3) Bread was light, thin, and slightly crispy around the edges.\n\nIn a way, I'm glad Tacos El Gordo wasn't available or I wouldn't have had the time to check this place out.", "useful": 4, "funny": 0, "cool": 1}, {"review_id": "Y6WoXFu_MN4kXzAom5lmwg", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "ecBpMmQGGlUWtvPNkoYBIA", "stars": 4.0, "date": "2012-11-05", "text": "Jetblue is always consistent in its excellent service, on-time cheap flights, and relatively smooth flights.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "knYYzF4gQ2l_Bhp8b7Z1vA", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "mUdalYTuAtnZm2K9zoH27Q", "stars": 5.0, "date": "2012-01-27", "text": "Talk about FINE DINING! Luckily we just strolled in here and got a table immediately without a reservation.\n\nDecor:\nFancy, modern. There's seating around the kitchen, so you can watch all the chefs making your dishes. It's fun to watch!\n\nFood:\nWe ordered the tasting menu, which consisted of what seemed like an endless number of courses. I felt like food just kept coming out nonstop! At some point, I gave up trying to remember the dishes and how many courses we ate because it required too much brainpower. The food was DELECTABLE. Joel Robuchon definitely knows how to please the palate.\n\nMy one disappointment was the bread. It was too dry. Felt like someone just doused my mouth with powder. The cheese, however, was delicious.\n\nWine:\nGreat wine selection, however, my liver wouldn't have been able to handle another glass of liquor from the weekend, so I decided to pass. \n\nService:\nPERFECT. Everything was well paced and taken care of without either of us having to request anything.  They gave very detailed, elaborate  description of every entree they dropped off, but I kind of zoned out because I didn't know like 60% of the terms they used.", "useful": 1, "funny": 1, "cool": 2}, {"review_id": "Hxv3M7pQI7mNrJzUjCF8-A", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "a3APDveO8DSEIp7o1f24hw", "stars": 4.0, "date": "2011-01-06", "text": "ZoozaCrackers Deli is located in the Wynn Hotel by the sportsbook. If you're looking for casual dining at the Wynn, ZoozaCrackers Deli is the way to go.  I tried the pastrami, the chicken BLT, Manhattan Clam Chowder, Chicken Noodle Soup, and Fries.  They were all delicious. Good quality meat. \n\nThe half sandwich and half soup combination is a pretty good deal.  Everything else per entree is a little pricey, but that's what you should expect at the Wynn.  \n\nService: Friendly and helpful\n\nFood: good quality\n\nCleanliness: very", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "UWdr1kQU3dx8ZXBYvo1d7A", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "VsewHMsfj1Mgsl2i_hio7w", "stars": 5.0, "date": "2012-06-02", "text": "Never would I have thought to come to LAVO for dessert. I thought it was just a club.\n\nI came here for one reason: FRIED OREOS! Sooo soft, warm and FANTASTIC! It was surprisingly light unlike the ones at Carnivals. The Vanilla Gelato that was served with them made the dessert PERFECT!\nI ordered it to go, but I couldn't contain myself and i tore that to-go box up and ate it at the bar\nhttp://www.yelp.com/biz_photos/VsewHMsfj1Mgsl2i_hio7w#t-DhxUlDTT6T8wgDmc2LMQ", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "qoLqwiPrbLEaTpqqk3yHyQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "9wjTzw8bEYOTQJk41V8WQw", "stars": 2.0, "date": "2011-03-19", "text": "This is one grimy hotel and casino. Of course I didn't expect much of the IP to begin with, but I was pretty disappointing. I was actually surprised that they had keycards instead of keys. \n\nPros:\n1) Great location. Centrally located and is on the center strip.\n2) Prices are relatively reasonable.\n3) You could actually walk onto the patio and have a view of the strip in the penthouse floor.\n\nCons:\n1) Check-in lines at the front desk take forever because they only have a few staff working.\n2) Every time I step into the elevator there are more beer bottles and cups lying all over the floor. Feels like the aftermath of a college party.\n3) Restaurants aren't the greatest of quality. Only ate here because it was convenient.\n4) Casino is pretty small.\n5) Rooms are poorly decorated. Looks like they haven't changed the style since the 1990s.", "useful": 2, "funny": 4, "cool": 2}, {"review_id": "s_z0IsMRkzDSYTNP8TUJOw", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "PXShA3JZMXr2mEH3on5clw", "stars": 5.0, "date": "2015-10-13", "text": "My girlfriend and I wanted to check out somewhere new for breakfast. Little did we know that Egg Works was the same company as Egg & I which we loved. Pretty much the same menu with a different name.\n\nCountry Fried Steak was awesome! The batter was crispy and while the meat was juicy. The gravy was thick and flavorful, but not too overwhelming.\nChile Rellenos - it was good for an American restaurant.\nBanana Nut Muffin - warm, buttery goodness. Free with Yelp Check in!\nHabla Diablo Potatoes were fantastic! I'd come back just for these. \n\nService: Good. If you need something, you can just flip the metal egg face to indicate that you need service.", "useful": 3, "funny": 2, "cool": 1}, {"review_id": "SFyQsm5nR7JJTIUcmEWCDw", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "EAwh1OmG6t6p3nRaZOW_AA", "stars": 4.0, "date": "2011-01-30", "text": "When you think of Vegas, you think of nice hotels, bright lights, good looking people. Ellis Island does not fit into that image of Vegas. It's one of the more ghetto parts of Vegas. People here around 3am are drunk and worn out from drinking/clubbin and aren't looking their best LIKE ME.\n\nHOWEVER, the restaurant is open 24 hours and has an AMAZING deal.\n\n4.99 Steak and Eggs! This is why I come here after fun night of drinking and clubbin.\n\n6oz ham steak that hits the spot served with hash browns, eggs, and toast. For this price, you can't complain and it'll satisfy your munchies, especially the drunken munchies.\n\nDefinitely come here for late night cravings, or if you're broke from gambling and need some food to comfort you.", "useful": 1, "funny": 3, "cool": 1}, {"review_id": "fW1Te7rfYMI_fHOhuoowfA", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "-wuqvqzPR0pHkxCT3SMtIA", "stars": 3.0, "date": "2012-06-12", "text": "Music:\nWith the rise of House music, the number of clubs that spin Hip-Hop is dwindling. Or they do spin Hip Hop, but only for a minor portion of the night. As much as I love House, (I can't believe I'm saying this), it's refreshing to go to a club with hip-hop. It might've been a unique night since Ludacris was performing.\n\nCrowd:\nA large portion of the crowd was African-American. Felt like a token in that crowd, but still fun nonetheless.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "sOz2CBjfyCCQJ8I-yrpAaw", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "WUq8HJHIZU4uteB154XN7w", "stars": 5.0, "date": "2011-04-04", "text": "Marquee is awesome and has to be my favorite club!! It's the most popular club on the Strip as of now, which means that the lines are really long, so you would have to arrive early to get in. If you come late and don't get bottle service, you will NOT get in.  I was eating at Holstein's next door for dinner and people were already lining up around 8:30 pm!\n\nVenue:\nMulti-storied club with multiple DJs spinning different types of music.  Very modern and chic. Just take a look at the pictures.\n\nMusic:\n1) Lower Level - Hip-Hop, club mixes, Old-school Hip-hop as well.\n2) Middle Level - Main Floor. The DJ was spinning House until ATB started spinning at 1am. SOOO SICK! He's awesome live. Marquee is known to have some very popular DJs to spin on Sat nights.\n3) Top Level - Lounge and bottle service.\n\nCrowd:\nThe crowd is pretty young. Seems like everyone is under 30.  Lot of attractive women.\n\nCons:\nIf you want to move to different floors, you have to navigate through a lot of people and stairs. Could prove to be quite a difficult task if you've been drinking.", "useful": 6, "funny": 3, "cool": 5}, {"review_id": "71681Us0FQHWLlMi8y4nwQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "EVxY3Vcc-4uavsq2CQsk3g", "stars": 4.0, "date": "2011-04-04", "text": "Located at the Wynn Hotel, Tryst is one of my favorite clubs in Vegas. Came here on a Thursday and it was still poppin. There was still a line, but we didn't have to wait a long time at all.\n\nDecor:\nModern, chic. One main dance floor adjacent to the outdoor area, which has an awesome waterfall and lake area, which you can see in the pictures. There are table inside and outside and separate areas for just tables/bottle service.\n\nMusic:\nDJs spin a mixture of house and hip-hop, which makes for a good night.\n\nCrowd:\nMid- and Late-twenties crowd. Many attractive people. \n\nDress code:\nDress to impress.", "useful": 3, "funny": 1, "cool": 2}, {"review_id": "nR_4Abh3mTMwaBHed4JsgQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "M51gw2cz_vXarNBLbKkOxQ", "stars": 4.0, "date": "2013-07-27", "text": "At the end of our Vegas trip, we wanted a decent breakfast spot away from the strip because all the good ones around the area were packed. This place was recommended, so we decided to check this modern breakfast spot out. I only wish that this place was closer to the strip. I guess that's why it was so easy to find a table to fit our group of 6 right away.\n\nFood:\n1) Coffee Cake was fantastic! The coffee cake here deserves 5 Stars. It was freshly baked, soft, moist, and perfectly sweet. I would actually make a pit stop here just for this if I'm driving to and from Vegas\nhttp://www.yelp.com/biz_photos/the-cracked-egg-las-vegas-2?select=6Nzg1wAdBviOQNXVmfXlkg#oZXMxk_GLSoepyhkWveiJQ\n\n2) Country Benny - Biscuit split and topped with patty sausage, two poached eggs, and smothered in gravy. I liked the gravy because it was flavorful and had a good consistency (not too watery or too thick). The eggs were poached well and the seasoned potatoes were so good! \nhttp://www.yelp.com/biz_photos/the-cracked-egg-las-vegas-2?select=6Nzg1wAdBviOQNXVmfXlkg#V-3L8nJ43gnSCuKv08V0wQ\n\n3) Sausage and Eggs were pretty standard thick links with eggs and seasoned potatoes. It was good, but nothing special. You could probably buy the same links at a market and make it yourself.\nhttp://www.yelp.com/biz_photos/the-cracked-egg-las-vegas-2?select=6Nzg1wAdBviOQNXVmfXlkg#fbjiuYm9Je2vHxb9QXLOaw\n\nService:\nThe servers were very nice and checked on us regularly to see how we were doing. You actually have to go up to the front to pay, which I found to be pretty inconvenient.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "aC-hNppUmWhKSDY-EgXIiQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "_pBXtjN43eqMV0XZTz7nmw", "stars": 3.0, "date": "2012-01-27", "text": "Surrender is definitely a smaller version of XS Club at the Encore. They have popular special guest DJs, pool area with cabanas, similar decor, and bungalows. This place is that there is a lot of SPACE to roam around aimlessly while drunk. \n\nHowever the dance floor can't seem to hold very many people. It felt packed like sardines. Everyone was pushing and my friend tripped over someone's foot and got kicked out because they thought she was too wasted.  They need to regulate how many people go in or out of the main dance floor.\n\nMusic:\nSurrender hosts many popular house DJs. I came here to see Calvin Harris and it was poppin! At least what little of it I remember.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "j_23gkVAbzyhQP7ahVd69w", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "KskYqH1Bi7Z_61pH6Om8pg", "stars": 4.0, "date": "2015-10-14", "text": "I kept hearing from multiple sources how great Lotus of Siam was, so I immediately bookmarked it, but after many failed attempts while in Vegas I was beginning to feel that I would never get to check it out. As I was beginning to forget about LoS, I was reminded and managed to wake up in time to come an hour before closing. There was no wait that all my friends complained about. Sweet!\n\nLotus of Siam is located in a sketchy-looking strip mall off strip. Don't let the area scare you away, because you'll have a enjoyable meal. Nothing like a little bit of anxiety to stir up an appetite. Based on the looks of it, you wouldn't have guessed that it won a bunch of recognitions and popped up on shows and magazines.\n\nFood:\n1) Pad See Ew is always a safe and solid option. I always have to order it when I eat Thai.\n2) Green Curry - I haven't had a bad experience with Thai curry, *Knock on wood* It was savory and creamy.\n3) Crispy Rice - I didn't expect the crispy rice to be limy. I personally like the limy flavor, so I personally enjoyed it.\n4) Tom Yum Soup was good. It didn't particularly stand out from all the other ones I've tried. Other than the price tag.\n\nService: Decent. Nothing special.\n\nOverall: Good food. The taste was on the better side, but the portions were lower while the price was higher than all the Thai restaurants I've been to.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "umcet-orFUcSQcTzpDRkAQ", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "j5nPiTwWEFr-VsePew7Sjg", "stars": 4.0, "date": "2013-07-09", "text": "Ichiza is a solid Izakaya with fair prices, good food, and open late. Many of their items aren't on the menu, so make sure to look around on the walls for the other items. It's a small place, so it'll take awhile if you come with a large group. \n\nFood:\n1) Beef tongue - If you like the texture of tongues, then you'll like it. It was flavorful, but some of my other friends didn't like it because of its texture.\nhttp://www.yelp.com/biz_photos/ichiza-las-vegas?select=Z50FudnbVN6ZBijm1ZbHkw#MRiWPQNDdzQCkixIA1dyJQ\n2) Beef Bowl tastes just like Yoshinoya, but with much better beef quality and without the post-meal coma.\nhttp://www.yelp.com/biz_photos/ichiza-las-vegas?select=Z50FudnbVN6ZBijm1ZbHkw#gZx7dyZbOl6wM_mgAJGEWg\n3) Yellowtail Tartare was layered like a sandwich with chips instead of bread and topped with avocado and yellowtail poke. The fish was fresh and the sauce was delicious.\nhttp://www.yelp.com/biz_photos/ichiza-las-vegas?select=Z50FudnbVN6ZBijm1ZbHkw#GUUzqj8B-3qeH4fXYtwVQg\n4) Miso Black Cod was buttery and soft. It was cooked to perfection! There was just enough miso for the right amount of flavor, so it wasn't overpowering.\nhttp://www.yelp.com/biz_photos/ichiza-las-vegas?select=Z50FudnbVN6ZBijm1ZbHkw#jaRWq-B8P--y_9RtXJrNGA\n5) Fried Calamari - It wasn't that great. I've had much better. I recommend you order something else instead because there are many better items for the same price.\nhttp://www.yelp.com/biz_photos/ichiza-las-vegas?select=Z50FudnbVN6ZBijm1ZbHkw#79IniSib3kGjGXCips_edg\n\nService:\nThe place always seems busy, so it's difficult to get everything in the time you want. Nevertheless, the staff here work hard, and they'll make sure to take care of you as long as you get the chance to flag them down.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "RW0wYgOoI26JCfVV37fZTg", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "jpKWhKMWlOpTH14XW-NwQQ", "stars": 4.0, "date": "2014-07-10", "text": "Drai's Beach Club is located at the Cromwell Hotel. This place isn't too big, but it has a nice view of Vegas and a decent line up of talented DJs. We got a table and the service was excellent. My one gripe about this place is that the floor is slippery! They don't have any of the black grip on the floor anywhere except the stairs. This one girl slipped right in front of us and started bleeding. Not long after as I'm walking towards the pool area I slipped as well (Not because I was too drunk). Thankfully I landed on my ass, which has plenty of cushion to lessen the impact. So be careful as you walk around the place.", "useful": 2, "funny": 3, "cool": 2}, {"review_id": "RLojak2DhaKa8JB1kCdatg", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "MpmFFw0GE_2iRFPdsRpJbA", "stars": 4.0, "date": "2011-01-24", "text": "4.5 Stars.\n\nThe nicest club I've ever been to.  Pretty big dance floor, gogo dancers, lot of tables for bottle service and multiple bars. I always had a good time.\n\nOn a standard weekend, the line is extremely long, so it'll take you forever to get in and sometimes the cover can go as high as $50. Even though XS is big and it extends into the pool area, it gets pretty crowded and it becomes difficult to navigate.\n\nSuggestions:\nXS is so much better on weekdays because it's not as crowded, but there are still a good amount of people. It also doesn't take as long to order drinks on weekdays.  \n\nOn weekends, If you don't have a table, go early, get the stamp and return later.", "useful": 4, "funny": 1, "cool": 1}, {"review_id": "MSzPFB6mbw8epQ6eCynxIA", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "w8RWhhuKxMiFCpvFvIQ3zg", "stars": 4.0, "date": "2013-06-17", "text": "I was looking for a brunch spot close by and I happened to discover Max Brenner at the Forum Shops next to Caesar's Palace. It must've taken at least 20 minutes of meandering the labyrinth that is the Forum shops to get here. The place was so hard to find! It may have been due to the previous night's shenanigans.\nFood:\n1) Huevos Rancheros Sunrise Breakfast burrito was soo good! Eggs, spicy chorizo sausages, tomatoes, pepper jack cheese served with home fries. This was one of the better spicy chorizo sausages that I've tried. The home fries were uh-mazing! I only wish the portions were larger for the price we were paying.\nhttp://www.yelp.com/biz_photos/max-brenner-las-vegas?select=9lB5ksGR8JzyTny1S0JROQ#976wPqYtH4eN3HC-7pLbEA\n2) Cande's Killer Breakfast Skillet consisted of eggs, sausages, bell peppers, onions, tomatoes, spinach, home fries, and mushrooms scrambled together on a skillet. It didn't taste any different from the scrambles I've tried elsewhere. The only thing that really stood out from other establishment was the home fries, which I mentioned above. I'll probably try something or the burrito the next time I come for breakfast.\nhttp://www.yelp.com/biz_photos/max-brenner-las-vegas?select=9lB5ksGR8JzyTny1S0JROQ#aDEY-bnNeYQ3_AQhBL97Bw\n3) Crepe consisted of hazelnuts, chocolate, and fruits. I've plenty of delicious crepes, but none of the those can compare to the hazelnut that was used here. It was decadent and it simply just blew my mind. Considering the ingredients, it wasn't overwhelmingly sweet, which is quite an accomplishment.\nhttp://www.yelp.com/biz_photos/max-brenner-las-vegas?select=9lB5ksGR8JzyTny1S0JROQ#h-jLRVolorVhw10MvboUvA\n\nService:\nThe server was very knowledgeable about the menu and helpful.  \n\nNote to self:\nCome during 3-6 and 9-close Mon-Fri for Happy Hour. Try the chocolate fondue, ice cream, waffle fries dusted with cocoa next time.", "useful": 4, "funny": 1, "cool": 2}, {"review_id": "7D-O5iQl1Vt1gkrkNdT-mg", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "qEJjv2k8nDhOiYpmi_aVOw", "stars": 1.0, "date": "2013-06-03", "text": "TAO Beach is the tiniest place to hold a pool party! You have to pay ridiculous prices for a poor excuse of a table that'll fit 4 people . Save your money and go elsewhere for a pool party. OR pay extra for a better size table at a different day club.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "c1M7FpDDqjVgwNHClk41GA", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "JyxHvtj-syke7m9rbza7mA", "stars": 4.0, "date": "2014-07-10", "text": "AYCE is always a must with my group of friends when they come to Vegas. Everything they do here is out of control. Excessive gambling, drinking, and partying. To finish off the weekend, there is also a need for excessive eating since they didn't get much nutrition in their bodies all weekend.\n\nFood:\n$26.95 for All-You-Can-Eat Sushi Dinner. This is probably one of the best AYCE sushi spots that I've tried. The nigiri portions come out small, which isn't much of a problem since it's AYCE! The menu is really extensive. There are plenty of options including the kitchen items. The only items they limit per person is the uni and the ama ebi (Sweet shrimp)\n\nDessert:\nIt even includes AYCE dessert: Green tea ice cream, lychee sorbet (AMAZING), tempura vanilla ice cream. They also have green tea creme brulee, but they limit it to one order per person.\n\nService:\nWow the staff here are quick! I came with a group of 9 and they brought out everything with alarming speed. I guess it's expected because they only gave us a 1 hour time limit on the AYCE.", "useful": 3, "funny": 1, "cool": 1}, {"review_id": "mjFlCO3ufPDV7c_Jk4GMTw", "user_id": "0f_0XfO2qcgNwSJAHwfR9g", "business_id": "yfxDa8RFOvJPQh0rNtakHA", "stars": 4.0, "date": "2012-02-26", "text": "Pho places always have the most amusing names... like phobulous, or pho king.... \n\nThis place is open late so it's a perfect place to come after a long night drinking and partying. It'll definitely help prevent and cure hangovers.  The prices were pretty decent and weren't as overpriced as the restaurants on the strip. \n\nFood:\n1) Salt and Pepper Shrimp - this is amazing! I've become a huge fan of this ever since I came here.  The amount of garlic + jalapenos give the dish an amazing flavor with a considerable amount of kick. Although I haven't been able to find very many places that make it  as good as this establishment.\nhttp://www.yelp.com/biz_photos/yfxDa8RFOvJPQh0rNtakHA?select=9hI7mkZ4PHU7SjC5hxZqLA#6l3mLudSmvBqIIb6fwf0yA\n\n2) Egg rolls were pretty good, but smaller than the ones I'm used to ordering. \n\nPho Kim Long is definitely a much better deal than many of the restaurants on the strip. You get delicious food and reasonable prices.", "useful": 2, "funny": 1, "cool": 1}, {"review_id": "TmiEq1LWxXLWJ_9kKJey6g", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "EnCIojgP5KTr1leaysFE3A", "stars": 4.0, "date": "2013-02-19", "text": "I went looking for this little gem after a night out downtown.  We stumbled up right around closing time, but the staff were still really friendly and accommodating.  I didn't even bother looking at anything on the menu besides the arepas.  I mean, it's called Viva Las Arepas right? Not Viva las other stuff on the menu.\n\nI got the pork arepa.  It was savory, cheesy, ridiculous goodness between two moist cornmeal buns.  This place makes me wish I had four cow stomachs so I could physically put more arepas in my body.  The arepas look small, but I think they're perfectly portioned and definitely satisfying.", "useful": 1, "funny": 1, "cool": 0}, {"review_id": "ijkWqcf417KinrqanCR51Q", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "Kf7LG3TToplM3eH9Zrz3ug", "stars": 5.0, "date": "2013-04-07", "text": "I'm a fan of the UNLV gym.  I can always find a free day locker in the women's locker room, there are always machines available, and they offer a lot of options to maximize your workout (classes, cardio machines, weight lifting equipment, indoor track, swimming pool, etc. etc.). I played racquetball here for the first time the other day and I am definitely a fan now! \n\nAs a student, I love the accessibility.  I can park anywhere on campus and walk to the gym (I consider it part of my workout) and I can do my own thing without being bothered or work out with some friends.  I love that it's included in my tuition and offers all the same stuff as gyms other people pay for.  Also, the hours during the semester (6a-12a M-F) are great and offer no excuses to fitting in a workout.\n\nIf you're a UNLV student, definitely take advantage of this opportunity and use the gym!", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "460Jrp797aQ3vDQ4CbCHZw", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "uGupeWqih0yIcCg8anM1PA", "stars": 5.0, "date": "2013-02-21", "text": "Prestige is a private concierge lounge located on the 23rd floor of The Palazzo.  It has it's own separate check in area (open from 7 am - 9 pm) and a lounge where they serve breakfast, afternoon snacks, evening hors d'oeuvres and have an open bar from 5-8 pm.  The lounge has a wonderful view with huge windows that span the length of the lounge looking out towards the strip and TI and MIrage. It's decorated in a classy and comfortable manner and there's even a baby grand piano that plays itself situated in the middle of the main lounge area.  The suites you stay in are the same as the regular Palazzo suites, so that means they're still spacious (about 720 sq ft) and beautifully decorated.  You basically pay for the extra amenities and to use the lounge. So, you can pay for the Prestige suite ahead of time or if  you have a Palazzo or Venetian reservation already, you can upgrade to Prestige for an extra $100+tax per night for 2 people.\n\nAlthough I'm a local, I've actually staycationed here a couple times and recommend staying here to friends coming into town who have the finances to do so.\n\nAs far as the staff, the Prestige Agents are really helpful and personable.  They really take their time checking you in and talking to you.  They are actually all concierge agents and can help you book shows, tours, dinner reservation either at the Venetian and Palazzo or somewhere else.  And because it's a private lounge, they usually remember your name and make you feel like you're not just another guest staying at another strip hotel.  If you're a tourist and don't really have your Vegas trip planned, this is a great way to find options and get personalized recommendations.\n\nThe food is pretty good too.  The breakfast presentation isn't too extraordinary, but some of the hors d'oeuvres in the evening are really good.  On the weekends, the have casino restaurants (like Valentino) cater part of the dinner presentation.  It's a great way to try some higher end restaurant food without having to pay extra!\n\nHonestly though, what I really like is the open bar.  If you come here with a group of friends, bachelor party, bachelorette party, date, family, or whomever, the open bar serves you from 5 pm - 8 pm and it's a full bar. \n\nIt's really a great experience with really friendly staff (the servers in the lounge are really attentive and friendly and clear your plates and grab drinks in a really timely manner).  Depending on how often you actually utilize the lounge (and I definitely do for the drinks!), the upgrade charge pays for itself.  If you're a tourist looking for a more romantic or special Vegas trip, or if you're a local looking for a romantic weekend or special staycation, I would definitely recommend looking into Prestige and consider booking it!", "useful": 17, "funny": 0, "cool": 5}, {"review_id": "tiazJJKXmGTsGiM_FZR3uA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "rioQ_p2pILNbJ4Xp5jW6-Q", "stars": 4.0, "date": "2014-02-04", "text": "I don't care what a container park is, this place is awesome!  \n\nI had no idea what to expect going in, and afterwards I found myself enchanted with this place and wanting to ask all my friends why they haven't been here yet. It's basically a little community of shops, restaurants, bars, a hair salon, treehouse of slides, and outdoor stage with live music. During the day, kids roam around with their parents. But after 9pm, they kick all the little kids out and the big little kids get to play with all their stuff!  The treehouse side (as epic as it is) looks super unstable and like a lawsuit is waiting to happen, but it was really fun to ride.\n\nI love the open concept of the whole place. Live music is awesome. You can order a drink from here and drink it over there. You can order food from there and eat it over here. No problem. I really liked it.\n\nIt's like nothing else we have in Vegas, and I like it. \n\nSo, why haven't you gone yet?!", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "Y0sfXNOWVDTzIt3K0g5m9w", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "K7fip0nDFFdCC7OCnNOotQ", "stars": 3.0, "date": "2013-02-19", "text": "For a nightclub, Hyde is REALLY small.  There's just the main room, the outdoor area, and the little other area with the other bar.  All areas are connected and open.\n\nI've been there multiple times and I still don't know if they have a dance floor and where it is.  The famed view of the Bellagio fountains is still my favorite and I do love seeing the show when I'm there although you can't hear the fountains music because of the club music.  Other than that, Hyde is just okay.  \n\nThe waitresses aren't very friendly, even when you have table service.  One night, our waitress disappeared so we asked another girl who was just standing there if she could help us.  She just scoffed and told us our table wasn't in her section and then continued to stand there. Oh well.  The security guys are normally nicer when you have table service.  They introduce themselves and check in on you if you have table service.  The last time I was there we were outside near the fountains and the bouncer kept coming around asking if we wanted the heating lamps turned on and if we were doing okay.  That was much appreciated.\n\nOverall, I wouldn't recommend going to Hyde unless you have table service.  It's too small and awkward inside to stand around while people are trying to dance since there's no real dance floor.  I really do still love the view and really only like Hyde because of it.", "useful": 5, "funny": 1, "cool": 2}, {"review_id": "NC1_93nFePZuhAraOiZCsQ", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 4.0, "date": "2013-02-19", "text": "The Wicked Spoon is by far my favorite hotel/casino buffet.\n\nI'm a sucker for miniature small things in their own little packages.  The little pots, pans, and plates are just adorable! Beyond the food presentation and aesthetics though, the food is high quality for a buffet and actually quite tasty. \n\nThe location of the buffet is kind of odd though, but the whole Cosmopolitan is kind of odd.  I just remember it took a lot of walking to get to, but it was definitely worth it.  We went around 6-7PM on a weeknight and the wait wasn't long at all, probably less than 5 minutes.\n\nWe opted for the wine special that night to compliment our dinner.  The selection was adequate for a buffet; I mean, it's a buffet.  Our plates were cleared promptly and the service was attentive and cordial.  Oh, and they had bone marrow. YUM.\n\nI would definitely go back and whenever out-of-towners ask which buffet to go to, I always recommend Wicked Spoon.  Everyone has their own favorite, but this buffet is mine.\n\nDate night seal of approval!", "useful": 0, "funny": 1, "cool": 2}, {"review_id": "UUm0lUWHJagHlPxye8dwzw", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "wgxQ7rnkLHcjITD3j6B_OA", "stars": 3.0, "date": "2013-06-07", "text": "Not the best Mongolian grill I've been to, but definitely one of the best in the valley since we have limited options.\n\nI like that they have recipe ideas posted on the wall to help you out if you have no idea where to start. They have a good sized selection with a few odd items (like pepperoni and italian sausage). I like that they have a few sauce selections and offer recipes for mixing the sauces as well. The staff are friendly and offer help whether it's your first time there or not. \n\nAlthough the bowls seem pretty small, I'm always full after one serving with noodles and rice. The food is pretty good, but it always seems a bit dry which I try to compensate by adding more sauce, but that in turn makes it more salty. The food's pretty good and it's a fun experience.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "UzWr_QHJ8zMu9C9M3lRmxg", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "hCfp6jF1yisOfwYO-88e_g", "stars": 5.0, "date": "2013-03-27", "text": "I stopped by on a whim since I really wanted to try gel nail polish for the first time.  I didn't realize it was 6:55pm and the place closed at 7pm.  Lucky for me, Hannah was willing to take me since all I wanted was a mani and my nails were au natural. I'm so thankful she made accommodations because I'm now in love with my nails and this place!\n\nThe salon went under new management around mid October 2012 and was renovated.  The massage chairs look brand new and the entire place is beautifully decorated.  Normally, I don't like talking to the staff when I get my nails done, but Hannah was so nice and charming I didn't mind it one bit and it wasn't awkward at all.\n\nShe used to work for high end salons in strip hotels and the quality definitely translates.  She took high end salon procedures and customer service and made them affordable.  I could tell she took pride in her work when she meticulously worked on my nails to ensure each of them were perfect - and I am thrilled with the end result.  She made me sanitize my hands right away (never been asked to do that in a nail salon before but it totally makes sense) and talked about how she emphasizes cleanliness in her salon to prevent Staph infections.  The inner health care professional in me was ecstatic.  Also, since I had never had gel nails before, she took the time to show me how to remove them at home.  She also stressed she asks all her staff to speak English around the clients, which I think is a huge plus for customer service.\n\nThe salon itself is beautiful, my nails turned out wonderful, the service was phenomenal, and the prices are super competitive with other local nail salons.  Hannah trains the staff herself so I believe you'd get the same level of care even if she wasn't there.  I highly recommend this place and will definitely be back!", "useful": 7, "funny": 2, "cool": 2}, {"review_id": "aGBtR0_S-ewaw8iR4I8Dfw", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "7sGcBZwkD4yFLiBLS1WKgA", "stars": 4.0, "date": "2014-02-03", "text": "I heart Presto Cafe.  The menu is wonderful and the sides are super delicious as well. \n\nMy favorite is the turkey sandwich, it's so addicting. Three words: cranberry walnut bread. Sooo good. This sandwich has a perfect blend of savory, sweet, salty, crunchy, and fatty. It's seriously so good. I like pairing this with a side, usually the strawberry, arugula, apple, blue cheese, with sherry vinaigrette cause I love me some bleu cheese. I also like the ham and cheese please because c'mon, who doesn't want funyuns in their sandwich?\n\nI've had the juices before. They're good, but nothing exciting. \n\nI've been here many a times and will keep going back. The lack of a 5th star is due to the pricing. I feel like for a sandwich and 1 scoop, it's pretty pricey. They should have like, a 1/2 sandwich (cause a whole sandwich is pretty filling) and 1 scoop combo for ~$8. The bf and I have eaten here before and have spent well over $30 for just lunch alone. Also, the last two times I was here the music was out of control loud. C'mon guys, this isn't Club Presto. But I'm definitely a fan.", "useful": 5, "funny": 1, "cool": 1}, {"review_id": "92EnCXBC5b1RQCFDkRAqhA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "rq5dgoksPHkJwJNQKlGQ7w", "stars": 4.0, "date": "2013-02-27", "text": "This place is so quaint and cute; I love the atmosphere.  That said, it is always super busy here.  Whenever I've gone, there's always been a line and finding somewhere private to sit can be difficult.  The food has always looked so delicious behind the glass case, but their food is a tad pricey.  I've always considered their food a \"look but don't touch\" kind of deal.  Maybe one day I'll justify paying ~$9 for a tiny little quiche.  For now, I'll stick to their coffee and tea as a splurge.\n\nI love the presentation at Sambalatte.  The teas come in their own little presses, there are signature drawings in the foam of your latte, their food is beautifully presented, and the coffee shop itself is comfortably adorned.\n\nThe nutella latte is rich and creamy, but make sure to stir up your latte.  Nutella, as most know, is really thick and can tend to gather at the bottom of your cup.  If your latte is missing that hazelnutty sweetness, try stirring it up!  The teas are also wonderfully brewed and taste clean and crisp.  Whenever I order a latte or tea, I never need to add anything extra because they're tastefully delicious on their own.\n\nOverall, although it's a tad pricey and has recently become very busy with people from a diverse age group, I still enjoy coming here each and every time.  You pay for what you get, and the drinks are really of a high quality.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "_WhOUpz27-agLtXF57Q5wg", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "7vHvQCjPq5pWj7Rio1A--w", "stars": 5.0, "date": "2013-10-31", "text": "Easily the best AYCE I've been to in Vegas so far, and that title comes at the price of many nights of mediocre cuisine and frustration. \n\nThe nigiri is exceptionally fresh and tasty. The sushi rice is well vinegared, tasty, and the rice to fish ratio is superb. I was a huge fan of the super white tuna, which was just fresh and clean in taste, and the unagi, which was this delicious sear on the outside so it had a yummy crunch to it. \n\nThe rolls were exceptional as well. I love that they do half rolls of almost everything. Descriptions are very accurate, and again, the rice to fish ratio is excellent. The rolls aren't rice heavy and each one was tasty. \n\nThe baked mussels were delish and came in a cute little dish that had a spot for each mussel (minor detail, but I loved the dish). And the ahi poke was on point. Also, all our servers spoke English and were able to tell us what each item was accurately, unlike some places I've been to. \n\nI can't wait to go back! This is definitely a place I'll recommend to friends without hesitation.", "useful": 1, "funny": 0, "cool": 2}, {"review_id": "vXU6a2Omr3Ja7MrBk4zDkA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "MyTsAeShB9pcWP84GSTAdw", "stars": 5.0, "date": "2014-02-03", "text": "So. Good. Seriously. So good.\n\nThis new location is dangerously close to my bf's house and it has become a staple in our diet. I mean, where else can we get delicious fusion food we both enjoy that fills us both up for $15? It's ridiculous.\n\nMy favorites are the chicken fusion tostada and the fusion pork belly tacos. That crunch they develop on the rice tostada is just delicious and provides a much needed textural component to that dish. And the pork belly tacos are just yummy goodness. I mean, it's pork belly.\n\nMy only complaint is my breath seriously smells like onion for a whole day after eating here cause of the asian slaw. Good thing the bf and I both eat here so we both have onion breath!\n\nBut this location is much more convenient for me than the other, and it's significantly larger with more seating area as well. I have been and will continue to be a Komex fan.", "useful": 3, "funny": 2, "cool": 1}, {"review_id": "SAQ91D9iZDU0w80DAUFY0A", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "bQ_wtZvMb__OhprY5bF9aQ", "stars": 5.0, "date": "2013-02-19", "text": "The Crab Corner is a great find.  The staff are super friendly and helpful and the food is really good. They also serve beer and have tons of specials; all you have to do is ask what's the special that day.  They're also a great place to watch games.  The owners are from Maryland so the whole place is decked out in MD gear.\n\nWhen I went here, I had eaten crabs before but never whole crabs and I never had to de-shell one before.  Our waiter was nice enough to dedicate some time to showing me how it was done, what parts were what, and all that jazz.  \n\nThe boardwalk fries are delicious.  The same seasoning also goes on the crab if you ask and by itself the seasoning is tasty.\n\nThe tables are covered with brown paper if you order the crabs so you can be as messy as you want.  Don't forget to use lemons on your hand when you're done eating though so your hands don't smell all day!\n\nThis is a great place to go with friends, family, or date night.  I just wouldn't recommend a first date if you're going to get hands on with the crabs.  \n\nDate night seal of approval!", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "T4Dk0TQQ9H20iub1cUJuLA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "IT_4EEIbv6Ox1jBRMyE7pg", "stars": 4.0, "date": "2013-02-19", "text": "We went on a Thursday night for date night.  The atmosphere is dark and intimate with live music playing lightly in the background.  The sommelier, while very helpful and tailored choices to our price range, kind of creepped up on us and never actually introduced herself to us.  She just stood over our shoulders and asked if we needed help.  It was an odd start, but after that she was friendly.\n\nFoodwise, the crab cakes were delicious and I'd go again just to order those!  We split a 26 oz double eagle bone in ribeye.  For being a double eagle steak house, our steak was good (moist and juicy sealed with a light char) , but I've had better.  We also ordered the asparagus and lobster mac & cheese.  The sides portions are pretty big and we ended up with a lot leftover.  Although we had leftovers, we still made room for warm banana bread pudding with a healthy scoop of ice cream on top.  It was a wonderful warm/cold contrast to seal off the night.\n\nThe service was attentive and timely.  We did notice an error on our bill and pointed it out to our server.  Afterwards, the manager came over to apologize and advise us he took care of our dessert for the error.  It was definitely unexpected and confirmed their dedication to excellent customer service.\n\nWe had heard rumors of the famed James Bond wine table here, so we asked the hostesses on the way out.  They were really nice and showed us the book with the special hidden button to open up the table and let us look around.  Although you can't drink any of the wine, it's definitely a sight to see.\n\nDel Frisco's gets my date night seal of approval.", "useful": 4, "funny": 2, "cool": 1}, {"review_id": "plaXaIjkRdW0LGgW6ibjaw", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "PL_kv7YO7ZwbDAm9R_ronQ", "stars": 4.0, "date": "2013-02-19", "text": "This is great experience if you have the finances to do it.  It's definitely a unique and memorable experience, but there are a lot of factors that go into making the experience wonderful.\n\nWe went on the Wind Dancer Air and Landing tour.  Our pilot, my date and I, and two other couples packed into a helicopter and took off over Las Vegas, Hoover Dam, and the Grand Canyon.  \nOnly two people can sit up front with the pilot at a time, the other two sit in back.  Make sure you sit in front for the FIRST half of the trip.  We got to sit up front and see the best view for the longest duration.  The other two couples switched off during the second half of the trip, so they only got to sit up front for 1/4 of the ride.\nEveryone wears a headset and you can hear what EVERYONE in the helicopter says. So just be aware of this.  This could be quite bothersome if you have Chatty Cathys on the ride who keep talking the entire time.\n  \nOur pilot was awesome and narrated the entire trip but also threw in his own personal remarks and sense of humor.  I can only imagine if we had a terrible pilot how horribly the trip could have gone.  We definitely got lucky in that aspect because out pilot was wonderful!\n\nWe landed in the Grand Canyon, had a glass of champagne and \"snacks\" which ended up being sticky buns and pastries of the sort.  No thanks.\n\nOn the way back, we stopped to fuel (this is when the other two couples exchanged who sat up front).\n\nWe were allowed to take pictures the entire time.  They record the entire flight and audio and you can buy the footage afterwards if you want.\n\nOn the way back, we fly down the strip, which is a wonderful experience.\n\nAll in all, it was a really incredible experience.  Like I said, it really depends on your pilot and the other people on the ride how the experience goes, but it's definitely not something you get to do on a daily basis!", "useful": 5, "funny": 0, "cool": 1}, {"review_id": "z5xFaXAUsnii5oCGyG1CTQ", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "mEhW0TYZi1xor_Xp15Fc2w", "stars": 1.0, "date": "2013-03-04", "text": "I'll keep this short.\n\nThe loco moco was absolutely disgusting (and I LOVE loco moco).  The hamburger had obviously been frozen in its lifetime, the gravy was flavorless, and even my sunny side up egg didn't taste good (how do you mess that up?).\n\nI also ordered a spam musubi (again, I LOVE spam musubi), and that again was really lacking in flavor.\n\nThe only thing I actually ended up eating was the side macaroni salad.  I tossed everything else after a couple bites. :( That goes to say how sad my meal was.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "EbwnruJvHY0oE6h5nWjN5A", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "osu1j_Lg8R9brpuMMn3a3A", "stars": 4.0, "date": "2013-02-22", "text": "My mouth is watering thinking about this place (I shouldn't write reviews when I'm hungry). 15 different sorts of meat, unlimited salad bar, yummy warm cheesy bread, and authentic Brazilian caipirinha = yum. \n\nI came here for date night and had a great time. Our server was really friendly and explained how the the steakhouse worked as far as meats and the salad bar. Each of the meat servers is actually a gaucho chef. I think our server said there were 18 of them. That means each of the gentlemen bringing you meat and carving it for you is actually the person preparing it as well. That was impressive and nice to know. \n\nAs far as the food, some of the meats were hit or miss for me.  The sausage was just meh, the bottom sirloin was a bit salty, but the picanha, alcatra, and parmesan crusted pork loin were so delicious.  Most of the meats were juicy but had a perfect fire roasted char on the outside. YUM.\n\nI know they have several areas they can convert to private rooms for functions or larger groups.  I talked to the service manager and he let me know there's no fee to rent a room and they can even split everyone's check individually in a party.  I'm definitely thinking about doing my graduation party here with my family and friends!", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "oYUQmFmOtk4N3Lsdd5FS3A", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "sDT7CvVLsPG1JizVddhxzg", "stars": 3.0, "date": "2013-02-19", "text": "This is a good place to find Vietnamese food if you live around the area and don't want to drive down to Chinatown.  I always order the grilled short ribs since I can't make them that well.  That's my go to dish and they've always been delicious and perfectly charred.  I've also had the banh mi there.  It's okay, nothing outstanding.  The service as well is just okay.  This place all in all is just okay.  Like I said, it's a good alternative when you're in the area and don't want to make the drive to more options in Chinatown.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "4jhkh5ooW_I_JeqKuNtU7A", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "RESDUcs7fIiihp38-d6_6g", "stars": 3.0, "date": "2013-02-18", "text": "Honestly, it was OK.\n\nI wanted to like it, I really did.  Bacchanal is extremely hyped up and some of my friends even raved about it - I just couldn't get into it too much.  It's also one of the more pricey hotel/casino buffets.  A friend and I went around 7-8PM on a weeknight, and thankfully the line wasn't more than 15 minutes.\n\nThe selection felt like a normal buffet selection: seafood station, carving station, asian station with ramen & pho, pasta, cheese & charcuterie bar, etc. etc.  They did have a neat little area where they were making honey.  That contraption was cool looking.  \n\nThe only things I remember really sticking out were the taco station and dessert.  There were 3 different types of tacos available and a cook making them to order.  They were delicious and I actually broke unspoken buffet code and went back for seconds. :p For dessert, they have a crepe station where you can douse your crepe in toppings and drizzles galore.  I ended up with nutella with a side of crepe and fresh fruit. :) \n\nAll in all, it was a pretty forgettable experience and definitely overrated.  I'd much rather spend the money at Wicked Spoon.", "useful": 1, "funny": 1, "cool": 2}, {"review_id": "svbXnivxYFCYUeHUOBmDkQ", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "yNUQ_B_xz_HGcWXQYMRZwg", "stars": 3.0, "date": "2013-02-25", "text": "Every time I've been here, the staff has been extremely helpful and always willing to help me with sizing and explaining different brands & materials.  \n\nThey have a pretty sizable selection; however, I find they are always limited on sizes.  I'm a petite S or M, and I have a difficult time finding my size in the scrubs I like. Usually, the sizes they have on the racks are the only sizes available.  The staff is always willing to order the correct size for me, but I'm an instant gratification kind of gal.\n\nAlso, they are a bit pricey.  I've found the exact same scrubs online for more competitive pricing, but like I said, I don't like waiting so I'd just rather pay a bit more for the item right away then wait for online shopping. :p  I also like that they offer a discount depending on the hospital you work for or if you're a student.  That's definitely helpful!\n\nThe real reason I keep coming back to Scrubs & Beyond is the staff.  I've always had exceptional customer service here, and that's enough for my patronage.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "ovHmt-_1UFohcVsRBGkUNQ", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "hYX0z2C6Th5XmcrKOP31fQ", "stars": 5.0, "date": "2013-03-10", "text": "Lushes unite!\n\nI had a GREAT happy hour experience here with a girlfriend on a Friday afternoon.  I ordered the whiskey of the month, Collingwood, a maple wood Canadian whiskey.  I got to sample some first and it was exceptionally smooth with a minimal nose burning alcohol scent common to many whiskeys. I was a fan! \n\nFoodwise, we ordered the chickpea hummus and the BBQ pork sliders.  The hummus was delicious and had a perfect consistency.  The BBQ pork sliders were so good!  The buns were soft but toasted on the inside.  The pork was moist, juicy, and very flavorful.  There was a wonderful apricot sauce and the chipotle slaw had a lovely tame flavor to it as well. All the flavors worked together really well. Both dishes were excellent for bar food.\n\nThe bar is sized well and the entire lounge had an adequate amount of tables and bar seats.  They also have a few large tables available to support bigger groups.  They also have outdoor seating available.  Double Helix offers a comfortably warm ambiance.  There are only two single stalls bathrooms though, so I found myself waiting for the restroom a couple times.\n\nThey use Rockbot, an app that lets patrons select music in the bar.  They had an awesome playlist that night with Florence, Imagine Dragons, and some of my other favs.\n\nOur server was Kelly and she provided wonderful service.  Our water glasses were always full and we had drink orders in before our drinks were empty. \n\nAll in all, great happy hour and great price.  For 3 glasses of whiskey, 1 glass of pinot noir, and the BBQ pork sliders, I paid $32.  Not bad at all.  I'll definitely go back with some girlfriends or go here on date night.", "useful": 4, "funny": 1, "cool": 2}, {"review_id": "s5YI6K6gv4GTEpiXvoD-lA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "UPIYuRaZvknINOd1w8kqRQ", "stars": 4.0, "date": "2013-02-19", "text": "Oooooh Monta. Why does your restaurant have to be the size of my closet and your service atrocious so I have to give you 4 stars instead of 5?  I really like their ramen.  I repeat, I REALLY like their ramen.  But man, everything else is annoying. \n\nI came here with a group of 5 once (all newcomers so I was trying to show off the place).  Luckily, we showed up right when they opened so we got seated right away.  We were all squished on a table that clearly should have supported only 4 full grown adults.  But the ramen is so tender, the broth so hearty and flavorful, and the boiled egg and yolk so delicious.\n\nOn another occasion, I came here for dinner with 1 other person and ended up waiting about 1.5 hours because the place is so darn busy and there aren't enough seats.  I kid you not.  Several times we thought about leaving but couldn't come up with an alternative ramen joint that was remotely as good.  It's absolute cruelty.\n\nAlso, they don't seat you unless your entire party is there.  And I wouldn't recommend going with a party bigger than 4 or it's almost impossible to find somewhere to sit.  While their ramen is super delicious, they really need to move to a bigger location and give their staff some customer service classes.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "zEzn83Kij7W6avf2pECLQg", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "Em0MDcxhSYZm7JVpR6WyJA", "stars": 3.0, "date": "2013-03-04", "text": "Went to Bonnie Spring with some friends after a hike at Red Rock on a Saturday afternoon.  Here were some notables from our trip:\n\n-Parking - It's absolutely confusing and horrendous on a busy day. There are like 2-3 gravel lots with no designated spots and narrow one way driving paths.  We gave up and made up our own parking spot by the fence and just prayed we wouldn't get towed.\n-Bar/Restaurant outside - SUPER busy.  We opted to sit at the bar hoping to get faster service since there was a line building for the tables with no host/hostess in sight.  Wrong choice.  The bartender was also selling horse-riding tickets and we ended up waiting over 20 minutes drinkless and foodless.\n*However, when we did get service, the Bloody Marys were awesome!!  Spicy and unsuspectingly strong.  The sampler platter was yummy too, just enough food for 3 semi-hungry girls after a hike.\n-Old Nevada - It was cute inside.  It smelled like manure, but what did I really expect? Great for kids and photo ops!\n-Petting Zoo - It was a lot of fun, even for 3 grown adults.  I don't know why, but I loved the mini-horses.  The kids seemed to have a lot of fun.  I like that some of the animals were out and about walking around with us while others were in cages.\n\nOverall, it was a fun experience.  I'm glad I did it once.  I could see families and tourists coming out here and having a good time.  Definitely worth doing at least once.", "useful": 4, "funny": 1, "cool": 1}, {"review_id": "Gc0rCcjjG80Pt5VFmSeU-g", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "RBAcL6hg2yoaTRv0kKUjPA", "stars": 5.0, "date": "2013-05-09", "text": "Super good and super fresh poke.  I like getting a 1/2 lb of the spicy combo poke (mayo, avocado, and other delicious goodness), a 1/2 lb of the poke w/shoyu (regular poke w/soy sauce dressing), and a 1/2 lb of their seaweed salad and I'm all set!\n\nThe poke here is absolutely delicious and I will keep going back for each poke craving I get.  The staff are really friendly, they let you sample the stuff before you buy it, and the poke just really speaks for itself and delivers.", "useful": 7, "funny": 2, "cool": 2}, {"review_id": "8N5k1bQ28ZgAw0N7VKwOGw", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "3X7dy9FD3fQ8fQ-WBBzDMw", "stars": 4.0, "date": "2013-02-18", "text": "A friend and I came here after a UNLV basketball game since we didn't want to fight traffic going home. Best. Idea. Ever.\n\nThe two bartenders were super friendly and attentive although the bar was pretty busy.  Their tap selection seemed pretty unremarkable, but they had Chimay and some of my favorites so I couldn't really complain.\n\nWhen we asked about the Whiskey Attic, my girlfriend and I were offered a private tour of both the Whiskey Attic and beer cellar. It was awesome and really informative.  I asked for the bartender's recommendation and he poured me a 1/2 glass of bourbon.  It was absolutely delicious, but in my trappist beer induced state I couldn't remember what he had poured. :(  \n\nThe beer cellar, while freezing, was equally as impressive and the tour was just as interesting.  They had some Wesvleteren XII (beer aficionados will know what I'm talking about) and if I had the $50 per bottle they were asking for, I would've ordered one.  Good thing I already had the Wesvleteren XII when it came out in December!\n\nI'd definitely go again. And again. And again. I had a great time.\n\nI only gave it 4 stars because the food was just meh.  We had the sad sad nachos. I wouldn't recommend ordering any food while here.  I know it's a bar, but still, the food was sub par even for bar food.", "useful": 1, "funny": 0, "cool": 2}, {"review_id": "Xk0h6XFTcyfzETStPxHypw", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "i3mZIwNi1EiJ7-1A8amoyw", "stars": 4.0, "date": "2013-02-28", "text": "I found this place because of Yelp, and I'm so happy to be yelping about it.\n\nI was at the hospital and literally yelped \"healthy food\" and searched the surrounding area and settled on this place due to high reviews.  It was easy enough to find; it's in the same plaza as Trader Joes.\n\nThere was only one person working in the front, but I did show up 30 minutes before closing time.  I ordered the lamb gyro.  She was nice enough to ask if it was okay to include all the ingredients, because that reminded me to ask for no onions.  I also ordered a chicken gyro, but unfortunately they were all out of chicken.  I asked for a recommendation, and she started explaining the falafel sandwich.  I was sold.\n\nI took both to go.  It took about 5 mins for my food, just enough time to run to Trader Joe's and buy a bottle of wine.  Both items came out to ~$16.\n\nI had the falafel sandwich.  It was really delicious, clean, and surprising light.  I wasn't ridiculously full afterwards.  I did feel like ALL the ingredients were really strong though.  The falafel were falafelly spiced by themselves, the hummus was very strong, and even the dressed greens were super strong in flavor alone.  All together, everything created a party in my mouth, and my mouth was happy.  I would highly recommend a strong mint afterwards though if you're eating in the restaurant (especially if you come here on date night).\n\nI can't wait to go back and try more items off their menu.  Despite their strong flavors, the food was really delicious, light, flavorful, and really reasonably priced.", "useful": 4, "funny": 0, "cool": 1}, {"review_id": "nxZ64PYPgUsP7JCqTcSWZg", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "p8HvhJZ-_EHhmUVmZN15gg", "stars": 4.0, "date": "2014-02-03", "text": "I was seriously overwhelmed when I walked into this place. For some reason, I thought it was a sit down restaurant. Nope. It's like Panera meets Chipotle for soups, salads, and sandwiches.\n\nA friend and I both got the combo thingy, full sandwich and 1/2 soup or salad. There were tons of options, so it's easy to find something everyone likes. I ended up with the HBC (honey bacon club) sandwich and summer chicken salad. The HBC was smaller than I thought but actually filling. It was a panini and came out super fast, warm, and was melty & cheesy. The salad was also yummy, refreshing, and a larger portion than I thought. It was hard finishing both items, but I got them down without feeling like I hated my life. \n\nI did notice there were tons of people behind the counter. Like, TONS. There was a person to hand my food to the other person to hand the food to the cashier. I have no idea if it's because the place is so new and everyone is in training, but I thought it was a bit overwhelming. There was a also a \"touch screen & recharge\" station in the restaurant for you to charge your electronic devices and such. Not sure if that fit in with the whole image of the restaurant, but I can see how it's functional for busy business people who want a quick lunch.\n\nAll in all, it was overwhelming but I'd go back. There were tons of choices, tons of people working, but tons of seating and the tables turned around quickly. Notably thought, there are only 2 bathroom stalls in the women's restroom. But $10 for a decent sized and tasty lunch isn't bad. I would definitely go back.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "Fm4AMJcQW2ecjG6UGGfOpQ", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "xObQl57iTZrg8-hfMkMF6g", "stars": 4.0, "date": "2013-04-07", "text": "Hiked this yesterday with two girlfriends and a german shepard.  As everyone's already stated, it's 2.5 miles (but it really does feel longer than that), the paper guide they give you says it's difficult (but it says moderate online), and it does require some rock scrambling.  The turnoff is around mile 8 on the scenic loop.\n\nThrough the canyon, there are parts where you're literally just walking on rocks.  Make sure to wear sturdy shoes and as always, bring water.  You cross open desert before hitting the canyon.  You do get some shade on this trail once you hit the canyon.\n\nThere were a couple parts in the trail we had to lift up our dog or take alternative routes around instead of going straight through, but the hike was doable with a dog.  We saw other large and small dogs on the trail as well as young children.  It is one of the more difficult hikes at Red Rock due to the scrambling aspect, but it's fun.\n\nSince it's April now, there was just a trickle of water at the end of the hike (see the picture I posted).  If you can make it up to the very top, there's a little pool of water that's pretty as well. I can imagine it being gorgeous if you hike it during the time of year when there's an actual waterfall at the end.\n\nOverall, it's a pretty good workout since you're on uneven terrain most of the time with a pretty destination at the end (or more like mid-way point since you have to go back).  The hike took us about 2 hours.", "useful": 2, "funny": 0, "cool": 1}, {"review_id": "i6Ayh07svbdrDVbO4Y54LQ", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "wLCFUsUWF3hhGKdHA3BqaA", "stars": 4.0, "date": "2013-02-23", "text": "I've been here before to pick up weekly rations.  Today, I went in to buy some pinot noir and was pleasantly surprised to find a free wine tasting that takes place at this location Thurs-Sat from 12-6PM.  The lady behind the counter, Kiki, was super friendly and I honestly felt like I was a bar enjoying a (free) cocktail or three.  This is where I found Crabbies, a delicious ginger beer I had previously at a beer fest, so I was super happy to rediscover this little gem!\n\nI also ended up getting some pinot noir.  As I wandered around aimlessly, one staff member was kind enough to notice I was a bit lost and offered assistance and a recommendation for wine based on my preferences and price range.  \n\nI gave this location 4 stars because they have a wide selection and the service is consistently friendly and helpful, but I've found more competitive pricing on the same items at Total Wine & Spirits.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "kHOU6qUmNR7DxMv2LeWycQ", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "zdE82PiD6wquvjYLyhOJNA", "stars": 5.0, "date": "2013-04-12", "text": "Two words: So. Good.\n\nKoMex was recommended to me by both a Korean friend and a Mexican friend, so I knew this place had to be legit.  I called to place an order for pick-up for dinner for the bf and I.  The staff member I talked to was really friendly and helped me when I told her I had never been there before and wasn't sure about portions and what not.  I settled on the bulgogi burrito, chicken tostada, and pork belly taco since it was a special that week.\n\nThe chicken tostada was AMAZING.  It was so good.  I love that the tostada is actually made out of rice and it has this deliciously crunchy sear on the outside of the rice patty.  I'm definitely hooked on that.  The pork belly taco was super tasty too.  I had a bite of the bf's burrito; it was huge and delicious.\n\nJust a note, the hot sauce they give you is legit. That stuff was super spicy, so I'd use it sparingly!\n\nThe food was amazing and I'll definitely make the drive to go back.  My car did smell like onions/garlic/food the whole next day and I did notice the same fragrance inside the small restaurant and it lingered on me even though I was inside for only 5 minutes to pick up the food, but that was about the only negative I could think of.  Amazing dinner for two people for $13? I'm sold.", "useful": 3, "funny": 0, "cool": 1}, {"review_id": "TTRE4jt9NqIf5kufSrmK9A", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "gJd1jOcl5FdqY020Q19n6Q", "stars": 4.0, "date": "2013-04-26", "text": "All these 1-2 star reviews make me sad. I really liked this place.\n\nCame here for a celebratory lunch with my girls after our last day of nursing school around 1PM on a Tuesday afternoon.  The maitre d' outside pointed us in the proper direction for parking as you can park either on the street, in a parking garage, or in the open lot across the street.  He was super friendly and quite hilarious. Definitely the most informal maitre d' I've ever met, but still great.\n\nThere were a few other lunch parties but the restaurant wasn't busy.  We opted to sit outside as it was gorgeous out.  The restaurant is quaintly decorated and you definitely know you're in the Arts District.  The bathroom is shared with the Art Factory, but I don't mind since you get a glimpse of some of the artwork along the way.\n\nI ordered the pig pork cow burger and house fries.  The burger was massive and had a kobe waygu patty, chorizo and pancetta. I was in meat heaven.  Everything on the burger was absolutely delicious and even the burger patty was perfectly seasoned.  I love that the fries come out with ketchup and mayo, so you don't even have to ask!\n\nI also got the iced tea which is a berry blend they brew fresh everyday and serve in a huge honking cup.  Another thing I thought was cute was that the water glasses were the bottom 1/2 of wine bottles; I loved it!\n\nService was unremarkable but timely.  The manager checked in on us a few times to make sure we were doing okay, which was greatly appreciated.\n\nOverall, I'll be back. Maybe next time for dinner or to try out the bar!", "useful": 3, "funny": 0, "cool": 2}, {"review_id": "JMAR0QrnPveGE2BNUqqeJg", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "KPV_FVNWkgmYh1ArVlt6kg", "stars": 3.0, "date": "2013-02-18", "text": "First and foremost, I only go to Lagasse's when my friends and I have a luxury box.  The luxury box by itself is awesome.  There is an outside patio area with outdoor seating and TVs so you never miss a second of the game.  Although there's only a short wall that separates you from the people walking on the strip, having an outdoor area is refreshing and the view of TI offers a nice change of scenery.\n\nInside the luxury box, there are multiple big screen TVs (which you can set to different channels so you never miss a game), several couches, a private bathroom, an old-school Ms. Pac-Man arcade game you can play for free, and a pool table.  The room is spacious and appropriately adorned in sports memorabilia.  The room we always get can easily accommodate 30 people.\n\nThe environment sets it self up to be a trendy spot to watch games.  The food however, falls flat.  I know it's just bar food, but when you have a big name like Emeril behind it, you imagine some kind of revolutionized, re-imagined, delicious interpretation of bar food.  The food is just average.  They do have a cheesy beer & giant pretzel that is all sorts of buttery fatty goodness.  But that's about it.  And I was told the dough for the pretzel is imported from Germany.  I have yet to actually confirm that.\n\nAn interesting tid bit is that one of their chefs, Chef Scott, competed on the Food Network's Chopped and won.  So that's pretty awesome.  I got the opportunity to meet him and he was very friendly and approachable.\n\nOverall, I wouldn't go to Lagasse's unless my friends and I had a luxury box and we were watching a special game.  I wouldn't order food there again either unless I was really hungry or really drunk.  I go to Lagasse's for the environment, company, and experience.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "Z8JckjXJo1DlA8oXw5Mjew", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "_kdpjoGrIzA64E6aXHA66w", "stars": 3.0, "date": "2013-02-19", "text": "I like Barcelona.  I think it was a nice addition to the Southern Highlands plaza.  I've been here several times: date nights, birthday parties, etc. etc.\n\nAs far as food goes, the food is very comparable to Fireflys; however, I think the sangria is just a touch better.  I prefer both the white and red sangria at Barcelona over Firefly's.  I recommend coming here during happy hour (4p-6p & 10p-12a) so you can get more food and drinks for less!  Just keep in mind that not all their tapas and drinks are discounted though.  But who doesn't like happy hour?\n\nThe pan fried dates are a MUST.  Seriously, you can never go wrong with these.  The paella (entree) is also really good.  It does take about 30-45 minutes to make though, so just be aware of that before you order it.\n\nThey used to have a printable coupon on their website that was awesome, but alas, it's not available anymore. :( \n\nIf you haven't tried tapas before or you're looking for an alternative to Firefly, I would recommend going to Barcelona.  It's good, not great, but good.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "IeLANpxJlnL79lOKp5V6vw", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "6zry3kyGHiplbQ4rdqxbaQ", "stars": 4.0, "date": "2013-11-01", "text": "Ok. So it's about time for this update. \n\nI finally made it to the top of turtlehead about a month after my initial review and have since been up there several times. \n\nIt really is a strenuous hike, but the view up top and rewarding feeling of accomplishment that comes along with it is addicting and keeps me coming back for more. \n\nI've decided there is no \"right\" way to hike to the top, there are just hard and harder ways to get up there. Being a person who likes maps and rules and designated walkways, it's hard for me, but I make it. I still believe the path could be better marked. I think there are only like, all of maybe 3 trail makers the entire time. \n\nFirst time I made it to the top, there was a mini American flag and container with the notepad you can sign and couple other goodies. Over the summer and a few months later, the flag is gone but the container was still there last time I went up. \n\nThis hike is not for the timid or faint of heart. Wear sunscreen and pack tons of water. And know it really will take up a few hours of your day. But it's worth it when you get to the too! Just remember to save energy for the way down though!", "useful": 2, "funny": 1, "cool": 1}, {"review_id": "E3R43yAp_eXyj3IxsaM4_g", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "ubz4CaZXagQuGv2N9gFAdw", "stars": 2.0, "date": "2013-02-19", "text": "Really? I was not impressed.  I came here with industry friends as part of the Botero Supper Club before heading out to XS.\n\nThe restaurant decor is trendy and fashionable.  I was optimistic about the food, but it just did not deliver.  This may be because we were ordering off the Supper Club menu, but it just wan't very good.  We dined tapas style with french fries and homemade ketchup, pork belly sliders, kobe beef sliders, and other forgettable dishes.  None of the dishes were bad, but then again none of them were really good either.\n\nI wouldn't do it again.  It was a comped dinner and I still wouldn't do it again.  I can't speak for a full dinning experience here, but the Botero Supper Club is a sad experience and I would discourage someone from doing it.", "useful": 2, "funny": 0, "cool": 1}, {"review_id": "ziq9efMnuk1oLZuM0cRzOA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "yN-RPaFZfUPtAVxoWtYuNg", "stars": 3.0, "date": "2013-04-07", "text": "Sausagefest made another appearance on the UNLV campus last week.\n\nThe menu had some promising choices; I had a hard time deciding what to order.  I settled on the longanisa banh mi and ranch fries. My two girlfriends got the longanisa banh mi (she broke my rule of ordering the same thing in a party!) with chorizo fries and baja chicken with fresh cut fries.\n\nThere were two registers open which helped speed along the checkout process. One sandwich and fries set me back $7; so I can't complain too much.  The food came out super quick too.\n\nThe ranch fries were super salty, and they were just okay. They were just fries tossed in hidden valley ranch powder. My friend's chorizo fries were good though. Maybe it was the slew of goodness smothering the fries (chorizo, cheese, jalapeños, etc.) but I wished I had ordered those instead.\n\nThe sandwich itself was just okay. I didn't think it was that spicy honestly.  The longanisa was overpoweringly fatty and I felt the sandwich was a tad one note.  It was missing the spicy jalapeno kick and salt from the pickled vegetables.  Although I could see garlic chili paste on the sandwich, I couldn't really taste it - and my heat tolerance isn't even that high.\n\nOverall, it was okay. I would probably try something else off the menu if I ran into the truck again, but I wouldn't go out of my way to find them.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "aO98uMwH9oi8nS7_ZMbs2g", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "IcRLhuxPHnyxW8bJ2llueQ", "stars": 4.0, "date": "2013-04-26", "text": "Came in on the way to school and grabbed 3 dozen donuts for my classmates.  The gentleman behind the counter was really friendly and stuffed the boxes to the brim with a wonderful mix of donuts.  He explained the different kinds they had, all of which sounded absolutely delicious!  I noticed he was putting a few more than 12 in each box, to which he replied that he likes to throw in a few extra when people are ordering by the dozen.  Hey, the more donuts the merrier!\n\nI had the apple pie doughnut.  It was a huge brown doughnut stuffed with yummy apple pie filling sprinkled with brown sugar and cinnamon.  It was surprisingly light and not overly sweet.  I didn't make it to try any of the other donuts as this one was super filling.  I received good feedback from my classmates about the other types of donuts.  If I was around the area and craving donuts, I'd go back to Al's to get my fix.", "useful": 2, "funny": 0, "cool": 1}, {"review_id": "7mzGklGbCesFFUyAcmDz5w", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "UV2Jt8slktGu14gLZeNCjA", "stars": 5.0, "date": "2013-03-21", "text": "Mint is my favorite Indian restaurant in the Valley.  I love coming here not only because it's near UNLV, but because it's really good.  You can't beat $10.99+tax for a delicious lunch buffet with 10% off if you're a UNLV student.  It just doesn't happen.\n\nTheir butter naan is so yummy; I have to remember not to fill up on that so I can fit more delicious food in me.  My OCDness likes that they organize their buffet trays from starters to sides to entrees.  They used to have a dessert warmer at the very end, but I think they nixed this because not enough people were utilizing it during the lunch hours.\n\nMy favorites are (and I will definitely butcher the correct names of these items): the yellow Indian fried rice with vegetables, fried vegetables, the noodles with vegetables, chicken tikka masala (I know that one!), goat curry, and spicy chili chicken.  I'm pretty sure I've tried everything there, but these are my go to dishes.\n\nThe 5 stars comes from food and price alone.  They really do have delicious high quality food.  The service is consistently mediocre if not subpar, but if I'm at Mint it's for the food.  Also, it takes awhile for drinks to come out, especially if you order coffee.  I don't know if it's a cultural thing, but I've almost always received my coffee at the end of my meal. I would prefer it as an accompaniment to my meal.  And getting your bill can take awhile too sometimes.  If I have to leave, I just go up to the counter and pay.\n\nAnd fair warning, you will leave the restaurant full and with a lingering fragrance on your clothing and hair for the rest of the day. You were warned!", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "TqgzRZW5dquRL0M9PAqq4g", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "UCpUOtvqR-NBWBNVMzJleA", "stars": 3.0, "date": "2013-03-16", "text": "Blue Martini has a hard to beat happy hour. 50% off drinks and up to 50% off food everyday from 4-8PM? Yes please!\n\nUnfortunately, all their food is just OK.  No one ever says, \"I'm going to Blue Martini for a great meal.\"  Um, no.  It's always, \"Let's go to Blue Martini for Happy Hour!\" Yes.\n\nI really like that they have so many martinis and that they have skinny girl martini options.  My inner skinny girl (she's in here somewhere) is pleased at whatever prospect is available of cutting calories.\n\nAs far as live music goes, it's OK.  Nothing spectacular.  I've seen a couple cover bands there and they're just OK.\n\nThe crowd at Blue Martini is kind of a odd one though.  Anyone who's been there knows what I mean.  It's a great spot for people watching though, if that's what you're into.  Normally, I just go here with a couple girlfriends for happy hour then make our way onto our next destination.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "CkQAe0eVJnhq3-RQd_To7Q", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "SAIrNOB4PtDA4gziNCucwg", "stars": 5.0, "date": "2013-06-07", "text": "The only place where happy hour = 1/2 off cuts of steak!\n\nCame here for date night with the bf on a Thursday around 6pm. While it was 100 degrees and sunny outside, the restaurant was incredibly dark and had a very old-fashioned Las Vegas saloon vibe. \n\nThe menu was quite expansive with the majority of it consisting of drinks. They offer authentic classic cocktails that are worth the trip to the restaurant alone. These bad boys set you back $10 each, but they are worth it. I had the Remember the Main (it was a strong drink since it had Absinthe in it) and a Lion's Tail. These drinks were absolutely delectable and I just wish they were included in the happy hour. I'd be visiting this bar much more often then!\n\nThe bf and I split the special that night, a 24 oz porterhouse steak with one side (we picked button mushrooms) for $29. At that price, it was a no brainer. This steak was arguable one of the best steaks I've ever had. It had a gorgeous charred sear on the outside but was deliciously moist and flavorful on the inside. They have options to add on blue cheese or a dry spice rub, but we wanted to enjoy the steak in all it's natural glory. It was absolutely delicious. Both sides we had, button mushrooms and the garlic mash, were great and completed the meal.\n\nFor dessert, we split their homemade donuts. I'm not much of a dessert person, but these were incredible. You get both the soft and fluffy donuts and donut holes along with a dark chocolate and white chocolate dipping sauce. These were soooo good. \n\nBoth their food and drinks were exceptional and I will definitely be back. Date night seal of approval!", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "KsyCue0VYT-mGqZ_Uv3GjQ", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "x_eIYAOPCSM1BKvID2Vcbg", "stars": 4.0, "date": "2013-03-21", "text": "How do I live so close to the M and not come here more often?!\n\nA girlfriend and I stopped since we needed dinner and a study break.  The place is literally on the casino floor with no barriers between you and the slot machines.  The sports bar is also nearby so you can hear lots of cheering (or booing, depending on the game and people) if there's an exciting game on.\n\nMy girlfriend ordered the chicken tenders and fries.  I got the beef brisket sandwich ($8.99?), fountain drink (makes me wish the M still offered free soda), and fruit tart ($4.99, say what?!).  My bill was $16 and some change.\n\nNote, napkins are only available at the counter where you pick up your food, although plastic ware and stuff is located near the self-serve stuff.\n\nOur food came out pretty quickly, just enough time for the two of us to devour the delicious and beautiful fruit tart.  My sandwich was huge, I could only eat 1/2 of it.  The beef was moist and tender and covered in just enough BBQ sauce.  This wouldn't be a good togo or take home dish though because the moisture from the meat and sauce soak the bun.  It was good, not great, but good.\nThe fries were hot and good.  I liked that they weren't overly salty so you can still salt them to taste.  \nMy girlfriend's chicken tenders were ahhhmazing.  We couldn't finish all 5 of those huge suckers.  They were so moist and had a perfect amount of breading on them.  \n\nNext time my girlfriend and I go back, I think we'll just get one order of fries and tenders to split between the two of us!  And I won't order a fountain drink.  Just not worth the extra couple bucks.  But I'll definitely be back.", "useful": 3, "funny": 0, "cool": 1}, {"review_id": "iciBvlUpKftCtzKchc1Pcw", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "ugLqbAvBdRDc-gS4hpslXw", "stars": 2.0, "date": "2013-02-18", "text": "REAL sushi lovers, let's be honest - Yama is not that good.  I know a lot of friends who think Yama is the best sushi in town, and to each his own.  But in my opinion, Yama just isn't good.\n\nThe restaurant is small.  The service is absolutely horrendous.  I never know who is my actual server or who to order anything from.  They're super strict on their AYCE rules.  And the freshness and quality of ingredients are questionable.  \n\nI love baked rolls. And I love cream cheese.  And when I order a baked roll and it comes out room temp, the cream cheese isn't even melted in, and the roll falls apart when I start picking it up with my chopsticks, I'm just sad.\n\nI've given Yama multiple chances to prove me wrong. But each time I decide to go back, they just reaffirm that they're just not that good.  No changes in service, no improvements in quality of food.  Just an overall sad experience.  It's not the absolute worst I've ever had, but it's still very sad.\n\nSave yourself the trouble and go somewhere else if you're a real sushi lover looking for quality rolls, fresh ingredients, and a great experience.", "useful": 9, "funny": 0, "cool": 1}, {"review_id": "sTZHW7uO9n37OAb9mtdwgg", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "25wTaO0_Rk-GLb4k2uMs0Q", "stars": 4.0, "date": "2013-02-19", "text": "5 course dinner with wine paring for my birthday? Umm, yes please!\n\nMy birthday dinner here was wonderful and I left wonderfully full.  The service here was excellent.  Everyone who came to our table, be it to clear a dish or place a new one, greeted us with eye contact and ensured we enjoyed ourselves.  The sommelier was very knowledgeable and took time to explain aspects about the wine to us when we were unsure.\n\nSome standouts from out from dinner were: \n-the oyster shooter, alcohol? yes. oysters? yes. together? double yes.\n-heirloom tomato panzanella, it was drenched in vinaigretty (is that a word?) deliciousness\n-seared yellow fin tuna, the fennel pollen gave it a nice earthy taste while to balance the subtle fishiness\n-John Dory, just wonderful, it had a beautiful golden sear on the outside that tastes as wonderful as it looked\n\nThey have fresh seafood flown in daily.  The John Dory is their signature fish and it didn't disappoint.  It was a wonderful, elegant, seafood experience, albeit pricey.\n\nDate night seal of approval!", "useful": 3, "funny": 0, "cool": 2}, {"review_id": "DCeHwmEYgVGIKRAaFzESZA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "WLblFINiPI18_o1OdDsnVg", "stars": 4.0, "date": "2013-02-23", "text": "This place seems like it's ALWAYS busy around lunch time and usually there isn't anywhere to sit unless you happen to catch people leaving and just grab their table and it isn't too dirty because I've never seen anyone come around and wipe tables down between customers.\n\nThe 4 stars come from food alone.  The homemade tortillas are amazeballs (and I don't even like tortillas, I'm a rice kinda girl).  The salad (basically an unwrapped burrito) is soooo good and huge.  I can barely finish 1/2 a salad.  I usually get a grilled chicken salad with everything on it.  I'd recommend getting the tortilla on the side though, because it'll get soggy at the bottom of your salad.  The green house ranch dressing thing they have is delicious as well.\n\nI also like the drink and tea selection and I like that they encourage you to mix their drinks into different combinations.\n\nService at this location is just okay, nothing outstanding.\n\nAlso, if you have a sensitive stomach and GI tract, i would be cautious.  Some people end up getting Cafe Rio stomach (which is fairly comparable to Chipotle stomach) if you know what I mean.  If you don't, then don't worry about it!", "useful": 4, "funny": 1, "cool": 0}, {"review_id": "Qy38GbwyEcTCojznwdxn6g", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "hIUKufhwR6Ifn7bi0-phLA", "stars": 5.0, "date": "2013-06-07", "text": "I heart the Baguette Cafe. As everyone's already mentioned, it's near impossible to find the first time you go, but it's so worth it once you get there.\n\nEach time I've gone, the owner Oliver has been my cashier and provided exceptional and unmatched service. His customer service, the quality of the food, and the reasonable prices are the reasons I keep going back.\n\nI've had several items on the menu, the quiche lorraine, chipotle chicken sandwich, the prosciutto, and others. Everything on the menu is delicious and made fresh to order. You can tell Oliver and his staff really take pride in using delicious and fresh ingredients.\n\nEveryone I've recommended this place to or taken here have become fans. It's a great local cafe with great food, service, and prices.", "useful": 5, "funny": 0, "cool": 2}, {"review_id": "DcKG9NRWy4sjogMVLpANYA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "dGLkAIlllr-h24f2gQhbqg", "stars": 4.0, "date": "2013-02-19", "text": "I saw Yellowcard here in November.  The Hard Rock really isn't lying when they say the venue is \"the next small thing.\"  It's perfect for up and coming bands since it's a small intimate space.  You can stand pretty much anywhere in the room and see the stage and band well. The acoustics are pretty good.  There's a bar in the back and the prices there are actually cheaper than at the casino bar.  Depending on who's playing, I would go back to the venue.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "CR_jYEinWj2X9FYIj-PeTw", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "jBhOVAEdnzCJvgSnvA4UDw", "stars": 4.0, "date": "2013-04-07", "text": "What a gem on Freemont St.  I honestly forgot where I was for awhile, and this time not because of the alcohol!\n\nThe Griffin is comfortably adorned and reminds me of some combination of a romantic cabin and English pub.  But then there's the jukebox and hipster crowd that brings it all back to Vegas.\n\nMy friends and I had no problem finding seats at the bar on a Friday night, ordering drinks, and sitting down by one of the fireplaces.  It wasn't too crowded, which I loved.  While it's very dimly lit in the bar, it creates an intimate atmosphere.\n\nThe Moscow mule, vodka & ginger ale & lime, was bomb.  The drink menu looked expansive enough, but I'll have to go back to verify that.  And I will definitely be going back.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "XaYjYDoCeUyt7kAyGMdF0Q", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "yVpZWU-pA8WECj0oR6GDdw", "stars": 4.0, "date": "2013-03-04", "text": "I love REI!  This is a great place to pick up your outdoorsy supplies (if you know what you're looking for), or to go browsing around and get help if you have no idea what you're looking for.  The staff are really friendly and usually really good at making recommendations for whatever you're looking for.  As a newbie to most things outdoorsy,  I don't feel intimidated at all going to this store since the staff are so good at helping me out.\n\nI recently became an REI member.  It's a $20 lifetime membership that pays for itself.  You get dividends back every year depending on your purchases and you get invites to special REI members only sales.\n\nI love that in addition to the big name brands (Colombia, the North Face, etc.), they have their own REI brand.  I gave REI 4 stars instead of 5 because almost everything there is so darn expensive (this is coming from a self-supported college student budget).  I know you can find similar items online for much more competitive pricing, but I really like the store and supporting this business.  They're also eco-friendly by emailing receipts instead of printing them and reducing usage of plastic/paper store bags.", "useful": 2, "funny": 0, "cool": 1}, {"review_id": "v4s-HYWgBMtmHka-VYP05Q", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "dYDuaXVyIXMXlmeMYf2ktw", "stars": 3.0, "date": "2013-06-07", "text": "Been here a couple times; overall it's okay.\n\nThe cookies tend to be hard in the cookie sandwich since they're surrounding cold ice cream. I tend to just order a scoop of ice cream now with one cookie. The ice cream is Thrifty ice cream, which is cheap and OK. I don't tend to crave Sweet Addiction, but if I'm in the area and want ice cream and cookies, I'll stop by.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "RVfI2wQeZQAsdeRyPvkLIA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "PQER4ba8Q0zqB1G2QiXamQ", "stars": 3.0, "date": "2013-02-27", "text": "Brunch date!\n\nI met up with the date buddy at 1PM on a Monday afternoon and was out the door in less than 45 minutes (partially because we were on a time crunch since he had to go to work).\n\nWhen we first walked in the door, I noticed how exceptionally busy they were.  There were unbused tables, people lining up at the cashier register to pay their bills, and no host/hostess in sight.  I was a tad confused as to what to do, so we just waited.  Eventually, a gentleman came around and greeted us, asked us to wait for a table to be cleaned up, but then proceeded to greet the party of 4 behind us (whom he was obviously familiar with) and lead them to an open table.  I was also a tad confused to this as well.  But we eventually got seated and drinks ordered.\n\nThe menu is cutely printed on a faux newspaper, and it seemed a bit huge and overwhelming.  I didn't realize they shoved breakfast, brunch, lunch, and dinner all into two pages.  It was a bit much.\n\nI ordered the eggs benedict.  The food came out super quick and was perfectly warm.  I noticed right away there were bits of bacon on my potatoes, YUM! And these were real potatoes, not frozen and reheated, but real potatoes.  That's always plus.  Then I noticed there was a GENEROUS portion of hollandaise on my eggs.  It was a tad much for me, but it was good.  My eggs were wonderfully poached and the ham was tastefully salty.\n\nLike I said, we were out the door in 45 minutes, even after waiting to be seated and the cash register debacle of taking awhile to process our debit cards when we were checking out.  I wanted to give the restaurant 4 stars because of the food, but I had such high expectations from reading other Yelp reviews and the service did not deliver.  I do believe it was in part due to being so busy and they did appear short-staffed, but I was slightly disappointed.", "useful": 3, "funny": 0, "cool": 2}, {"review_id": "zDle0cEGa--JPwD9DAM3kA", "user_id": "V93YZAMFAF4eejiIPRs0zw", "business_id": "DZbFhPkHiGFFRTVL8m7sYw", "stars": 1.0, "date": "2013-03-21", "text": "It absolutely breaks my heart to write this review.  After reading all the wonderful reviews, I really wanted dine here.  I love and support local business and was so excited.  I was absolutely disappointed with my experience here.\n\nThe restaurant itself is adorable.  It is cozy, allows a lot of natural lighting, and quaintly decorated.  I was so excited to be there.\n\nThe service was absolutely subpar.  Our server (I never got her name because she never introduced herself to us) was very impersonal.  Neither of us once got the feeling we were welcomed there or that our patronage was appreciated.  \n\nAfter reading rave reviews about the baked lobster bisque topped with a puff pastry, I was so excited to try it.  I was told there would be a 15 minute wait for it, but good things come to those who wait, right?  My friend ordered the steak pyramid.\n\nWe drank all our water and our glasses remained empty until the time we got our food.  So, for over 15 minutes we waited with no water to drink while there was only one other couple in the restaurant.  I overheard the other couple trying to order an alcoholic beverage.  The server seemed perplexed as to their own drink menu and the gentleman had to point out on the drink menu what he wanted to order.\n\nWhen our food finally arrived, I still had high hopes.  Here was an opportunity for recovery.  Unfortunately, everything fell flat.  The puff pasty is messy when you break it into the soup.  The flakes kind of fall everywhere.  This wouldn't be a problem, but the soup is served in a little bowl on a little saucer, so pastry flakes went all over the table.  Even my friend's plate seemed too small for his dish and rice (even though he ordered fries) fell on the table.  And I swear neither of us are messy eaters.  \n\nWe brought to their attention the error in my friend's order and that was remedied, but it felt like we bothered them to get the side we had ordered in the first place. \n\nThe lobster bisque was just disappointing.  When I think of lobster bisque, I think of creamy, orangey soup with thick chunks of delicious lobster in it.  This bisque was liquidy, greyish orange (there were visible oil beads separated from the rest of the base floating on the surface) with 3 small pieces of lobster in it.  I couldn't bring myself to eat the whole thing.\n\nThe steak pyramid was just okay.  There were only 3 small pieces of actual steak in the tall pyramid that we determined was primarily made of onion rings. My friend asked for it medium rare.  It was definitely medium well. It looked nothing like the other Yelp pictures. Another disappointment.\n\nWe were both obviously done dinning for awhile and sat in sheer disappointment as we waited over 10 minutes for our bill.  I still have no idea what our server was doing because as I stated, there were only 2 couples in the restaurant.\n\nAs a small business, it is imperative to be proactive in customer satisfaction. I know the owners actually read these reviews as I see recovery responses to the negative reviews on here.  But if your employees actually paid attention to your customers while they were at the restaurant, it would never get to this point.\n\nThe service absolutely needs refinement.  I am not expecting to be catered to, but I expect to be treated with respect and as though I am appreciated as a customer.  Never once did our server \"talk\" to us or even ask how we were doing.  And the food was not very good either.  I am so disappointed, I will not be back and would never recommend anyone to dine here.", "useful": 5, "funny": 1, "cool": 1}, {"review_id": "gWnbt5hUQo_FTHP2Z7G1vA", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "CLSRz9E-HmQRDwV2_smoDA", "stars": 4.0, "date": "2016-06-25", "text": "I ordered the filet and scallops.  My girlfriend ordered the shrimp and chicken.  We split an appetizer of jalapeno yellowtail.  I had a Yuengling and she had a glass of red wine.\n\nThe jalapeno yellowtail was good.  I was hoping for a little more jalapeno.  4/5\n\nThe filet and scallops were both cooked perfectly.  The filet was around 5-6oz and was a great cut of beef.  It came from the kitchen trimmed perfectly.  5/5\n\nThe chicken and shrimp were average.  Both the chicken and the shrimp were slightly overcooked.  3/5\n\nThe portions are *amazingly* large.  Everyone at our station took a box of food home.  Each dinner entree comes with a few shrimp, fried rice, fried noodles and vegetables.  I recommend this location and we will be visiting again in the future.  Our total bill was around $75+ tip.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "-SBSgjBqVX6yOXS8cpCPfA", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "C6jKwYmzHztO7OCex9j-YQ", "stars": 2.0, "date": "2017-05-08", "text": "The pizza is cheap and bland.  I am pretty sure they use pre-made crust despite their advertising of dough made fresh daily.  Maybe it is made fresh daily at some factory, then frozen, then sent to Mia Pizza?  Their wings came with hot sauce drizzled on one side of the wings.  It was weird to eat a fried piece of chicken, then get some hot sauce, then a piece of fried chicken.  Also, they said they came with blue cheese.  They did not...they came with the same watered down ranch that came with the bland pizza.  I honestly wonder why I order from these places that pop up on Grubhub...90% of them are horrendous.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "DMpmF0LBura5TZ7wyAUO2A", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "hODnmsq1kK6eA0VLbFQOVw", "stars": 2.0, "date": "2015-11-25", "text": "I was very unimpressed with this place.  I went here around 2005-6 if I recall and it was much better.\n\nWe got Calamari Fritti and Crispy Shrimp Napoli.  The calamari was over-cooked, chewy and flavorless.  We only ate 50% of the calamari because it was nasty.  1/5 stars.  The shrimp were probably the best tasting thing we had during the entire dinner.  5/5\n\nI had grilled mahi-mahi and my girlfriend had the spicy scallop pasta.  Her dish was 4/5 stars and mine was around 2/5.  The fish was over-cooked and bland despite an advertised lemon butter sauce.  The vegetables were also bland and seemed as if olive oil was poured over them.  Add a glass of wine and 1 Yuengling and the tab was $75.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "Dh_p67idR-VCzNt-_GWwBA", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "bCa0CY4F74N5lCEVOquKkg", "stars": 2.0, "date": "2016-12-06", "text": "I ordered the Kimchi, Pork Ramen and Dumplings. The ramen was good but not worth $15. The Kimchi was disgusting and I had to throw it out. There was WAY too much vinegar...I guess that passes for Kimchi in Pittsburgh. The dumplings were good but reminded me too much of the frozen kind that you buy at Restaurant Depot in the Strip District. If they were homemade, they somehow figured out how to clone the frozen ones that taste nasty. Total bill was around $40 delivered....NOT worth it. Will not order from this place again.", "useful": 2, "funny": 1, "cool": 1}, {"review_id": "GUx0_JBy49yhkgUo0FioBQ", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "qZrxUBythgmmPMvikloWgg", "stars": 5.0, "date": "2016-03-18", "text": "I called Matt Mertz Plumbing because a newly installed (Jan 2016) natural gas vent-free heater's pilot would not light.  It worked for 2 months and then the tenant turned it off.  No worky afterwards...  The original installation was performed by my neighbor \"contractor\" for $200 cash and $70 in parts that I paid for from Home Depot.  He will not admit it but he botched the installation, none of it met code, and now the heater stopped working.  He tried to troubleshoot it and said it was tenant/landlord error at first.  When he couldn't get it lit again he said \"that's what warranties are for\"......so I called The Mertz.\n\nThis is the first time I ever used them.  Called on Thursday 3/16, appointment on Friday 3/18 between 12-4.  They disclosed $100/hr labor rate and first hour is $100 even if it takes 15 minutes to fix.  Whatever, I need a real professional to fix this hack job...so who you gonna call?\n\nI got a call from the tech around 10AM indicating that the he might be able to come earlier if I was going to be around.  I was around so he showed up at 11AM.  We discussed the issue and he hit the ground running and inspected the heater.  He disassembled it with ninja-like dexterity in literally 54 seconds and confirmed minutes later that the heater itself was not the point of failure.  Gas is coming in, pilot is not clogged, knobs work, piezo electric ignitor is snapping etc.  We proceeded to the basement to see what else could be borking the heater.  I already knew...it was the FAIL installation from the neighbor \"contractor\".\n\nHe IMMEDIATELY identified multiple issues with the installation and had good ideas on why the pilot wasn't working.  He retreated to his van and put together an estimate.  He came back ~30 minutes later with a bill for $90 for the initial troubleshooting call and an estimate of $195 to fix the craptastic installation my neighbor \"contractor\" did.  I pulled the trigger on the work and said let's do it now.  He came back in one hour with everything he needed to make sure I didn't blow up in a few weeks from the original shoddy work of the neighbor \"contractor\".\n\nI'm guessing he was down there for 1.5 hours total for all this.  He squared off all the iron pipe connections, leveled the iron pipe so it didn't look like it was installed by a drunk, installed a regulator, fixed the useless debris trap that the neighbor \"contractor\" installed (didn't meet code), removed the flex appliance tube that went from the basement to the first floor (didn't meet code), installed iron pipe through the floor, installed a valve under the heater unit (to meet code), secured the hanging pipe (to meet code), hooked up the flex pipe to the heater and then checked for leaks.  Wouldn't you know it....the damn heater fired right up on the first try.  Amazing.  Glad I didn't listen to the neighbor \"contractor\" and send it back because a new heater would still not have worked.\n\nI guess everything in life is a learning experience and wisdom is gained only after successful application of prior learning experience results.  I learned that things like this should be done by the professionals the first time.  Trying to save a buck by getting your neighbor to do it will end in failure 99% of the time and quite possibly endanger yourself and others.\n\nI also inquired about how much this would have cost if I got them to do the original install.  He said \"about $350\".  If you subtract the $70 in parts that I bought for the neighbor \"contractor\" to install it, their labor rate would have been $280.  Neighbor \"contractor\" wanted $560 for labor but I gave him $200 cash since it took him 2.5 hours to install.  That's $80/hr for un-certified handyman to perform an unsafe heater install that doesn't meet code and will cost me even more when I try to sell this place.  If I paid him $560 it would have been $224/hr. for an unskilled \"contractor\" to almost kill you and your tenant.  Two lessons learned.  #1 is that neighbor \"contractor\" is an underhanded scoundrel.  #2 is that you should call the professionals if you might be killed by a heater.\n\nThe HVAC tech that fixed everything was all of the following:\n\n1 - Punctual\n2 - Professional\n3 - Clean (he wore little booty covers when on carpet)\n4 - Not full of BS\n5 - Detail-oriented\n6 - Empathic (which is hard when he knows you're shelling out more money to fix somebody else's jacked up installation)\n7 - EXPERIENCED (27 years as HVAC tech).\n\nIn closing, Matt Mertz Plumbing thoroughly impressed me today and they will get my future business.  I should have called them in the first place...I recommend you do the same the first time around and avoid being incinerated at the hands of an uneducated, unskilled neighbor \"contractor\" ripoff artist.", "useful": 5, "funny": 1, "cool": 0}, {"review_id": "_e4gn2ooSlSHIFwirR7kWQ", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "ZARPISrzPW6PrMSwexHnxw", "stars": 4.0, "date": "2017-02-19", "text": "My fiancee had a Burnt Almond Torte $9 and I had the Choco Taco shake $9.  Both of them were great but neither of us finished them because they were just too much sugar.  She ordered the Crab Shack $12.50 with Deviled Egg Potato Salad $3.  The sandwich was delicious she said but the chips were over-cooked and the potato salad was not what she anticipated.  She was hoping for a traditional deviled egg type of potato salad.  I had a dry aged wagyu burger $16 with applewood smoked bacon, truffle aioli, and horseradish cheddar with a side of fries.  I can easily say it was one of the best burgers I have had in a long time.  The flavor combination was great.  We will definitely be going back.  Total bill was $53.50.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "dDdgBSySoVrj20adjDwiPQ", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "STCQj928qKb8Sj1TTLuwQA", "stars": 3.0, "date": "2017-04-01", "text": "We always go up to the bar area.  Decent drinks and responsive staff.  Their nachos are great for bar food and a very large portion.  It's usually a mid 20-30's crowd and great for sports.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "jJ1qfe9QwwVBDIY1agVQiA", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "tPyKZPLJ-Wrm4CrEJbxFuA", "stars": 5.0, "date": "2015-11-09", "text": "Dibella's has quite possibly the best subs in the area.  When you walk in their ordering is streamlined.  Their staff asks direct questions and gives you a number for your order and shuffles you along.  My cheesesteak was the best cheesesteak I have had in a long time.  Their bread is soft and fresh and the entire sandwich was awesome.  I highly recommend this place and will definitely be going back.  I live about 20 minutes away but it's worth the drive.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "cgTFYHJHMrIah6zFO2rjBA", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "5OV1bavavdsYyfeBRNiOeA", "stars": 2.0, "date": "2017-04-05", "text": "This is quite possibly the worst food I have ever received from a place that delivers.  I read the other reviews and maybe the difference is that you actually have to go there.  I detailed everything we ordered so that you don't make the same mistakes that we did.\n\n7 Items \n1 Mac n' Cheese  $14.00\n1 Shrimp Scampi  $17.00\n1 Apple and Bleu Flatbread  $10.00\n2 Meatball  $2.50\n1 Bruschetta  $7.00\n1 Baklava Cheesecake  $5.00\n1 Mocha Pie  $6.00\n\nMac n' Cheese - This was surprisingly the best thing that we ordered disregarding the desserts.  It was greasy and not much cheese but we could stomach it.  Definitely NOT worth $14 for the portion or the quality.  3/5 stars\n\nShrimp Scampi - This was without a doubt the worst item we ordered.  The pasta appeared to be reheated and gooey.  It was stuck together in one large clump that we could not separate.  We had to use a knife and fork to \"slice\" it apart.  It was bland and disgusting.  I think there were (6) 16 count tail on shrimp with no seasoning.  They were cooked (Thank the baby Jesus that they got that right) but there was hardly any butter/garlic sauce to be found.  Also NOT worth $17.  1/5 stars\n\nApple and Bleu Flatbread - My fiancee wanted to try this and said it was OK.  The apples were raw and didn't go well with the rest but unlike the rest of our order it was fairly edible.  3/5 stars\n\nMeatballs - We got two of these to split.  They were dried out balls of meat that seemed to be reheated.  I ate an entire one and regretted it immediately afterwards.  The fiancee threw hers out because it was also nasty.  1/5 stars\n\nBruschetta - This was tasty but the driver must have rolled his car down a hill on the way here.  The bruschetta was tossed in with the bread so everything was jumbled and mixed together.  I'm sure this would be better in person without Evil Knieval delivering it.  3/5 stars\n\nBaklava Cheesecake - Fiancee said this was tasty.  Not the best she had but also nothing like the other menu items.  We are guessing the desserts are made somewhere else or come frozen. 4/5 stars\n\nMocha Pie - I had a few bites of this and it was OK.  3/5 stars\n\nMy total bill was $80 for this horrible food.  It is NOT worth the money and our meals ran straight through both of us.  The good news about this place is that it will clean you out if constipated.  I cannot recommend based on this experience.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "pO3RS-KslFTv_7VNWOgIBw", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "S8urdN6ACnRQUm-7o9An8w", "stars": 4.0, "date": "2017-02-19", "text": "We ate here for a belated Valentine's Day dinner.  The view is by far one of the best (if not the best!) in the city.  The food was delicious but I hoped for more flavor in a few of the dishes.  From the bar staff to the coat check everyone was professional and courteous.  Our waitress was knowledgeable and had great personality.  Every question we had concerning the menu and her personal recommendations on certain items were answered without hesitation.\n\nWe were a little early so we had two dirty Ketel One martinis at the bar.  They were perfectly made with the correct ratio of olive juice.\n\nFor appetizers my fiancee had the chilled oysters.  They came with pear migonette and horseradish and she said they were delicious.  I did not try them.  I had the Heron Point Crab Toast.  It was reasonably sized and full of flavor.  I recommend it.\n\nFor a main course she had the Hokkaido Scallops.  She said they were great but as a man I would have wanted a larger portion.  She said the noodles under the 4 scallops were just average.  I had the filet with gorgonzola, buttered green beans and carrots with truffle potato gratin.  The filet was cooked and seasoned perfectly.  I would have liked the gorgonzola melted slightly more but it was still great.  The vegetables were also a delicious side with the butter they used.  The potato gratin however was lacking.  There was very little truffle or raclette flavor.  This was a disappointment since I was looking forward to this dish.\n\nFor dessert she had the PBC.  She said it was a perfect dessert (for a peanut butter lover) and the presentation was outstanding.  Overall it was a great dining experience with better than average cuisine.  The atmosphere and view make up for the minor items I mentioned above.  We will definitely be going back.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "rwwxh8tnYEgesDfy7ZTg5w", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "e7M2GgkCfDYTxdPN1LL1sQ", "stars": 5.0, "date": "2016-06-25", "text": "They have the best tasting Chinese in the area.  After 5 delivery orders everything has been delicious and consistent.  I highly recommend this restaurant if you live in the area.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "BAETh6iWB0Lnik5_04JIyw", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "jnxt9D-rkZ3j2Qg4Afux3w", "stars": 2.0, "date": "2016-07-11", "text": "Greasy, bland and lacking flavor.  I have ordered some dishes here that tasted awful while others were your typical food at a dive pizza place.  Think frozen then deep-fried, canned sauce with no spices, frozen pierogies from Restaurant Depot swimming in fake butter sauce etc.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "Ru7ocL-fFlZB8DK__z4Xsg", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "U3_446QN2gdF87stGCfu1Q", "stars": 2.0, "date": "2016-07-11", "text": "It is poor quality in my opinion but the fact that they deliver gets a bonus star.  Unlike some other places their salmon roll is a legit piece of salmon, not the pureed tar tar that some other places try to give you.  I do not recommend the shumai or the calamari.  The shumai was bland and reminds me of something frozen that was bought at Restaurant Depot dahntahn.  The calamari was completely over-cooked, chewy, and one piece was burnt to a crisp and inedible.\n\nThis place was a hibachi/sushi joint in the past and the name changed.  I am assuming the same people are running it (right into the ground, again) and I give them a few more months before they close down and re-launch with a fancy new sign.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "y3VFO4rGNcQL_Qutjpwdig", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "ZYof0WYlilJ3pgWNSgmYKQ", "stars": 4.0, "date": "2014-10-18", "text": "This is the only place in Pittsburgh that does a TACO PIZZA correctly in my opinion.  I think the large is $20 but it is worth it.  I wish I had a food scale because I estimate it around 2lbs.  The one reviewer mentioned that they use too much cheese?!  This is precisely why I love Pizza Milano!  They don't rip you off on the most expensive ingredient of the pizza.\n\nAnother reason why I love this place is because they are open late throughout the week.  Did you ever have some friends over after the bar and wonder if there is any place that will deliver after midnight?  Here is your answer.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "PSwvvQiz5Jb6JebViQYlRA", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "rQXzCp-vsVpsPWFZX6Ua9w", "stars": 5.0, "date": "2016-07-11", "text": "GO ALREADY!  This place is awesome.  It reminds me of a pioneer house that you would tour on a sixth grade field trip...but with awesome cider.  I took my girlfriend here on a whim because we wanted to try something new.  It was a pleasant surprise.  We tried a few different types of cider and both settled in on something different.  I had two blueberry based glasses and she had two of the peach.  The glasses are small and not cheap but worth every penny.  We can't wait to go back and get a growler for after the drive home.  I don't recommend more than two glasses of this stuff if you're driving since they are all very strong.  On that note I should mention that we had absolutely no overbearing alcohol taste either either cider we tried.\n\nI would LOVE to see this place with a small menu of things paired with the different types of ciders.  I think they only had a cheese plate the last time we went.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "cKBY8Y33LlvKJL50umHhgw", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "Zp2vJfHciG9IiXfmtH5Wdw", "stars": 1.0, "date": "2016-12-07", "text": "This was the worst pizza I have tried to eat in a while.  I ordered the Buffalo Kafta Pizza.  First, if it was prepared correctly, it would still be disgusting.  They take what I assume is Frank's Red Hot and put it on top of bread with cheese on top of that.  I thought they would have a regular pizza with the toppings dipped in a butter/hot sauce, not the straight stuff out of the bottle.  Needless to say I could barely stomach a few bites.  THEN I noticed that the cheese was not even melted.  Please see the picture I uploaded here...you can see the raw cheese in the slice I pulled up.  Bread, hotsauce, un-melted cheese = nastiness.\n\nTo top things off they were out of mozzarella sticks so they had to call me.  They wanted to substitute instead of refund because I ordered via Grubhub so I went with the hummus.  This too was disgusting and oily.\n\nOne and done with this place, I will never order from here again.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "Y4xrx-OZvkbfk_e-zPkaHg", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "ejaUQ1hYo7Q7xCL1HdPINw", "stars": 4.0, "date": "2016-06-25", "text": "The food here is hit or miss.  I have had delicious dishes (the cheesesteak) and other not so great dishes (buffalo burger was dried out).  The beer is why I keep going back.  Their Gold and dunkel beers are the two I typically get.  If you have never been here the atmosphere and church setting are unique.  I recommend checking this place out.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "d279XlhG9WEGBSHaug-O8A", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "2jqUYcKMYZXnpxNTkORJgQ", "stars": 2.0, "date": "2016-07-20", "text": "I was not impressed with the food.  My girlfriend said the quiche was great (5/5) and the potatoes were horrible (0/5).  I ordered two scrambled eggs (5/5), sausage (2/5), wheat toast and their potatoes (0/5).  First I must say kudos to the sous-chef since I believe she made the eggs.  They were cooked *perfectly* without any scorching.  The sausage was in a flattened patty that was overcooked and hard to cut with a fork.  It was pretty nasty and I will not order it again.  The potatoes were even worse; flavorless and dried out.  I believe they make them by the pan and keep them in an oven, sometimes mixing the old pan with the new.  I say this because some were cooked correctly and others were shriveled, black and all moisture was burnt out of them.  Chef Raymond or Management needs to investigate the potato situation because they were a 0/5 in my rating system as well.\n\nOur total bill with drinks was around $25.  $25 for two breakfasts should be astounding food in my opinion.  It was not.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "53IVKpz20C8xpIZz2LS_qQ", "user_id": "FIt6aTdK_iWsxoBqGVHaFg", "business_id": "cJREFoHP-dAYmwDzfWOHbA", "stars": 5.0, "date": "2016-07-11", "text": "This is the place to go for beer and pizza.  They have a great beer selection, knowledgeable and friendly staff and awesome pizza.  They make pizza by the slice for you while you down a beer or two after work.  This is one of my favorite places for pizza if you are North of Pittsburgh.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "Oa2uZHRBY3o-BNIkPOpE7A", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "LNsZJP6jZ11e0tDljOLPiQ", "stars": 2.0, "date": "2015-07-31", "text": "For me, the environment wasn't very pleasant or inviting lol. I just felt super awkward there. It took a minute for someone to finally acknowledge me but still made me feel a little awkward. My server (don't remember her name) wasn't very friendly.  I wanted to try something different so I ordered the Eggs Benedict with a Pineapple Mimosa. The drink and the fries were okay but that's about it. Kind of just want to run out of there.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "4phaIZ8fTDLOEmErcdiKvQ", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "VQGetWNN1f0dMWQ6ehDAVg", "stars": 3.0, "date": "2015-08-12", "text": "I wanted to try out the happy hour...just get something quick.  I did a quick skim of the happy hour menu and decided on getting the Tuna Tacos (something different).  The set up was really cute lol, but at the end...the tacos were okay.  My server/bartender was nice.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "fOA04Xi77okxTuEAvbIDwA", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "Fwi9X2fyQ0zVoWAlUi4skQ", "stars": 3.0, "date": "2015-08-11", "text": "Didn't know what to expect when I walked in. Dark...very dark lol. Paragon was pretty full...especially the bar area. When I first walked in, to my right there was a little spread (buffet maybe) of something...don't really know what it was. I found a stool at the end of the bar near the kitchen area.  It looked super small and cramped in there and I couldn't imagine working in such a small space lol. Anyway, my server/bartender was meh okay, not very customer friendly towards me (on my bill it says her name was Tammy). She was pretty occupied chatting it up with one of the male guest next to me, a little \"act like I'm busy\" and occasionally looked at her watch/standing around...definitely didn't even get the \"how's your meal/drink\" to me.  **shrugs**\n\nI ordered a Pomegranate Mojito and Corned Beef Egg Rolls (something quick). As far as the eggs rolls, they offered three different types: corned beef, a pepperoni pizza one and veggie egg roll.  I thought the Corned Beef Egg Roll (with thousand island dressing) was unusual but pretty darn good, the mojito was a little strong and tasted like licorice. \n\nThe only reason why I gave three stars instead of two was the egg rolls...pretty good. My end result...one time visit.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "bGizcm3q42kkU3xC1eEnYA", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "xfCgxY_SQfzxFsQjNiLJEQ", "stars": 2.0, "date": "2015-09-06", "text": "Always heard about Mitchell's, people raving about it. Whenever I pass it by, I see lines are out the doors.  \"This must be darn good ice cream/frozen yogurt\" I keep saying to myself. Well, I finally got my opportunity to try this high demand ice cream...no lines, straight to the front. I decided to try the taster's duo...my choices? Campfire S'mores and Blue Cosmo. It was definitely a weird combination mashed together, ugh especially when it started to melt. I actually thought I was going to be wowed...kind of like when I have my Cold Stone Creamery Oreo Overload this is so amazing reaction. Nope...didn't happen for me.  I was just ice cream...ice cream that I can get at the grocery store.  Didn't quite understand what the big deal about this place.  I feel that it is extremely overhyped. \n\nPrice wise...inexpensive, which is a good thing.  I guess when it is not crowded and you are craving for some ice cream while you are out and about in Ohio City I guess you can take $4 bucks and get a frozen treat. Otherwise, I'll just stop by the store and grab some ice cream and go home.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "BRmQiaFiVSaKnKCHOgKYUA", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "N9qQPezv9swXFLPgoMdhOg", "stars": 3.0, "date": "2015-10-04", "text": "Well, it's not only just IHOP, but IHOP Steelyard lol. I ordered my food to go but the visit and interaction with some of the staff was okay. Both of the workers I dealt with were kind of new, one in particular was laying on the good customer service a little too much (sorry but it was a tad bit annoying).  He started rambling about how I reminded him of his ex-girlfriend and I think he gave me some kind of compliment (backhand maybe)...I think at one point, I heard \"goofy smile\" or something. But besides the weird interaction, food was okay. \n\nOh, lol, I forgot to mention that I ordered the Turkey Berry Melt and the same guy, wasn't really convinced that there was a such thing on the menu and thought I meant Turkey Bacon Melt. I told him no and he asked was that (the Turkey Berry Melt) really on the menu. He then said \"oh, I have to get a menu to see that\". SIGH...I'm thinking, \"dude I have the freaking menu in front of me, please just put the darn order in\". But I wasn't rude or mean, just kind of laughed it off...trying to show him my menu but for some reason he had to get his own menu to see it on there. To me, very unnecessary and I'm there longer than I should. \n\nOverall okay visit, a little annoying but decent.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "-rklVMNZ0CMnN8EoKFVc2g", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "cUAulV1C6H-eCNdgXTC_5w", "stars": 5.0, "date": "2015-09-06", "text": "A co-worker raved about this place since I told her that I was new to the Tremont area. Soooooo glad she did. I originally came to grab a cupcake for my dessert treat. Pretty quiet and super duper clean in the inside. I was surprised that they served ice cream. Saw the different flavors and the Caramel Cashew caught my eye...I'll check out the cupcakes later...I want that ice cream. You get two scoops for $3.25 so I decided to also try the Red Velvet.  Both flavors were very delicious, especially the Caramel Cashew. \n\nThe only tiny, non major thing that \"bothered\" me was the spoon, oh so tiny..lol felt super weird and silly eating with it.\n\nA Cookie and A Cupcake definitely did not disappoint and worth a return visit.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "B4QTTKdo7tP7k--Dt2C-bg", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "caYlxQ7kaYcUZwcqJKNyoA", "stars": 5.0, "date": "2015-09-06", "text": "O...M...G\n\nDon't judge a book by its cover. That's all I am going to say.\n\nI was looking for a place that wasn't going to eat up my wallet, but at the same time give me my money's worth. This place met my criteria. It's definitely not the fancy, lavish place...extremely rough around the edges. The menu is not the best or even really available, but luckily I kind of had an idea what to order by reading the reviews on Yelp before going. When I walked up to the counter, the only thing I said was \"I wanted the special with the rice and beans with a choice of meat\" she said okay and told me the different kinds of meats they had. I opted for the beef stew. Let me tell you, I got my ten bucks worth! Just watching her pile on the rice, beans and meat in the container...I'm just thinking, I don't need all that (whew). \n\nI was going to sit down and eat but it was so freaking hot inside (no air conditioner) and I felt kind of bad for the employees. So I just ended up taking it home. \n\nFinally got home and I just wanted to get a taste of it and hold off until dinner time. I just found myself standing in my kitchen, taking one bite after another. Very good...everything seasoned just right...just wow!  Very delicious...I repeat, very freaking delicious!  It will definitely last another day...that's how much they give you.\n\nHighly recommended!!!", "useful": 11, "funny": 2, "cool": 7}, {"review_id": "f6iRdGn_e986K3BrkPy_DA", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "FdbCq4kPInhZlJKEYL5P8Q", "stars": 5.0, "date": "2015-08-22", "text": "I always love shopping at Heinen's. Super excited that they have a location Downtown Cleveland. The employees there are always nice, smiley and friendly.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "MTI5I1XfqZfS79yvzjtayw", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "DcgCr11ve0QP29gKMad7OA", "stars": 3.0, "date": "2015-10-25", "text": "I was there for the 12 Hours of Horror screening and it was okay. Staff was pretty friendly but wish there was more options at the concession stand, since I was there more than 1 1/2 hours lol. I don't know if the special is something regular but for the horror screening, for $12 you can get refills on a beverage and popcorn.  After I got sick of eating a large popcorn throughout the night I decided to grab a pretzel with cheese (hot dogs didn't look to good)...a very hard pretzel with cheese lol. Overall the actual event was pretty cool...can't wait for next year.", "useful": 3, "funny": 1, "cool": 1}, {"review_id": "HN4TwV6qDiRcCAGZPCOgVQ", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "w4a6TuFWArSc29dB51rPNA", "stars": 3.0, "date": "2015-09-05", "text": "What I ordered:\n\nBeer Mussels\nLamb Meatballs\n\nSo, the only reason why I decided to check this place out was I really wanted to try Lamb Meatballs. I have no idea why, but I just wanted to taste it and I discovered that Bar Cento had it available on their menu.  My server (don't remember his name) was pretty cool. I was also looking for this pear cider but he said that it was no longer in season, he gave me a suggestion and I went for this organic apple cider. I already knew what I wanted so let's go!  I tried the Lamb Meatballs, okay...spicy and pretty good. My server walked over and stated that I should eat the mussels first because I wouldn't want to eat cold seafood. Okay, tried the mussels, by the way, first time ever eating mussels...meh, not really a fan but hey, I least I can say that I tried it.  I will say the presentation in both meals were very, very pretty...gold star!\n\nStaff seems pretty friendly, food was okay.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "WlcjQWbyyHyelm18m183FA", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "cUwNW5NEua_yMcAx-X2sMg", "stars": 4.0, "date": "2015-08-23", "text": "So Grumpy's was super busy and it was around 8 or 9ish in the morning...people wanted their breakfast lol. I decided to get mines to go, so I ordered the Breakfast Burrito with Bacon and Cajun Home Fries. To me, I thought the restaurant was a little cramped...maybe a little more space is need in the front area.  Staff acknowledged customers and had good attitudes. I sat at the counter area while I waited for my order and had a good view of the kitchen. The guys (and girl) were kind of killing it on the flat top, lol they were not playing. I was watching the one guy making a lot of omelets, kind of regretted my decision on the breakfast burrito (next visit...maybe).\n\nWhen I got the burrito, for some reason I thought the home fries were going to be inside the burrito...nope, it was on the side. It would have kind of been better if home fries were inside the burrito.  Didn't get a set up with my to go order...like napkins...ketchup, hot sauce, heck even a fork since the home fries were on the side.\n\nThere are other menu items I would like to try out and definitely need to sit down and eat at the Grumpy's.  Would like to give this another chance.", "useful": 2, "funny": 1, "cool": 0}, {"review_id": "lCgUG9tftOaEUIQdvZqL4Q", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "oxeW1tSB-e_oIzCQZtqyTw", "stars": 3.0, "date": "2015-09-12", "text": "Special note: I know I shouldn't compare it to packaged ramen noodles, but I did...so? Now what? LOL...on with my \"review\"\n\nSo, after a few years I finally decided to try Noodlecat. I walked by the restaurant and saw a guy eating ramen noodles and for some strange reason, I wanted to eat some ramen noodles too lol.  The reason why I thought it was strange and why it took so long for me to try Noodlecat was because of it being ramen noodles. I find it the meal to eat when I'm broke, there were times when I ate it so much I thought I would never in my life eat it again. Well Friday night I wanted some, along with trying out a steamed bun (or two).  \n\nI know this will come off as silly but I wasn't too happy with the bar stools at the table. I like backs to my chairs lol, somewhere I can hang my purse. I didn't realize the only area that had backs to the chairs was the bar area but it was too late because I already settled in (ugh what is wrong with me lol). On the table there is a clipboard with copies of the menu and the server was giving walking me through on how to order, which in my opinion was pretty self explanatory. Made my choices and was anxious to dig in. The service was okay, I ordered a drink but my server forgot to look at my entire menu selection (which also carryover to the back) and he really didn't check on me at all...didn't get the \"your meal will be ready in a few moments\" or something along those lines. At one point as I was looking down eating the mushy, tasteless ramen and a guy came out of nowhere and grabbed the two empty bowls and just kept walking. It did startled me a bit, looking up asking myself \"does he work here?\"\n\nAs I stated above, the ramen was very mushy and tasteless...didn't enjoy it at all.  When I am in the mood for at home ramen, I do like it to be a little bit firm. I was making myself eat the rest because I didn't want to be hungry later in the day. I also ordered two steamed buns...the pork and the fried chicken, now those were good, especially the chicken.  It does get a little messy but the sauce was yummy delicious so it was worth it. I kind of wished I should've swapped the bowl of coconut ramen for two (or three) more steamed buns. \n\nThis actually would have gotten less stars if it wasn't for the steamed buns, which would be the reason for a return visit. Other than that, no noodles for me. \n\nOh and can I say the bowls were really cute?\n\nWhat I ordered:\n*Nama Ramen, flavor Coconut Curry Tonkatsu\n*(2) Steamed Buns - Fresh Bacon and J-Fried Chicken\n*Poloma (drink)", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "s9WZ3jSSk5t4BRv8NQzctg", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "_qoXWEB5qb0Me1CCMLWlmg", "stars": 3.0, "date": "2015-07-31", "text": "The pizza was really good. Went on a Saturday...pretty quiet. The place definitely have their regulars.  I think they have happy hour all day on Sundays.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "vj0PNXYLX1ELBpvoqF0wBQ", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "B6nhGEqt6rzXw6TwltTspA", "stars": 5.0, "date": "2015-09-05", "text": "I have been dying to try this place out and I'm glad I did!  After reading some reviews, I wanted to get there a little early because I thought it was going to be packed. Nope, not packed at all...not even close. But who cares, I didn't have to wait in a long line! I don't know why it felt different to \"build your own pizza\" when you already do that at other pizza places. For some odd reason, lol, it felt different at Pizza Fire. I decided to get the Neapolitan red sauce and three toppings (free range chicken, black olives and jalapeno peppers). For all you gluten free peeps, they do have gluten free crust for an extra fee.  Staffers were okay, no complaints here.  Because it was kind of empty, I didn't get a number, just stood off to the side and when my pizza was done, the guy handed it to me. I actually like the thin pizza...crunchy, a little on the charred side but still yummy. I really love the red sauce, it wasn't sweet or can't think of the word but it was really really good. I do wish they would sell alcohol, a nice cold cider, ale, or even beer would go even better with it.\n\n\nTwo thumbs up!!!", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "u0EyR_AY1OtYCtRreXKo6Q", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "mNsjRWm99TFmssgKJX_kyg", "stars": 5.0, "date": "2015-08-07", "text": "Very awesome place!  At first I had my doubts and thought I wouldn't like anything here...boy was I wrong!  Nice atmosphere...as soon as I went to the bar area, I was greeted by my server/bartender Stephanie (who is super cool by the way). She was friendly, engaging and attentive in a non annoying way. Specials of the day aren't posted anywhere, it is verbally told to you. Decided to try one of the specials, Beef Brisket Potato Skins (not on the menu). Very tender and good, hope it goes on the menu. Also decided to try the wings, Stephanie warned me about the Honey Ghost flavor (very very hot) but when I tried it...in my opinion, not that hot at all.  Everyone was super friendly...on my way out, I ran into the manager and he introduced himself.  Very nice and approachable guy, I think he said his name was Joe (don't be mad, I am bad with names).  Would definitely come back...really want to try the mussels and frites. The only small little gripe is that I hope they expand the menu...have more choices but other than that...very relaxing and nice place to grab a bite.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "rhlbjdWpp0ZLNmqnxXT3Zg", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "X6chSU0KBGHGNxZ8UH_qag", "stars": 5.0, "date": "2015-08-09", "text": "Really liked this place. As soon as you walk through the doors, I can just feel the happy, positive vibes lol (I know, sounds silly). With this place you can make your own sushi...just look on the menu board and you can go to town and be super creative. I wasn't that bold yet so I opted to get the Ohio Roll. Everyone there was so helpful and friendly. They were giving me suggestions about different menu items which led me to try the Taro Milk Tea. I never had bubble tea so one of the staff members let me sample it...it has a very acquired taste...meh. So they suggested to get the Taro Milk Tea without bubbles.  The drink itself was very good and glad it was recommended to me. The Ohio Roll was really good, I love wasabi and kind of wished I had a little more of it lol.  I want to go back and build my own sushi and try the other milk tea flavors (the Oreo one...mmmmmm have to get that one). \n\nThis place is ah-may-zing!", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "1cmod0zSw5xR69uxyXa8hA", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "5ynzVV_kayd5hfv5Kt6Vbg", "stars": 5.0, "date": "2015-08-09", "text": "Okay so I had my reservations going there based on the reviews. Walked through the doors with the deer in headlights look....two staff members noticed and got a kick out of it (in a nice, friendly way). The female pointed me back to the bar area where a few other people hanging out. I went around 4ish today (8/8/15). I already had in mind what I wanted...The Luther!  I've heard about this and was always super curious how this burger, sandwiched between a glazed donut, would taste.  My bartender/server was Sheila...super friendly, engaging person. When the burger finally came, I was a little anxious and didn't know what to expect. Good, the Luther was actually pretty tasty. Using the glazed donut, it is definitely something different...no need to add condiments to the burger...the sweetness is enough. There are other menu items I wanted to try but I was short on time and didn't want to overstuff myself. I would definitely go back, nice convenient location.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "W0CJmdrA9BhsZSfelogeiA", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "_yKeTKNvXaBduAkRIS84Aw", "stars": 3.0, "date": "2015-09-27", "text": "Exactly as my rating, I thought it was just okay. Now I will say, the omelet I ordered was pretty good. It's funny how I automatically have to grab salt and pepper but I got a taste first and didn't even need it...seasoned perfectly!  I wanted to get a fruit smoothie and for some reason I can no longer eat bananas (don't know why, for some unknown reason I just can't eat bananas anymore-maybe an allergy or sudden intolerance) so I asked the lady if I can get one without bananas (no trace of it) and she said that the smoothies are prepackaged...basically \"no smoothie for you\" lol. \n\nThe employees are pretty much in their own thing, kind of not in the mood to be friendly and/or talk or even crack a smile.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "UbFxXEjHVdPLznxSvuXxxw", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "FutUAQPBfCeTmqytfDW1pA", "stars": 1.0, "date": "2015-09-13", "text": "Never again Chipotle, never again.\n\nNot too happy with how the stuff is presented, especially the bowls. A slop of sour cream covering the entire bowl, stale chips, hard rice...just all a big fat no. And no this is not the first time this has happened, oh no...not the first.\n\nNow that I think about it, I don't really know the appeal of Chipotle anymore.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "MIDiVhPjMwpF9tCKJVlCYA", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "hZLdSnk3cpp5R4tIxR9NzA", "stars": 5.0, "date": "2015-09-13", "text": "Another day, another visit...there were a different group of employees and they were still super nice and helpful. I finally got my hands on the Japanese Kit Kats, pretty expensive ($8) but I have it...ball out lol.  I decided to grab the Green Tea Kit Kats (really fracking good) and the Cheesecake Kit Kats...it kind of taste like the White Chocolate Kit Kats and I'm not a fan of white chocolate.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "s3yEi2111Zu6w9YlcfxBQg", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "PNMsWRyh4X1xfPil5vhywA", "stars": 4.0, "date": "2015-08-29", "text": "What I ordered: The Porkopolis, wet with crunch\n\nFor a minute I was a little confused with finding the location but it is off on the side street across from Dave's Supermarket. The restaurant is small...on the outside they have a few tables to sit and eat and when walking inside, a two (or three) person seating area to the right. I try to get things that I don't normally get and/or things that's not easily or typically available everywhere (in this case turkey, ham you know...cold cuts) ...so I decided on the Porkopolis. The interaction was meh...I was the only customer there (it was around 6ish on a weekday).  When I got my sandwich, lol I didn't expect for it to be so HUGE.  I was going to eat it outside but it started to rain a little so I ended up taking it home.  I don't live far at all from Ohio City (in the Tremont area) but when I finally made it home, I dug right in. Didn't know the crunch was potato chips lol.  The sandwich was a little soggy but the bread did not fall apart too much. It did get a little messy but worth it lol. Pork was tender and delicious, but really really good! I would definitely go back and try other things on the menu. Thumbs up from me!", "useful": 2, "funny": 0, "cool": 1}, {"review_id": "XZSC4Vce1u9d5snFeSfffQ", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "MTsIckdo3_uKuqk3B4zuKA", "stars": 3.0, "date": "2015-10-10", "text": "I've already been to the location on Detroit. Staff was a little more upbeat, actually greeting people...NICELY lol. I was anxious to try the Terminal sandwich (previously had the Westsider which was really good) and I thought it wasn't that good...the pickles I got wasn't sweet...it tasted like regular pickles. I don't know if it is different pickles for different sandwiches but I didn't too much care for not only the pickles but the Terminal sandwich. \n\nI do like the convenient location, it is right across the street from my job and they also deliver!", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "4WkMIbtowyhPJCuX0NECHw", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "VodyCVoc3QUoEsi0rv0opg", "stars": 4.0, "date": "2016-07-12", "text": "This diner is cool. When you walk in, it has a very retro vibe and the colors make the diner pop. The staff are super friendly including the owners Mike and Dee Dee. The food is really good and I feel like the pricing of it is worth it.", "useful": 4, "funny": 1, "cool": 1}, {"review_id": "XYeNRN6ILL7S00aA4HeGGg", "user_id": "GSVZm1zOINHwc7Bb7e1nJw", "business_id": "X0mNw8owxgJXrgTBR-7Yfg", "stars": 3.0, "date": "2015-11-13", "text": "Very HUGE pancakes lol. I decided to finally try this place this morning for breakfast (11/12/15), I keep hearing my co-workers talked about this establishment (why that word?). So at first as I was approaching it through the marketplace, I thought it was closed. The restaurant was dark...no lights? But besides that, people were inside...eating lol. I think there were only two people working, one in the kitchen and the other in the front. I don't know her name, actually I don't think she told me but nothing bad...super friendly. Hell even the cook was super friendly and came out from the back to strike up a natural conversation. Both were giving me suggestions on what's good and what I should order. I opted for the Lemon Curd Pancakes with Berries(sorry no picture). I wasn't too fond of the berries...super tart (or sour), to the point I made the ugly pucker face, but I liked the lemon curd cream with the pancakes (or flapjacks). Even though I only had two pancakes, they were some huge pancakes, maybe not worth $10 but whatever...indulge a little I guess. Actually I didn't even finish them, only could eat half. I was eyeing the burrito a customer was eating...maybe next time. Overall good customer service, dark environment...didn't agree with the pricing.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "W727I01U-EyTuSb2W5-idw", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "awI4hHMfa7H0Xf0-ChU5hg", "stars": 5.0, "date": "2011-01-18", "text": "You don't come off the strip to Palace Station to gamble.. You come here for Oyster Bar.  You wait ever so patiently to sit at a small bar. It is what it is!\nThe food is cooked right there in front of you. This spot is a no frills no nonsense kind of place. Don't line jump either, they will catch you.\nOur waitress was Sandra and she was a total sweetheart. \nI had a dozen oysters and the house gumbo while my friends had various versions of the pan roast. The portions are HUGE, like a large sized bowl of pho. I recommend you share an entree with someone and then order some oysters.\n\nAWESOME FOOD. AMAZING SERVICE.", "useful": 2, "funny": 0, "cool": 3}, {"review_id": "kMbCCDP0YsfpWZHr03nXEQ", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 4.0, "date": "2011-11-04", "text": "I lucked out. My girlfriend had a 2 for 1 deal. $35 for 2 people for dinner buffet? \n\nALL IN.\n\nWicked Spoon opens for dinner at 5pm so if you want to avoid the lines, hit it up early! We went at 6pm and walked in with a breeze.\n\nIf you have any vegetarians in your group, this place is do-able for both carnivorous folk and veggies alike. \n\nFood comes in smaller portions here and is presently nicely. There is not much meat. There was prime rib, some Korean short ribs, fried chicken and one other meat dish but I only had prime rib. It was decent but definitely not the best I've ever had at a buffet. If you want good prime rib at a buffet go off the strip and hit up M Resort. \nBut I digress...\n\nANYWAY\n\nThe crab legs are minuscule here! If you're a seafood lover you'll be disappointed with that. There was barely any meat so I skipped it.\nWhy is my review still at 4 stars?\n\nWell, the personalized mac & cheese station is awesome. You go down the line and pick out what you want and a cook makes your mac n cheese dish fresh for you.\nI also loved the selection of gratins! My favorite was the truffle potato gratin. Went so well with my slice of prime rib.\nAnother winner was the Louisiana BBQ Shrimp w/ cheddar bacon grits. I LOVE ME SOME BACON AND I LOVE ME SOME GRITS. Perfect sized amount served in a little individual container.\nMy girlfriend and I also loved the wild mushroom polenta. The mushrooms were cooked PERFECTLY and so amazingly good it tasted like it had truffle in it. SO SO GOOD. \nThe gnocci was excellent. The pork & lamb meatball spaghetti wasn't that great of a hit. The meatball itself was very dry but the spaghetti's marinara sauce was on point. Like I mentioned before, everything is served in its own little plating/containers so portion control is very easy to manage here. \n\nDessert station had little macarons, chocolate mousse, gelato station, dark chocolate covered strawberries w/ nuts and some sliced strawberries with REAL FRESH HANDMADE whipped cream. None of that out of a can nitrous oxide shit. That was LEGIT. \nMy gripe with the dessert station is that other than the strawberries, there wasn't any fresh fruit! COME ON! I'm Asian! I need fruit after a meal yo! Hahahahaa... \n\nLeft feeling so content but not overly full and still somehow managed to fit into my skimpy 5th Element costume. That's right, Leeloo Dallas Multipass got her grub on at a buffet before going out to Marquee to save the world", "useful": 3, "funny": 3, "cool": 1}, {"review_id": "rMS-U_x10V0pBVOy_ViM2w", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "zU9w_xRlQSRIYXxGo-HSOA", "stars": 3.0, "date": "2010-06-01", "text": "Like my friends Dennis T and Smitcha B said before... This place is just alright. It's open and it's food. \nThe problem I have with this place is that the portions are HUGE. They are meant for giants from Harry Potter. I think Hagrid would go to town on this shit. When i'm in Vegas, the liquid diet commences and I can't eat much. When i say liquid diet, i mean i'm drinking a lot of booze. I dont' mean i'm starving myself to shrivel up like a supermodel. C'mon now, I love food!\nAnyway the portions are HUGE. Even if you try to order a regular sandwich like I did, the amount of meat they give you in the sandwich is at least 4 inches thick. I honestly cannot eat THAT much pastrami. \nPeople who order the triple deckers are nuts. Has the guy from Man VS Food come here yet!?!? It's disgusting.\nAnyway.. the quality of the pastrami itself is sufficient. I ate about half the meat in my sandwich but I found myself dipping it into a lot of ketchup and deli mustard.\nI came back for breakfast because this was the only place close that wasn't a buffet. I had the 3 eggs [scrambled]w/ bacon from the breakfast menu. I think the eggs they were steroided out eggs or something because it DID NOT look like 3 eggs. It eggs took up more than half my plate and looked like at least 6 eggs. INSANE.\nThe pickles however, would be enough for Snooki from Jersey Shore to cream her panties.", "useful": 2, "funny": 0, "cool": 1}, {"review_id": "q8ILf4v5XoLutBb4IDZB7w", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "_K2_Yf_ltfhuJ2JGCOs85g", "stars": 1.0, "date": "2012-07-31", "text": "It matches the name.\n\nOf all the drunken places I ended up at WHY couldn't i have been at Secret Pizza!? Or at least Earl of Sandwich! \n\n\nthis is how it went down.\n\nwaiter: what would you like?\nme: nachos!!!\nwaiter: that ended at 11pm.\nme: NACHOS!\nwaiter: that ended at 11pm.\nme: okay, loco moco.\nwaiter: how would you like your beef cooked?\nme: medium rare.\nwaiter: we don't do medium rare. medium well?\nme: what do you mean medium well? no no, MEDIUM RARE.\nwaiter: we don't do medium rare.\nme: then why did you ask me how I wanted it f*#$&#(*cking cooked??? okay I'm sorry sir I didn't mean to cuss at you. Medium well. FINE.\n\n*texting on group chat*\n\nI'M DRUNK AND I AM SAD BECAUSE THEY ARE COOKING MY LOCO MOCO MEDIUM WELL WTF. AND I AM EMO. AND IM NOT WEARING A BRA AND IT'S COLD IN HERE AND MY NIPPLES HURT AND MY LOCO MOCO IS MEDIUM WELL!!!!!!!!!!\n\nmy friends: what the...\n\n\nYea I don't know what happened man. All I know is that it was barely edible to me.", "useful": 7, "funny": 19, "cool": 5}, {"review_id": "784U8UWawLbbGW8LpX_KJA", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "Thx8WO-qqYJmEKssu4g9SA", "stars": 3.0, "date": "2008-07-23", "text": "This place came by as a recommendation from a friend who knows Vegas fairly well.  (Thanks Joy!)\nMy betches and I were craving sushi, and we didn't want anything on the strip. After a 20 minute cab ride, we arrived here. \nThe 2 of them ordered the sashimi dinner, which was $15. It came with your standard miso soup, salad, white rice, and then A LOT OF SASHIMI.\nFor $15, it was a freaking STEAL. The two of them ate nearly every single piece. \nI stuck with an order of nigiri and a salmon skin roll, just to be safe.\nThe roll itself was pretty big and it was delicious. \n\nI mean, it's not the greatest sushi in the world but its definitely not the worst - it's decent.", "useful": 4, "funny": 3, "cool": 4}, {"review_id": "DuLw82Gak4Efq_bHnMIsYA", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "NWioeR6MmKxgYD87EL56wg", "stars": 4.0, "date": "2014-12-15", "text": "Enjoyed this spot a lot. Didn't hurt that I used a Groupon either. The only thing I don't like about Imperial is the price for services. $60 for a 30 min body scrub!? Sorry, standard everywhere is one hour, so I found that to be ridiculous.\n\nOther than that, Imperial is pretty choice, despite it in being in the 'hood of Vegas. \n\n$20 to enter and use their facility. Bring your own flip flops if you can because they often run out. \nPlease take off your shoes before you enter the locker room area! Change into your slippers or go barefoot, and YOU MUST TAKE A SHOWER BEFORE ENTERING THE FACILITIES. Come on people! It's plastered all over the walls. \n\nIn the female only area: Whirlpools ( 1 hot, 1 warm, 1 cold soak), dry sauna, steam room and herbal steam room. GET NAKED. Don't be a weirdo and wear a bikini because really, nobody is there to check you out. And all of us ladies there have seen boobies and vaginas before so don't be shy. We really don't care about yours. No really, I don't care. \nThey also provide toothbrushes, toothpaste and razors. So nice! In the locker room there is also gel, mousse, lotion, cotton swabs, tissue, hair dryers AND a curling iron. Very handy if you're going out and about afterward. There are a few reclining chairs to relax in and watch tv in the locker room, so feel free to bring a facial sheet mask to slap on when you're done. I saw quite a few ladies doing that.\n\nCommunal area had lots of rooms. Really enjoyed how spacious the communal area was. It has 2 sides of reclining chairs and tvs. \n\nFood option there was a bit pricier than all the other jjimjilbangs I've been to. I didn't bother to try any, but it smelled good. \n\nFairly clean, and I did see a woman constantly cleaning. This spot used to be open 24 hours.. I wish it still was.", "useful": 19, "funny": 10, "cool": 6}, {"review_id": "0QfUUXuV_5GeazF2OVA06w", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "iCQpiavjjPzJ5_3gPD5Ebg", "stars": 4.0, "date": "2012-06-13", "text": "I'm going solely off slice standards here. \nFast (if you're just buying by the slice, not if you're ordering a whole pie), decently priced (for Vegas standards) and pretty tasty.\n\nGo with the white slice.  I thought it was white sauce (cream) but it was actually no red sauce, cheese, ricotta. Pretty good. I liked being able to add stuff to it (additional 50 cents per topping) but I wish they had some bacon. Better than the traditional pepperoni w/ red sauce that's for sure. And yea, it's thin crust and ultra greasy. If you're going to complain about grease, don't bother eating pizza. Do the world a favor and eat a damn salad with no dressing okay? \n\nI don't get why people order an entire pie and then whine and moan that it takes up to an hour. IT'S A FREAKING ENTIRE PIZZA IT'S NOT GOING TO BE READY IN 5 MINUTES PEOPLE. USE YOUR BRAIN.", "useful": 9, "funny": 11, "cool": 7}, {"review_id": "47KGKN6W-tbp3DaTlNESeQ", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "FaHADZARwnY4yvlvpnsfGA", "stars": 2.0, "date": "2011-11-02", "text": "This airport is terrible for an international one.. They seriously need some remodeling done. It's nearly impossible to find an electrical outlet to charge your items anywhere near your gate. \nThe WiFi is spotty too...\n\nand get used to the taxi line of doom!", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "hZsSFM97louEvBZhGZ7aZA", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "GCRvrxMSC1nzShyM4Y-guQ", "stars": 3.0, "date": "2009-11-08", "text": "Hm. I didn't bust a sweat even though I shakin my tail feather workin what my mama gave me like my ass was on fire. Air conditioning? Probably.\nI can't say what this place is like on a regular night - I came on Halloween and most of my night - actually make that MORNING was spent at a table in the upstairs balcony .. YeeeeEeeEeEee!", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "9yz3aGKDaPD2H5mbEBeqQA", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "ghDNHpqETRJGxG5iUtaZtw", "stars": 3.0, "date": "2014-12-16", "text": "split the CT roll w. my friend. we added the chowder fries and drink to make a meal of it. I had iced coffee already so I let him have the drink.\n\nOur total was $25+ kind of on the pricier side, but it's LOBSTER!\n\nI wish the CT roll was a tad bit bigger. I didn't like how the lobster was minced up so small, but it was tasty. Bread was extra buttery. Chowder fries were amazing though. Whoever thought to put chowder over fries is a genius.", "useful": 4, "funny": 5, "cool": 4}, {"review_id": "6n0tNI0xcw_n9HOBV2yrGw", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "RESDUcs7fIiihp38-d6_6g", "stars": 5.0, "date": "2014-12-16", "text": "Sun, Dec 7, 8:50pm\n\ntexts w/ my boyfriend:\n\nI've decided that I'm never coming home. I'm going to live here in the seafood section of the buffet, next to the drawn butter dispenser.\n-----------------------------------------------\nWhere at?\n-----------------------------------------------\nBacchanal inside of Cesar's Palace. I've had 4 plates of crab legs babe. I'm so happy", "useful": 3, "funny": 10, "cool": 2}, {"review_id": "WMDwiBxSCOkDcvKuTjz4Xg", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "KYasaF1nov1bn7phfSgWeg", "stars": 5.0, "date": "2014-12-16", "text": "I showed up right when they opened. Woops! Sorry, I had dragon breath from stinky tofu and wanted to wash it down.\n\nSuper nice chick working inside. She was very sweet. I always order the #1, and she was NOT stingy with the pandan jelly (my favorite part) Thanks for making my vacay so enjoyable and giving me more goodies than the Bambu in SF does!", "useful": 3, "funny": 3, "cool": 2}, {"review_id": "3lbQn1nS-JCsYzu5UtnydA", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "T64FH66qs4EN0d0ds2f5fw", "stars": 1.0, "date": "2010-06-02", "text": "I came on Memorial Day Weekend. 1st of all, I understand how Vegas works. Holiday weekend = jack up the prices everywhere right? Yeah, it was $60 for males, $30 for females. I paid the same amount at Surrender (inside Encore) which was far better. It was also only $50 for males.\nHaze is TINY.  The setup was very bad, it reminded me of LAX inside the Luxor. Haze was not even worth the $30 I spent to get myself in.  I didn't drink there, I know how to pre-party so I can't say much for the pricing of drinks. The dance floor is small as well.\nHuge disappointment for a club inside Aria, *sigh* \n\nOh, while we were in line one of the bouncers gave us his business card and told us to sext message him. Reeeeeeeeeal classy. Tsk tsk tsk.\n\nNo thanks!", "useful": 2, "funny": 5, "cool": 1}, {"review_id": "38tgtGbQUg1x3MoTP_UXPA", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "t-o_Sraneime4DDhWrQRBA", "stars": 5.0, "date": "2010-07-20", "text": "Months ago I booked a deal with Encore. I had friends coming all the way from London and I knew I had to see them. The night I arrive, I get to Encore to check in and was told they were overbooked due to the Garth Brooks concert HOWEVER they were putting me in a tower suite in the Wynn instead. I had my little Beyonce moment \"talk about LEMME UPGRADE YOU\" This was perfect as my friends were all in the tower suites at the Wynn anyhow. Concierge guy at the Encore was so nice, he kept trying to find a suite on the same floor or at least same tower. He went on and on going over all the amenities, where to eat, private VIP pools, etc. \nSeriously, what great service. Housekeeping.... amazing. After 5 1/2 hours at my pool (with my friends chatting it up with a famous soccer player) I practically crawled back into my room thinking \"IS THIS THE RIGHT ROOM!?\" Housekeeping had turned the flatscreen out from the wall, left it on a screensaver with classical music, turn down service with robes, slippers, mints, and they even went as far as organizing my chaotically strewn makeup in the bathroom! YES THEY ORGANIZED MY MAKEUP FOR ME. They even so lovingly placed all my makeup brushes into a glass for me. Who does that!? \n\nWynn does it all. \n\nI can't stay anywhere else.\n\nGarth Brooks - you can have a concert whenever Miss Susy C is in the house okay? I don't care.\n\nP.S. Added bonuses for being in the tower suites: our own separate valet entrance/exit. SO HANDY. No waiting in crazy lines full of drunk people for a cab. Plus, the area where you exit .. I don't know what to call it, it's almost like an atrium? It has thee most delicious scent ever. Every time I walked through it, I had to stop, close my eyes, and let the scent just fill my nostrils.. It smelled... like Jo Malone. That's the only way I can describe it.", "useful": 4, "funny": 5, "cool": 4}, {"review_id": "YpHHkuMF4r16EATAgJ9ZtQ", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "4JNXUYY8wbaaDmk3BPzlWw", "stars": 5.0, "date": "2008-05-14", "text": "*sssssssshhhhhhhhhhhhh*\n\ni'm effing melting into my brie burger.", "useful": 1, "funny": 3, "cool": 1}, {"review_id": "XW3OjL_o4W8Jf1aVa_PY7g", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "LNGBEEelQx4zbfWnlc66cw", "stars": 5.0, "date": "2011-11-04", "text": "I have come here a handful of times now. Hands down, best buffet in Vegas. Word has spread so the prices have jumped =[\nStill, the locals and tourists alike flock here. \nTry coming early, BEFORE they open... There's already a line, trust me. The shortest I've ever waited was maybe 20 minutes but the longest was an hour.\nEach minute of torture was worth it.\nEnormous variety of food to choose from.\nThe servers are attentive here. I never have to ask for a refill, they always know to bring me more ginger ale because they actually pay attention to you!!! \nSO MANY HUGE CRAB LEGS. \nThey have sushi, sashimi, pasta, BEST FREAKIN PRIME RIB AT A BUFFET EVER, \n\noh my goodness..\nI can't gush about this place enough.\n\nMy friend is a local to Vegas and took me here. I love him so so so much for bringing Studio B into my life.\n\nThe desserts are all good too. Each time I come, I have about 6-8 desserts.\n\nyes, I am greedy.", "useful": 2, "funny": 3, "cool": 2}, {"review_id": "NwmdvvjinFQQ72GSLRxPFQ", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "m4EqSB0aI17jzMyCtdfWAA", "stars": 3.0, "date": "2010-06-01", "text": "This is the only topless pool i've ever been to. I got free passes to go but I seriously don't see why people would pay anything over $20 to get in this place.\nThe pool is SOOOOO DIRTY!!!!!!!!! I think your snatch would contract an STI if you sat in the damn thing. People are holding drinks, cigarettes, and food in the pool. GROSS!!!!!!!!! The water was SOOO CLOUDY!!!\nAlso, there's nowhere for you to put your belongings if you don't reserve a cabana. I didn't even know that chairs aren't provided if you don't reserve shit. I mean, it was my last day, I'm just chillin by the regular pool at the Mirage and someone gives me a free pass. Okay, i'll check it out. BAM! Nowhere to go.\nIt was so packed, I felt like I was on MTV Spring Break. Only a few women were topless but it didn't come off too classy given all the men that were ogling their (  .  Y  .  ) and the promiscuous photos being taken with mouths on boobs and what not. I know some people are probably thinking \"wtf are you complaining for bitch, you got in for free!\" but this is a damn honest review. \nIf you're going to pay bank for this shit, at least be classy and keep it clean. When I say clean, I don't mean keep it PG-13. I don't care about topless females booty grinding on horny guys in the pool to rap songs. I care that something that looked like a condom was floating around in the water near my foot. It got super rowdy and trashy like a ghetto low production rap video so I left. It was definitely an interesting first experience and a nice way to end my trip but I don't think I need to check this place out ever again.\nThe dj was good though!", "useful": 3, "funny": 10, "cool": 3}, {"review_id": "2B0Pczcp8GHb1BcJrKHmqw", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "Wxxvi3LZbHNIDwJ-ZimtnA", "stars": 5.0, "date": "2006-12-13", "text": "I love their hotel bathrooms. =]", "useful": 3, "funny": 1, "cool": 3}, {"review_id": "-Kz_iXQH1LKUxupGSr2M9Q", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "JFPKfg_FNxCD4mNqAAAllQ", "stars": 3.0, "date": "2012-10-16", "text": "What's up with \"no Fruity Pebbles but we have Froot Loops!\" \n\nWhen did Pinkberry stop carrying Fruity Pebbles? Honestly I wouldn't know. I'm more of a Nubi & Yogurtland gal. \n\nI don't like that this location isn't self serve but given the fact that it's on the strip, I understand. Can't be leaving the machines up to drunk hooligans to operate by their own inebriated lonesome. \nMaking it not self serve is also a drawback. You will have to wait and wait and wait on the indecisive noobs ahead of you who want to sample every freaking flavor offered to be served before you can just order your damn original tart with mochi and honey granola or whatever healthy shit it was they offer in place of Fruity Pebbles and GTFO. \n\nThe employees are all smiles but give it a few months Hahaha.", "useful": 10, "funny": 6, "cool": 5}, {"review_id": "xGb_bmvxVr0RQRN7nKYdZw", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "ewmTwsZqCHH2gvCeDKz0dw", "stars": 5.0, "date": "2014-12-16", "text": "PHONE YOUR ORDER AHEAD OF TIME!!!! The tuna poke goes FAST. I was already warned to do this, but I didn't because my schedule was very loosely planned. *shrugs*.\n\nI was still able to sample some stuff and enjoyed my order thoroughly. \\\n\nLOVE that they do tako wasabi here. The kimchi octopus is tasty as hell too. I usually get this at sushi boat places but they sell it here by the lb! In the end I wound up with tako wasabi and spicy salmon poke. SO GOOD. Wish I had some chips to eat it with..\n\nThey also sell Hurricane popcorn by the bag. Service is prompt and they've very friendly. \n\nP.S. This place is way out in the boonies.. like, the hood. If you don't have a car, don't cab it.", "useful": 9, "funny": 6, "cool": 4}, {"review_id": "edkhGJBhJ6B5OQA9Og94vQ", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "ubz4CaZXagQuGv2N9gFAdw", "stars": 4.0, "date": "2011-11-02", "text": "Loved the atmosphere of this place. You can either sit outside where XS is (I wouldn't advise this if your reservation is late and the club is starting up..) or inside where you can look towards it. \nStaff is super nice and apologetic (they dropped my butter knife on me 2x. it's all good! shit happens!).\nReally liked my food..Had the Hudson Valley Foie Gras w/ a pineapple financier. The pineapple financier was weak and forgettable but I love foie gras and it was seared beautifully. \nThe bone in rib eye w/ chimichurri was very tender and tasty..\nMy dayboat scallops were also delicious but the potato cake underneath just tasted like a tiny hash brown. \n\nStill, it's an excellent steakhouse inside of Encore. So if you're craving protein while staying at Encore, make a rezzie for Botero!", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "nO2FV4RkmPuv80npF2xgSw", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "Az_60nNuh1FH8Ds8oasZjw", "stars": 4.0, "date": "2011-11-02", "text": "Liked Encore well enough but still prefer the Wynn.\nEncore needs more tables for people to gamble at! If you're a player you have to walk over to the Wynn.\nAnother issue for me is... no 24hr dining available. Ouch. Walking far after partying all night at XS isn't fun.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "5bKclInO_oWrAK1Frqp3sg", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "MpmFFw0GE_2iRFPdsRpJbA", "stars": 5.0, "date": "2011-11-02", "text": "okay despite bouncers being shady with my homegirl's drivers license back in January, this is my all time favorite club in Las Vegas (forget Marquee, that place is terrible no matter who the dj is). \nIf you're staying at Encore, be sure to just get tickets in advance through concierge. You won't have to wait in the ridiculously long line. Encore guests w/ tickets just walk in through the re-entry line. Quick, easy, painless.\n\nThis past weekend during deadmau5 though, we couldn't leave and come back in. Bouncers told us \"it wasn't guaranteed that you'll get back in even though you're a guest here because we've reached capacity\"\nI JUST NEEDED TO USE THE BATHROOM! The line for the female restroom was fucking RIDICULOUS. and I must reiterate, FUCKING RIDICULOUS.  I waited FORTY MINUTES IN LINE TO GO PEE. \nThat is some UTI status. Why the hell do chicks take so damn long to use the restroom!?!? POP YOUR SQUAT, PULL YO PANTIES DOWN, DO YOUR BUSINESS, WIPE, WASH YOUR HANDS, BOUNCE! \nIf re-entry to the club was guaranteed, I would've left and went  back upstairs to my room, peed, had more drinks and came back in. I bet it wouldn't have taken 40 minutes like the bathroom line!\nLadies were slipping the bathroom attendant twenty dollar bills to cut the line. That is just FUCKING RIDICULOUS.\n\notherwise, I still love this place.", "useful": 4, "funny": 10, "cool": 3}, {"review_id": "wgrqs4NjcOw1ODa-_hbrQg", "user_id": "D2epirooWNjvwTI6MFhNGw", "business_id": "xkVMIk_Vqh17f48ZQ_6b0w", "stars": 1.0, "date": "2012-10-16", "text": "Under normal circumstances, I am against reviewing if you didn't dine. However, making me wait 30 minutes (with a reservation mind you) is not acceptable in my book. Telling me you're checking on my table only to never come back and disappear? Strike 2. \nUnprofessional and totally unexpected for a restaurant of four dollar signs. \n\nNo worries, I know how to play the disappearing act as well. \n\nMaybe you'll get your $$$$hit together and make it up to me one day.", "useful": 15, "funny": 11, "cool": 5}, {"review_id": "4n9y5mDjvB5sZQnaOdynZQ", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "2OFWvbHVwvnva7GxP4wHQg", "stars": 3.0, "date": "2017-01-07", "text": "Food ***\nService ***\nAmbiance *\n\nGreat spot and the wraps are good.  If you're looking for 'true' jerk, this wouldn't be the space, however the roti is good and the chicken is relatively tasty.\n\nThe owners are really nice people too!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "S1ExhNlAbsjR6dcO64VRsQ", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "bhqOSajw2x1NLQxijsDVcg", "stars": 4.0, "date": "2016-12-28", "text": "Food ***1/2\nService *****\nAmbience ****\n\nComfort food and a great menu of beers gives this spot a thumbs up in my opinion - especially in the winter.  \n\nMake sure you try the beer battered cauliflower and Memphis ribs.  Both delicious and must haves.\n\nThe servers go out of their way to make you feel welcome and are prompt and courteous throughout your stay.   Bravo!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "c1vu71s-eCboE0lw7GINCw", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "SxvKjtbq5qRlFoXrU8Bo9Q", "stars": 4.0, "date": "2016-10-29", "text": "Food ****1/2\nService ****\nAmbiance **1/2\n(Out of 5)\n\nDelicious delicious pizza!   Although the owners and any true Detroit pizza loyalist would cringe when I say this, think of it in the same family as Chicago deep-dish, only square and with a lot more crunch from baked cheese.  \n\nWe had a few different types in order of awesomeness: Good old days, Double Pepp and Truff-ghi.  I'd order any of them again however Good Old Days definitely stood out as the winner.  \n\nWe had a party of 5 guys who came with a good appetite.  We ordered 3 larges and each took a slice home.  \n\nHighly recommended pizza.  We will definitely be going back!\n\nPs.  If you go during winter don't sit near the door. They don't have a double door to prevent drafts.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "bMa-jMogUI63SfXzf-a2Rw", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "eYeFOcNJO2iTNPCPi8XAxw", "stars": 3.0, "date": "2016-12-10", "text": "Food ***\nService ****\nAmbience ***\n\n(brunch review and rating, based on the other reviews here I am going to come back for dinner!)\n\nStumbled across this restaurant when a neighbouring restaurant didn't have space for us.  Food and tastes were great however all of our meals were a little bit too oily, leaving it sitting a bit heavy in our stomach.\n\nOur server was attentive and on the ball.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "mrpitqKwrCEXQWgkYs5kxQ", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "8al-XRt5nuIize8_STWffQ", "stars": 2.0, "date": "2014-07-10", "text": "It gets 2 stars because it's just slightly better than Pizza Pizza next door.\n\nFor those who went to Vinny Massimo's... you would know the caprese pizza was one of the best slices in the city.  Period.\n\nSadly king slice doesn't live up Vinny's or any solo / small chain pizza joint in the city.  \n\nAvoid if possible... and if you're still hungry and in the area of Queen W, head to Barton's snacks, Fat Bastard Burrito or Poutinis.\n\nFood *\nService **\nAmbiance *1/2\n(out of ****)", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "uotB2UZYt3JpUpx74Ihbvw", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "2-0Z3UeQZ_Mx98m8Dv3oeQ", "stars": 4.0, "date": "2016-09-04", "text": "Food ****\nService ****\nAmbiance ****\n(Out of 5)\n\nAria is located in my office building and is the default for working lunches when time is tight or we feel like italian.  I should mention the service and food here is always top notch... So while it's a default, it's not a fall-back!  \n\nThe restaurant has very high ceilings and has floor to ceiling windows. It's beautifully designed and probably one of my favourite restaurant spaces in Toronto.  It makes it a welcoming bright space during the day for lunch.  For dinner, it's a hidden pre-Raptors/Leafs/Concert gem, beside the ACC.  \n\nThe calamari as a starter is always a go to.  My favourite meal I've had there was when the buffalo mozzarella was part of their specials... It came as a huge strip on a butcher block.   I've had the burgers, salads, pasta, steak and others here however normally stick to a salad with some protein on top and calamari to start.  \n\nDon't miss the olive oil and bread that they serve on every table. It sounds basic and simple but the olive oil is incredible and a fantastic combo with the bread.  \n\nReservations would be recommended later in the work week for lunch or for dinner on game nights.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "s-SbeO-Br_metuR8q83v_w", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "OZF7EM-W-2-V0LQOYSYhBA", "stars": 4.0, "date": "2012-06-28", "text": "I have been going for more than a decade.   I'd have to say that the quality has suffered in recent years.   It's hit or miss... not as consistent as before - especially w/the chilli chicken.  \n\nThat said, House Shrimp, House Beans & Hakka Chow Mein remain one of my favourite dishes anywhere.\n\nChilli Chicken on rice for $8 beats Mcdonalds etc. any day for a quick lunch/takeout.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "P_py4UsYLCkLRd6ofqzomw", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "PcPN_HyvtZpCZ0b_4l_45Q", "stars": 5.0, "date": "2017-01-12", "text": "It's a ****1/2 given its quality and price.  In my humble opinion it edges out the Priest in terms of gourmet chain burgers and a lot of the one off shops (Apache, P&L, Rudeboy, Slab etc.)", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "Rh02S8lWcpUAMCv_YwODBw", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "87I8ba2FKYKeXyAhiC6cLg", "stars": 3.0, "date": "2016-12-07", "text": "Food ***1/2\nService ****\nAmbiance ***\n(Out of 5)\n\nCool spot and part of the new Poke craze.  We had a tuna Rice bowl and a Tuna Salad bowl.  \n\nOverall good bowl... A little light on the fish proportions.  If in the area give then a try!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "d9uM1fvBjnxbHMXXxR17Hw", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "y769FA7VJOW4QQYdYlR62A", "stars": 4.0, "date": "2017-01-01", "text": "Food **** \nService ***1/2\nAmbiance **\n\nGreat pastas and salads.  This is a go to spot for me after a long day at work with a yearning for a comforting bowl of pasta.  \n\nAfter trying all of the pastas, my favourites are Tagliatelle or Carbonara.  \n\nThe salads are also huge, and perfect if you want to keep some left overs or to split it with someone and also share a pasta.  \n\nI had the pizza however didn't think it was very notable. It was light on toppings and sauce with a bit too much crust for my liking. \n\nThe space is a bit small so I generally prefer takeout.  The food keeps well when transported so you're still getting a proper food experience.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "H4B23O7HgvwpOSF6719MaA", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "ZumOnWbstgsIE6bJlxw0_Q", "stars": 5.0, "date": "2016-06-18", "text": "Food *****\nService *****\nAmbiance ****\n\nThis place lives up to the hype.   We started with drinks at the bar and then moved to our table.   We had caesar salads as apps steaks + sides for the main course.  The Wagyu was by far the best steak I've ever eaten.   I'm exited to go back. \n\nThe waitstaff treat you like royalty.  When you ask where the washroom is the take you there.  When you pass them in the hall/stairs, the stop and turn to the side and wait for you to pass.   They ask you for your valet ticket when you ask for the bill so your car is waiting for you.  Small details but it shows and makes a difference.  Bravo!\n\nAppetizer:\nCaesar - ***\n- Prepared tableside, this salad is a staple of the restaurant.   I thought it was great but not amazing.  I've had better before - which surprised me. \n\nMains\nA5 Wagyu *****\n- This was as delicious as everyone describes it.  Its very rich, so if you get it as a main, get a small portion.  We got a couple for the table to split.\n- It is so tender you can cut it with a spoon.   Do not get it done anything more than medium rare!\n- Make sure you get a red wine that pairs well with it...\nUSDA Ribeye Black Angus****\n- Also a delicious steak however after trying the wagyu, this top tier steak became decent.  I\n\nSides:\nMushrooms ****\nAsparagus **** \nRoasted Beefsteak Tomatoes ****\nDuck Fat French Fried Potatoes *****", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "BOpENf8fE9KHe9Jp3DqvIg", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "bNynUUb2uYtHGLSD7mS3Bw", "stars": 2.0, "date": "2016-12-28", "text": "Food *1/2\nService ****\nAmbience **\n\nReally nice people work a this restaurant but the food is pretty bad.  I've read a couple reviews that there are different cooks, and one is good while one is bad.  \n\nMy food had a strange taste to it - like the noodles had chemicals in them. I also had the chlli shrimp and the sauce tasted like straight tomato/ketchup sauce.   The crispy Beef was not crispy.\n\nI had really high hopes but this experience was underwhelming so I probably won't return.", "useful": 1, "funny": 3, "cool": 0}, {"review_id": "q30ftH4BXxEcEy6p-vjY9A", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "2HHngNRl1QxDtYRQBfG6Uw", "stars": 2.0, "date": "2012-07-11", "text": "Quality was decent.   Went there for dinner.   \n\nWe ordered a number of maki rolls and the bill was almost $30/pp - and we didn't eat much.  \n\nWasn't really a good value for money... for this price, go down the street to Aoyama and have a way better meal!", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "Zfggvn4aOHwd4A1N2Nazqg", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "leMIHa6TogufHv5HNYjnfw", "stars": 5.0, "date": "2017-02-26", "text": "Food ****1/2\nService ***1/2\nAmbiance *\n\nGreat fast casual / takeout spot.  Their wrap and soups are delicious.   They're hearty, full of delicious meats and veggies (they have veggie options)\n\nMy two top choices are the Ravi Stew which has roasted chicken in it.  I also regularly get the flank steak with hot sauce which has spinish, brie, steal, yams, mushrooms and more.   \n\nIf you were to make something at home and not scimp on the good incredients, save time and just go to Ravis!", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "-s6U2Q36DYHjpaPVOPMWRw", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "cgoHLKJLsAK1ww0_ezNFnw", "stars": 3.0, "date": "2012-08-07", "text": "I consider myself a foodie.    Ambiance is nice to have, but the make or break for me is food.\n\nWent here with some buddies and found the food to be decent but not amazing.   I ordered the Venison and a starter salad.   The meat was pretty tough compared to venison I had tried before.   I ordered it medium rare and it came out that way.    Salad was good (mixed greens w/candied pecans), however it could have been taken up a notch with some grated parm on top. \n\nMy friends ordered the lamb chops, buttermilk chicken and fois gras poutine.   I didn't try the first two, but they raved about it.    The fois gras poutine was delicious and I am not the biggest fois gras fan.\n\nService was great and free corkage a real plus!   \n\nFood **1/2\nService ****\nAtmosphere ***1/2", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "1C3xAScOHnJYdud-CGUR7g", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "Jn17OhYIWrSlXHI3bpZsLQ", "stars": 3.0, "date": "2012-08-22", "text": "If you like souvlaki, this is a great place and its open very late! They marinade the meat each morning and grill it fresh when you order it.  Its well spiced and juicy every time. \n\nI haven't tried the potatoes or salad in a while so I'll reserve judgement.  \n\nMake sure you order pork or chicken, it blows the gyros out of the water.  \n\nFood ***1/2\nService **** (no table service)\nAmbience *", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "bvCYNmMThax-aUU2reNjoQ", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "GTwQgfi8DN23D9fMURYUdw", "stars": 4.0, "date": "2012-08-07", "text": "Finally!  \n\nToronto is plagued with mediocre sushi restaurants and they keep popping up everywhere!    Former favourites have gone down hill are closed or are now all you can eat.  \n\nTried a fried 'Fire' maki roll and salmon sashimi (plain I know - but I was rushed to order.)    Quality of both items were great in quality, taste & presentation.   \n\nServers were quick, courteous and knowledgeable... and initially when my server thought I hasn't had sushi before, her approach to explaining the difference between a maki / hand roll & sashimi didn't make me feel like an idiot. \n\nThe chefs seem to be Korean and I don't think they make their own soy sauce.   For the price, it's good value.   It's slightly more expensive than the run of the mill sushi restaurant, but the quality is there and you won't be disappointed. \n\nI only wish I lived closer to the place!     I will be getting the Chirashi next time!\n\nFood **** \nService ****1/2\nAmbiance ****", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "hlsP-hJx4fne9Zadwrc0Jg", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "0a2O150ytxrDjDzXNfRWkA", "stars": 5.0, "date": "2016-10-05", "text": "Food *****\nService ****\nAmbiance ****1/2\n(Out of 5)\n\nGreat sushi.  Just an incredible experience having some delightful seafood.   The sashimi lunch was to die for... And made me very happy!\n\nService was attentive for the most part.  At one point I couldn't find my waiter, however I think this is because of the layout.   \n\nI'd happily return and also recommend to sushi lovers!!!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "T_uRER_XDyLXTH5z4g6CPw", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "d6G0w_e3GaA90NSQeovShA", "stars": 4.0, "date": "2012-08-08", "text": "Great Viet.   Highly recommend the Fresh Herbed beef spring rolls.   Pho is high quality and rivals the best spots in the city too. \n\nFood ****\nService ***\nAmbiance **", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "brAuaCPEH_mL8zOVltiFdQ", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "Yl2TN9c23ZGLUBSD9ks5Uw", "stars": 5.0, "date": "2016-12-19", "text": "Food ****1/2\nService ****\nAmbience *****\n\nWhat can I say?  After wanting to go for more than a year, we stumbled upon an open reservation on a snowy Friday night.   I'm very happy that Pai (thai restaurant up the street) was so busy!\n\nLabneh / Red Beets\nHalloumi (sp?)\nRoasted Brussel Sprouts\nSlow Braised Lamb (main dish Byblos is known for)\nMejadra Rice\n\nEverything was fantastic.   Notable things that really stood out were the lamb and the Labneh+Beets.  The lamb was perfectly braised, and when combining it with the condiments and wrap may have been one of the best things I've ever tasted!  The Labneh was also incredible.  The olive oil (i assume greek) in the middle is very smooth, and the Barbari bread is so flavourful.\n\nTip:  If you can sit upstairs, do it.  Both areas are great, but the upstairs with the high ceilings, low chairs and warm lighting is perfect for a fun evening dinner.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "Te6M7QBZrkxskd6SXnuDag", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "YLc7Djf3GsC8IT84YkZMzw", "stars": 3.0, "date": "2012-07-11", "text": "Food ***1/2\nService **\nAmbiance **\n\nThe first time I tried sukho Thai I was disappointed but I think it may have been a bad night for their chef.   They definitely have some of the best pad thai in the city.  \n\nTheir curries are decent however portion sizes are small.    Spring Rolls were surprisingly good as they had were filled with mushrooms.   \n\nReasonably priced for what you got.   Don't go expecting to be blown away.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "OyCUqsarEg8RVLAx5pmUqA", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "Ae4ABFarGMaI5lk1i98A0w", "stars": 4.0, "date": "2016-10-29", "text": "Food ***1/2\nService ****\nAmbiance ***\n(Out of 5)\n\nI got takeout here. Specifically chicken thali and chilli beef.  \n\nThe thali was great - very flavourful.  The potatoes that came with it was perfectly seasoned.  It tasted liked home cooking.  \n\nChilli beef was ordered extra spicy and did not disappoint from a spicy factor. \n\nOverall great value for the price and taste home cooked styled food.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "eb9yl77qCYnEwljSbnJB7Q", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "Sc4pUTYgI7FQb1i8aa0csg", "stars": 4.0, "date": "2016-12-07", "text": "Food ****\nService ***\nAmbiance *\n(Out of 5)\n\nI've had the privilege of going here for over a decade and still love it however hadn't visited it in a while.  \n\nFirst: Their potatoes are little pieces of gold.  They're the potatoe version of timbits - only better.  \n\nSecond: Hot Sauce.  Probably the best hot sauce at any Churrasqueira in the city.  Sadly it's not cheap\n\nThird (and final): Dark meat only!  It's all good, but the white meat is clearly a far second place.  \n\nEnjoy!  \n\nPS.  If you are in the area, remember there is also the Stockyards (BBQ), World Class Baker's (amazing almond croissants), and Alberts (Jamaican) all within a stone's throw!", "useful": 0, "funny": 1, "cool": 0}, {"review_id": "05FSn_YZMrlDbv9Swhz7gA", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "b13cpT8r7F-7rAas19pYzg", "stars": 1.0, "date": "2016-11-05", "text": "Overpriced and what tastes like frozen patties/cardboard.   Better burgers are available for less pretty much everywhere!", "useful": 1, "funny": 1, "cool": 0}, {"review_id": "HC7iwwvf6YvLx95-I9xWrg", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "eqg6UyuVLwzAplUvN9UkSw", "stars": 3.0, "date": "2016-09-04", "text": "Food ***\nService ***\nAmbiance ***1/2\n(Out of 5)\n\nLisa Marie continues to be a reasonably priced bar/restaurant.  I've been here maybe 5-8 times.  It's a place with louder music and ideal for small/medium sized groups friends (3-8)\n\nWait staff while not super experienced are approachable and nice.  \n\nDrinks and cocktails here are always great.\n\nWe had a flank steak the most recent time we went and it was really well prepared.  It was cooked to medium rare and well seasoned.  I'd give that steak 4/5*\n\nEveryone raves about the pad Thai fries but to be honest, they taste nothing like pad thai.   I'd probably get them again if I went there but they aren't amazing.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "_qWiLtqoJ2Wm8Ap0AELTdw", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "byVmQiGVTyLrG_74OFJ7eg", "stars": 4.0, "date": "2017-01-01", "text": "Food **** \nService ***\nAmbiance ****\n\nCool bar with a wide selection of beers by the bottle and quite a few on tap.  They have a bunch of retro video games in the back which are a load of fun. \n\nNo Cover.  Fridays and Saturdays may see a line after 11 p.m. so get there early.  \n\nNote that they have a North of Brooklyn pizzeria in the back and sell by the slice or pie.  Coming for a beer with friends and ordering a whole pizza will make for a good evening.  The rare combination of bar vibe with really awesome pizza is unique to Toronto.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "bncIs0kTmvC7ziEyOlw-tg", "user_id": "2IPXok5QcNohOMEPV2IJDA", "business_id": "Ce4d_jWB-1yDn1ayCrYn1w", "stars": 5.0, "date": "2016-12-10", "text": "Food ****1/2\nService *****\nAmbience ****\n\nThis is a Jamaican institution in the city.   Privileged to have gone to Alberts since 2006, I remember when they had their small storefront on St. Clair.   I used to come from the West so I'd pull a hard U-turn and arrive at their doorstep (pre-streetcad times.)\n\nMy go-to for Alberts is always 2 things: Jerk Chicken Dinner and Doubles.  \n\nDoubles are a roti with spiced chickpeas in it.  It's a great snack, vegetarian for those who need it, and easily packable/edible on the go.  \n\nI personally am not an oxtail fan (probably because I'm  the East Indian variety :) but I have bought it for a West-Indian friend a couple times and he loves it.  \n\nAnytime I'm in the area and hungry, I'll go give Alberts a try.  \n\nSadly Dutch Dreams ice cream shop has moved a while back and is no longer neighbours.  Good thing is that they are just a couple minutes down Vaughan on the South side of St. Clair.  A perfect summer evening would be Alberts followed by Dutch Dreams.  :)", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "3yIo2Yt0FhNYqi0unEm-3g", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "5jXwI9WpDxGDmzmkmE0RTg", "stars": 4.0, "date": "2011-05-17", "text": "Nice presentation, nice interior, but the food is a bit underwhelming and expensive. If you're just looking for a nice place to sit around for a bit and chat this would be great. But if you're expecting the food to taste as good as it looks you might be a little disappointed.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "IMHX3LMcOq7BdKGk6O_94A", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "RWd83o4drIOE60W1meaESA", "stars": 4.0, "date": "2011-12-28", "text": "It's hard to decide whether this is a 3 or 4 star place. While objectively if you consider it against many bakeries in Chicago or Milwaukee, the pastries aren't really that amazing but it isn't easy to find pastries in Champaign-Urbana. I wasn't a big fan of anything that contained custard or was cake-like but their almond horn, chocolate scone, and pear tart are solid choices.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "YNx5H7wHWz7bPChsfowyIw", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "dn9lwYUxmhs_mLKPu7L25Q", "stars": 4.0, "date": "2013-10-05", "text": "Nice large restaurant with a nice atmosphere and interesting menu. The food was good but could've been much better with additional attention to the texture. \n\nTavern burger: Mix of beef, bison & pork burger with a red onion marmalade and cornichon aioli. The meat was alright in texture and flavor but was overpowered by the marmalade.\n\nTurkey Horseshoe: Turkey sandwich with beer mustard, 3-cheese mornay cheese sauce, and mixed greens. The mix of mustard flavor and turkey was a good mix.\n\nTrout hash: Nice clean flavors with a mix of nice vegetable elements such as corn and green onion.\n\nDeviled egg: Good texture with nice crispy chip but wasn't a huge fan of the yolk.\n\nSpiced nuts: Fresh and tasty, nothing unusual from other good spiced nuts however.\n\nFresh baked soft pretzel: Nice mustard but the pretzel itself was a bit tough.\n\nCornbread: Nice corn flavor and texture, one of the best items of the meal.\n\nOverall, a nice choice if you're not visiting Desithl nearby but a little pricey.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "Lc_ZoXpVCeVYN7_cdgyQhw", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "aELkI0mfF1EbQo_m44vEKg", "stars": 4.0, "date": "2011-01-03", "text": "Pretty reliable for normal American favorites. Not spectacular but at least a little better than a lot of the other choices nearby.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "GEIlkzi1H6WLbcB-G5aSEA", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "SUktrYdNQD8k2vvkM4OpfA", "stars": 3.0, "date": "2011-05-17", "text": "Alright food. Pretty average in taste, quality, and prices. A bit inconsistent with their cooking.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "HXxQn34En19j_7Rd_runFQ", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "jKxES7iLV63H_PfyGVGIDw", "stars": 5.0, "date": "2011-01-03", "text": "Between here and Golden Harbor, Champaign has some very good Chinese choices on campus. Not to say that the other local choices aren't good as well but these two restaurants serve some of the more classy authentic Chinese dishes that you wouldn't expect other restaurants to serve. Fortunately for the students, these restaurants cook well enough that there is no immediate need to run to Chinatown to enjoy good Chinese cooking. The Hong Sue items and Spicy Beef Tendon noodle soup are great here.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "rDiP68c3ZCZ999ZBh_u1Zw", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "ViJjcvNH_Up1mXZ5NieApg", "stars": 5.0, "date": "2011-08-03", "text": "Great addition to the campus. Although there are other choices within driving distance nearby, nothing beats the convenience of having a grocery store you can walk to after class. It has a good selection of produce, meats, and bakery goods that can save you a trip to marketplace. These are all offered at reasonable prices with a Caribou Coffee conveniently located inside if you also need to take care of your caffeine needs for the day at the same time.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "24wmQIoyqJHRicKGWsSLxQ", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "e88VWa9xdHmSFdMZne9eLQ", "stars": 3.0, "date": "2018-02-04", "text": "Big menu -- but inconsistent. Sometimes food is good here, sometimes it isn't. Sometimes some items are very good here -- sometimes they aren't. \n\nOne of the major differences between here and other local places is the dim sum. However, this is unimpressive and most of it is likely frozen as the flavor and texture don't resemble that of fresh dim sum at all. If ordering anything, I'd go for the noodle soups over other options as Lai Lai, Golden Wok, and others have better \"wok hay\" in my opinion. \n\nPrices are reasonable, cooking time doesn't take too long, and portion sizes are good. But, there's a lot of competition on campus town and Mandarin Wok doesn't stand out much in terms of food.", "useful": 3, "funny": 0, "cool": 1}, {"review_id": "HDlbLkHQQIUZlrkXQryQwg", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "91Y6ASRhkDz3mJG9ezGNiQ", "stars": 5.0, "date": "2017-10-02", "text": "Love this place -- probably responsible for many of my trips to Madison as the freshness is amazing, flavors are well balanced, and prices are unbelievable. Scoops here are enormous so beware before ordering enough ice cream for a full brain freeze. If you're coming from far away, you'll want to sample several favors to get the full experience of different flavor profiles. No matter what you order though, the creaminess and freshness of the milk really come out and the flavors are very distinct from one another. \n\nDefinitely worth a special trip if you live in the midwest. The flavors aren't as fancy as what you'd find in Jeni's Splendid Ice Creams, but the freshness and simplicity will delight your palate just the same.", "useful": 3, "funny": 1, "cool": 1}, {"review_id": "K_6_OpWz0pQFQlTcB6m8AQ", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "o9nGD3J0btXjE9M6IdgZTA", "stars": 3.0, "date": "2011-08-02", "text": "Pretty good and solid choice near marketplace. The prices aren't bad and the selection is pretty decent. The only problem is that not all items are consistently good.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "5X-SgGYrAXmYsD_m68uKcQ", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "XbHxWOciYlBhJOjKRQbo9g", "stars": 4.0, "date": "2011-05-17", "text": "Huge with pretty much everything you need. Between this and the Super Wal-mart across the street, a student can buy almost anything he or she needs at bargain prices.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "u9SGKDiIu4TK6VP-rw799g", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "ZGIkQIh3KTLM1yOCNpvU5Q", "stars": 3.0, "date": "2014-11-28", "text": "Always reliable college-town type food I can get for cheap at any hour of the day. There's not much else to say about the restaurant as it's pretty standard diner fare at standard diner prices with standard quality. The only things that are slightly special are the better than normal milkshakes and special chili sauce.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "VFpoPHsvpK3ADT4EnT6USA", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "hMgIF04rrJ7oB1lGIpFt5w", "stars": 4.0, "date": "2013-12-02", "text": "It suprises me how there are so many good Chinese places in such a small area of Central Illinois and South China Restaurant adds to this list. For me, South China is in the middle of the pack -- not as fancy as Rainbow Garden or as tasty as Golden Harbor, but somewhere inbetween. The big plus of this restaurant is the spacious interior and decent size parking lot but the dishes are a little on the expensive side and the service could be quicker. Food is inconsistent with some dishes being excellently prepared while others are bland and forgetful.  In particular, I liked the Deep Fried Fish Fillet with Pine Nuts & Sweet & Sour Sauce, Sauteed Asparagus & Shredded Pork, Braised Pork, Mao's Family Style, and Stewed Meatball With Brown Sauce in Hot Pot.", "useful": 3, "funny": 0, "cool": 1}, {"review_id": "GICG5b8dUgOu3QAKqk9GeA", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "5uvf3QpmrdU2aiqmF4278A", "stars": 3.0, "date": "2011-12-28", "text": "A solid breakfast choice if you are in the area. While I can't recall anything being particularly amazing, nothing is really bad either. With the low prices, you can spend the money you saved on buying something nice in Marketplace Mall.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "sz3BNrQoKmgU4r4qdogoaA", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "EYmj4QlhqgrsMXnLeGLu3Q", "stars": 4.0, "date": "2011-10-27", "text": "If you're in the area, it's a nice fun place to spend an afternoon in. Picking fruit or pumpkins is fun if you're with family or a couple friends and the food items are quite addictive, especially their donuts.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "_OAda9-CnOsV4qmH_LZaHA", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "0FrYsoVHheQGoXEQsH2d2Q", "stars": 5.0, "date": "2011-08-02", "text": "This cafe was a very pleasant surprise for breakfast. Every item I tried was surprisingly good.\n\nThe organic coffee came in a huge mug, bigger than most soup cups and had a really nice smooth and only slightly bitter taste. If you enjoy Intelligensia I'm sure you'd enjoy this one as well. The Italian soda was pretty normal, using Da Vinci syrup.\n\nBoth the roast beef wrap and mango chicken wrap were fresh and light with a good mix of flavors. The cream cheese is from local sources which you can clearly taste from the first bite. The sides of salad and fruit were both fresh and flavorful.\n\nI will definitely return here on my next trip downstate.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "8T3ad9Hvyh4nwQN4TBnscQ", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "ZiLOXVloAOtr9_cpQTpr8g", "stars": 5.0, "date": "2011-05-17", "text": "One of the best research institutions in the world with many high ranking programs.", "useful": 5, "funny": 1, "cool": 0}, {"review_id": "EEgLPYmpLQTa74IzC4SOJA", "user_id": "AJcwRgdkHtu3kOrEKlXq8A", "business_id": "t_yiQnxUDdPPCN2z4QyezA", "stars": 5.0, "date": "2011-01-03", "text": "Between here and Lai Lai, Champaign has some very good Chinese choices on campus. Not to say that the other local choices aren't good as well but these two restaurants serve some of the more classy authentic Chinese dishes that you wouldn't expect other restaurants to serve. Fortunately for the students, these restaurants cook well enough that there is no immediate need to run to Chinatown to enjoy good Chinese cooking. Don't miss the tea smoked chicken here. Although it's not as friendly to non-Chinese and usually very busy, don't let that deter you from visiting this gem.", "useful": 3, "funny": 2, "cool": 2}, {"review_id": "RnXS5pEe07DjUK9XwAuJZg", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "Ip5IQLwjFzmr_X03pNH7pg", "stars": 5.0, "date": "2015-10-15", "text": "With all these amazing reviews, we knew we HAD to come here for our date night. \nThe hostess/waitress was so polite and went out of her way to help us as it was our first time at an Indian restaurant. \n\nMy husband picked something right away. A chicken dish in a very yummy curry sauce.\n\nI wasn't able to decide, I told the waitress I was wanting something with coconut curry and tofu, she said the chef could come up with something special for me if I'd like, so of course that was perfect.  \n\nWe got rosemary Naan, first, it was fantastic. UT was served with 3 sauces..  both my husband and I loved the tamarind and green sauces, but didn't like the white one at all.\n\nWe were both so happy when our food came out.  We each tried both of them.  I was so happy with my dish. It was heaven on my plate.  The perfect blend of coconut, curry, heat, tofu and vegetables. It couldn't have been better!!  \n\nAnd the rice.  Oh my gosh, the rice itself was the most fragrant, best tasting rice I've ever had.\n\nTo top it all off, after we were done, the chef came out to check how our food was. He was wonderful to speak to, we can't wait to go back.", "useful": 1, "funny": 1, "cool": 2}, {"review_id": "JwoId3Se8tHYvuApD5QNoQ", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "cTudgI-2jn-GlnZUmULy5Q", "stars": 5.0, "date": "2016-03-29", "text": "I don't know why we haven't been here before.\nMy son got the brisket sandwich, I got a bacon, egg and cheese. The flavors are amazing.\nThen we shared a cinnamon bagel with maple cream cheese.... It was heaven. \nEveryone was nice, the food was amazing.\nWill be back soon!!!!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "yI72nNXW6yf8Thb_NxRhPQ", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "LjOBNcNNpuewBqSPxYYTJQ", "stars": 4.0, "date": "2017-06-18", "text": "A fantastic place to get a coffee.  A perfect place to sit and chat with a friend or a loved one.\nMy whole family loves the uptown location so much more though...", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "eNLl0ata30z4O1gJ2SW27w", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "DyOzNIeXUksPNLXYHnB-oQ", "stars": 5.0, "date": "2017-11-09", "text": "Fantastic spot for lunch.\nThere's a lot of construction around.. but it is still super busy.\nFood was fantastic. A lot of food for the money.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "IqMUiBXwNE0__ej-G5_RsA", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "CXvOT4DP2ajswWvZHuMKRA", "stars": 5.0, "date": "2017-04-30", "text": "So glad we tried this place! My family of 5 enjoyed this place so much. It was so nice to sit outside and enjoy the breeze.... and the food was amazing. It's family friendly, plenty of seating and the food came so fast.  Everyone loved everything and there are lots of leftovers!!!\nWe will definitely be back!!!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "S7BfiO07IKmV6IbA3te8oA", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "ywkw13rZ9xIv1s3CibF-uQ", "stars": 5.0, "date": "2015-07-02", "text": "Such a cute shop. And the cupcakes taste amazing. They are the absolute best I have ever had. Totally worth the drive no matter where you are driving from.  If you haven't been here.... get here soon. They are amazing.  Don't even bother going to other cupcake shops...  run straight here.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "1jJgWZ2-u-bj2BnsKjxhqg", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "TTFbaLpIwrjFx7YIL2pbJA", "stars": 5.0, "date": "2015-11-05", "text": "Date night!!!\nCouldn't have possibly been any better.\nIt was packed the night we went. We waited about 10 minutes and got a small table way in the back.\nWe looked over the menu and picked 4 small items.\nEvery member of the staff we encountered was extremely friendly. The food. It. Was. Amazing.\nEvery bite was perfect. This is my new favorite restaurant. We will definitely be back. Very soon.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "Z8YolXM6YBOesgh_EBygRA", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "-nyNzdge5rgZ3aQF8Y3exQ", "stars": 5.0, "date": "2015-09-10", "text": "I've been wanting to try this place out for a long time.  My husband and I had a date night, and decided to go try it.  It was fantastic. The waiter was super nice, and very helpful since we had never been there before.  The food was absolutely fantastic. Great taste, and a lot of food for the price. We will definitely be back, there were other things on the menu I want to try!!!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "3Djdxl6MudKWbD600_ASkw", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "VsPoQeCRYYHQrj9jbiLmtA", "stars": 5.0, "date": "2015-11-12", "text": "Stopped in because we drove by it and it looked interesting. \nWe both got the Texas burger.\nOh. My. Gosh.\nDefinitely one of the top 5 best burgers I have ever had.\nBBQ sauce, jalepenos, onion rings. Perfection. It was cooked perfectly, and made very well.\nWe will be back.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "DmmHMxmIufCa9O93iJ8zeg", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "CQFX3y-BKkvfZnLG2wet5w", "stars": 3.0, "date": "2017-04-05", "text": "What an interesting place to stop....   it was confusing where to start when we first walked in.  But we figured it out... \nLove the food selections!!!  We were a bit frustrated to find out that drinks were just a variety of pre packaged drinks that were very highly priced... I figured I'd save money by getting a water...  nope, still so expensive, only to find out when I walked into the dining room that there was free water in there.  I really wish the person at the counter would have said something!!!  I felt deceived. :/\nIt was nice to walk around and look at things while we waited for our food... so many interesting things to see.\nAll of our food was fantastic.  But for 5 of us to eat lunch on a Sunday, and pay $65, I would have at least hoped we wouldn't have left hungry....   but we were all still hungry!!!\nIf they had a better system for drinks, and either lower prices or bigger portions, I would have given this place 4 or 5 stars, and we would already be planning a return visit.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "afVKvv4TUvnCG3xrZOXUhw", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "gG9z6zr_49LocyCTvSFg0w", "stars": 5.0, "date": "2016-03-25", "text": "What a fun spot.\nIt's so artsy, lots of comfy spots to sit, the pastries and coffee is amazing.\nThe people that work here are all super nice.\nIt's enjoyable just walking through, looking at everything.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "_GH-cOm6_07hG3O2i3fRwQ", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "bX4gfj2Kj22Lwm-nSsnnfg", "stars": 1.0, "date": "2014-11-29", "text": "Used to come here all the time, until we found Derado's.  The service and quality, and prices are SO much better!!!  Go to Derado's and see for yourself!!!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "ZkdtpAaGkoEt03DbcoBMrg", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "sH3UsolKjik01u0HlQ9_0Q", "stars": 5.0, "date": "2017-08-10", "text": "Wow. So much better than we even imagined. The nachos supreme was more than enough food for 2 of us", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "4cOJq3nlK3fkMt2WNw6GjA", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "vodVvMALuQPScQJpLhfcyg", "stars": 5.0, "date": "2017-09-13", "text": "I love this little bakery. I love the coffee, love the baked goods....  love the aura.\nI will definitely be back!!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "L4TMmDkc9vlq6iQDZRXnHQ", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "3sdUVTMBHPiVN5zqZjb1zw", "stars": 4.0, "date": "2015-12-24", "text": "We always go to this place when we are planning on a Chinese buffet.\nIt has the biggest selection...  and sushi.\nAlthough they have the typical Chinese buffet desserts, you can scoop your own ice cream here, my kids love that.\nMy husband always gets something cooked on the hibachi grill.\nI love their coconut chicken!!!\nThe people are very nice. Don't forget to check out the fish and turtles up front.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "QItwRm05ADTcle7zICMuyQ", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "KaxjIAYLhqXN8-p_iZwgBw", "stars": 5.0, "date": "2016-07-02", "text": "Our first time here.\nWhat a great experience.\nBought a pound of basil fettuccine to bring home for dinner.\nSo excited.\nEveryone was super nice.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "m5ef7bPlwAcbd8R_h9Adjw", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "g-E12y45gBKedax5N20YmQ", "stars": 5.0, "date": "2014-11-01", "text": "We HAD to check this place out after we saw the amazing reviews. We all loved everything!!  Burritos, tacos.....  And the salsa bar!!?!  Perfect. I love the variety of drinks. My kids LOVE the horchata!!  The people that were working there were very kind, and offered fantastic suggestions. The whole place was really clean, and we enjoyed the atmosphere. We will definitely be back.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "3Kc6cgSQ27AFa6hO9-5qIQ", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "FwmfaGVvXP8EwXo2zyyhwA", "stars": 3.0, "date": "2016-12-04", "text": "Not a good first impression.\nWe wanted brunch, but we're only given the lunch menu and were told \"that's all there is\".\n  We had a hard time deciding. The waitress \"joked\" and said if we didn't know what we wanted she would kick us out.  After we ordered, she said \"see, it wasn't that hard\" \n\nThe food was good, good portions, good quality.\n\nWe felt rushed, she brought the check before we were even half way done.", "useful": 0, "funny": 1, "cool": 1}, {"review_id": "7dtE-sasUTMBLt_o6ZLCew", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "u00Ua_WOshbzi_QRBpY6zw", "stars": 2.0, "date": "2017-04-14", "text": "With the way I've been hearing people talk about this place, I expected it to be better.  The apple fritter was so greasy... like, when you squeezed it, (lightly) it dripped!!! It made it a mushy mess. The pinecones were fairly decent though.  We may give it another shot, but just not impressed this time. :(", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "gacwwBfbAowZp0hSQ8jpmQ", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "s8OLoPfOpB0FbK5frI3CkQ", "stars": 4.0, "date": "2017-06-18", "text": "We really wanted to sit on the rooftop.... but it was full.  The new menu was just released yesterday, so no one knew much about anything...\nWe got the purple cauliflower enchiladas, the rib grilled cheese.... and the rabbit grilled cheese.  Soo good.  The waitress said they get a new menu every 6 months.\nWe do feel like you don't get your money worth for everything though. My husband and son were still hungry after they finished everything.\nIf the prices were lower... or you got more food, it would be more worth it.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "dXYUk0h213dXyJpRzS4_xA", "user_id": "I4j2FPuM3Yz3mqeFKVawkQ", "business_id": "lNBhwf_3c0QBqBlsYRygaQ", "stars": 2.0, "date": "2015-07-26", "text": "Thought it would be a treat to come for cupcakes.  The girl at the counter was nice enough, but the cupcake wasn't anything special.  I could have made a more moist cake at home. And wouldn't have paid almost $10 for 2 cupcakes. We got the french toast, and the miss princess.  They weren't bad, but not amazing and worth the money.  Honestly, next time I want a treat, I'll travel to Baxter village and to to the cupcrazed cakery.  I'd pay $20 for 2 cupcakes there and still walk out a satisfied customer.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "ujMbYlNDA-7Slkfsgs16-Q", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "cf6rtw3f05DlnJ7muIAEgA", "stars": 4.0, "date": "2011-02-08", "text": "* If you are students, make sure bring your students IDs for cheaper tickets than the general admission. If you came with group of people, only one student ID will work and all of you will get the discounts.\n\n* I got my picture taken next to my Mother Monster (Lady Gaga) which was pretty amazing.\n\n* I was in bed with Hugh Hefner with my girlfriends as well.\n\n* Dwayne THE ROCK Johnson didn't get intimidate by me.\n\n* I was the adopted daughter of JFK and Jackie O. \n\nI had so much fun at this museum. One of must see attraction in Vegas. Who knows that I actually love wax museum?", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "hRh5gHnpV48rZi9MXtfPhA", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "eoHdUeQDNgQ6WYEnP2aiRw", "stars": 4.0, "date": "2011-11-10", "text": "We came here for lunch on Halloween day and there was only 5 minutes wait. All servers dressed up in costumes which I thought was very fun. We came mainly for the Frozen hot Chocolate, but decided on having lunch here as well.\n\nWe asked about the Pizza and our server said it was only enough for one person, so we also ordered a side of Garlic Bread. When we got our food, turned out to be the portion was enough to feed both of us. It was the Meatball Pizza and was delicious.  The Garlic Bread was just ok.\n\nNow, the Frozen Hot Chocolate comes in two sizes. For one and for sharing. We decided on the basic Frozen Hot Chocolate for one. The size of this drink was hugeeeeeee. I don't think I can ever drink the whole thing by myself and if I ever did, please slap me in the face. \n\nThat frozen hot chocolate was everything what people said. It was sweet, delicious, refreshing, gave me brain freeze, and I want more. I think, a trip to Serendipity 3 will be a must do for us for our future Vegas trips. Too bad no one can't ship that drink to me :(.", "useful": 2, "funny": 3, "cool": 2}, {"review_id": "kbPj_3xpwkGkfS1tOW0RRQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "K7lWdNUhCbcnEvI0NhGewg", "stars": 5.0, "date": "2013-06-13", "text": "We love Wicked Spoon so much that we decided to have our Wedding Reception dinner there. We made the right decision because everything was perfect. Danielle from the group sales was so awesome to work with. She answered my emails and helped me planned the evening to be perfect. She put up with my Bridezilla moments ;). She's just amazing.\n\nThe food were top notch. All of our guests loveeee the delicious food. We also ordered cake from them and our cake was so cute and it was so yummy. Service was excellent and I love the floor manager who helped us with everything including cutitng our cake. \n\nEverybody said it was the best wedding reception they've ever attended. Maybe for our  25th year anniversary we will do another reception here. Thank you Wicked Spoon for making our day perfect!", "useful": 5, "funny": 2, "cool": 3}, {"review_id": "6x59rKN1RYpKmjPucOwonQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "dn_ipqbm7_jUz5X3rDez_A", "stars": 3.0, "date": "2013-07-18", "text": "We came here for lunch and this is a mixed review of our experience at the PUB. Jesse got one of the burgers and I was so tired of burgers. I ended up with Pasta dish with Chicken. It was a big mistake. My pasta was bland with only two pieces of chicken. I should have known better, not to order pasta dish here.\n\nWe also ordered Buffalo Wings which were yummy. Jesse liked his burger. Our server was great. I'm willing to give PUB another try next time when I'm in Vegas. I will get the burger though. No more pasta.", "useful": 5, "funny": 4, "cool": 6}, {"review_id": "yxJ1SyBz7WHhed1SqdYl7w", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "NTQXBbCa5Ugj5lNr6E4J5w", "stars": 3.0, "date": "2013-01-30", "text": "This place is pretty good for a deli. It opens late, it might even be 24 hours because when we were there it was pretty late. We stayed at The Excalibur but the food options there were really sad so we ventured out to Luxor. \n\nI had the Bagel sandwich with Eggs and Cheese. Jesse had the Veggie panini. Big portions and they hit the spot. The only problem was they didn't put enough seasoning on our dishes. A little dash of salt & pepper will be nice. \n\nPrices are lower than I expected for Vegas. It's a great people watching spot because it's by one of the hotel elevators. We saw quite a bit of ladies with high heels and almost fell on their asses. Great late night munchies and entertainment for sure.", "useful": 3, "funny": 2, "cool": 2}, {"review_id": "yMbSRSzqhsbot8fOHKQBlA", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "tRUBzjp-25SdY-qFWevIdw", "stars": 5.0, "date": "2011-02-08", "text": "I love Studio 54!!!\n\nI had so much fun in this club when I visited Vegas. The admission for the ladies on Saturday night is $10 and the club was packed with fun people from all over the world. \n\nDrinks were ok and if you came from the land where mixed drinks are only $7 top, don't get surprise to get charge $11 for Vodka 7. \n\nThe DJ played everything from Pink, Black Eyed Peas, Bon Jovi, Guns N Roses, Taio Cruz, Enrique Iglesias, and techno as well. My favorite thing was Go Go Dancers and they also have male dancers instead of all female dancers. \n\nI will come back when I make another visit to this sin city and I even might commit a sin or two at Studio 54.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "RL4bsoOEx7qY0KewQzqmvQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "oJZNHz5UUVUgrZwVBVlpYw", "stars": 5.0, "date": "2013-07-18", "text": "I always want to try the Afternoon high tea at Mandarin Oriental, but I'm too cheap. I don't want to spend $$$ for it. We've been playing the free MyVegas game on facebook a lot and we had enough points to redeemed for Afternoon High Tea at The Bellagio for both of us. I was so thrilled.\n\nI made reservation couple weeks in advanced. I was so excited on the afternoon of high tea time. I even put on my nicest dress. We got seated right away and I noticed how empty the place was. All of the tables had reservation signs on them. This is really high class frou frou activity that I usually don't care of doing. \n\nThe server presented us with menu of teas and finger sandwiches. I forgot which two we ordered, we pretty much got our own teapots, and ordered both menus. I love everything from scones, to finger sandiwches, and to their petite desserts.\n\nWe were stuffed. I swore, my belly grew two sizes from couple hours of indulging in this fiesta. Service was very very good even when we told them we had vouchers so our meals would be free. They didn't care and still gave us excellent service. \n\nWe will be back and I highly recommend this experience to all of you. Do it once and you will be happy that you do it.", "useful": 12, "funny": 6, "cool": 7}, {"review_id": "o-NBNtP9aHAGIlJPV8lXOA", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "na4Th5DrNauOv-c43QQFvA", "stars": 3.0, "date": "2011-02-08", "text": "I didn't stay here, but I roamed around the conservatory, casino, and Bellagio's shops. The conservatory is pretty. They had the Chinese New Year exhibit when I visited. Bellagio's Casino and shops were just ok. They are the same as any other casinos and shops on the strip.\n\nTo sum it up, Bellagio is a bit boring for me. I do love the outside exterior and how Bellagio looks from the street especially at night. It's elegant on the outside, but it's boring in the inside just like an uptight woman...or man.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "-yPGPLgPbRXmJSCbBz1zsw", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "iCQpiavjjPzJ5_3gPD5Ebg", "stars": 3.0, "date": "2013-07-18", "text": "Hype hype hype hype hype..more hype..\n\nThat's what I thought about Secret Pizza at the Cosmopolitan. Maybe, I'm spoiled by many great pizza places in Portland, so this one just doesn't do anything for me. We had one slice of the White pizza. It was just ok. It was soooooo greasy. \n\nYes, this place is cheap for Vegas standard and especially for Cosmopolitan standard. Does it worth it to try it? Sure. Does it worth to come back again for it? Probably not.", "useful": 6, "funny": 6, "cool": 5}, {"review_id": "-eMb6vobPsiC10QOB5zvnQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "wcLX8aToZJF4AR-qkpI2Ag", "stars": 5.0, "date": "2013-06-26", "text": "5 stars all over for these guys. Seriously, they are the best in the Limo industry. \n\nWe used Presidential Limo three times during our wedding extravaganza. The first time was to picked us up at the airport. It was a surprise for Jesse and my family. Everybody were amazed with the limo, the complimentary bottle of champagne, and how cool our driver was. He even tied all the baggage compartment because we had too many bags. It looked so ghetto but we didn't care.  Our driver was so awesome, I seriously wanted us to be BFF. \n\nThe second time we used them was for us to go to the Courthouse to pick up our license. We rented the Lincoln Towncar. Our second driver was so tall (feel bad that I forgot their names) and he's so funny. He told us stories of Las Vegas on the way there. When we got there, he walked us to the door of the courthouse. That way we didn't get bother by these people who stand around outside the courthouse to try to sell you chapel packages. After that, he dropped us off at Monte Carlo. It was a nice ride and worth the extra money.\n\nThe third time was for after reception party tour bus. I rented the party bus to take us up and down the strip. We stopped by at The Las Vegas sign and we took tons of pictures there. The bus was fun. Complimentary champagne were flowing and they also have bottle water. The bus has a strip pole in it. Fun fun fun. The only downside was they only have radio stations instead of ipod plug in or anything like that. The party bus was definitely the highlight of the night.\n\nWe recommend Presidential Limo to everybody we know and anyone who's visiting Las Vegas. It's a little bit more than cabs, but since cabs in Vegas long haul everybody like crazy mine as well pay extra for comfort, cleanliness, and fun ride.", "useful": 9, "funny": 3, "cool": 6}, {"review_id": "8nnKpuoTMbbMzGfdOZ-xuA", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "t-o_Sraneime4DDhWrQRBA", "stars": 4.0, "date": "2011-11-14", "text": "Swanky.\n\nI think that is a good summary of Wynn Casino. I didn't stay here, but had a great time at their casino. If you signed up for their Red Card, you will get $10 FREE PLAY credit. We played our credit and had a couple of delicious Chocolate Martinis. \n\nWe were tipsy at 1 pm and I won about $12 from the Mona Lisa slot machine. Thank you, Wynn. I kinda heart you from that point on. Hopefully next time, I can come by and visit again. It was fun.", "useful": 1, "funny": 1, "cool": 2}, {"review_id": "nsSRtzj-az8F-9FJsP1LTw", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "x4txqZRe2f8-sTzt0myCVg", "stars": 4.0, "date": "2011-02-04", "text": "I love Coffee Bean & Tea Leaf...\n\nI really wish we have one in Portland, OR. I don't know why Coffee Bean doesn't wink at us yet. When I was in Vegas and I saw this coffee shop at the airport, I just had to have the Cherry Mocha freeze (I forgot the actual name :(..bad me). \n\nI spent almost $6 for medium size of blended coffee drink and I didn't feel guilty about it. Now, if they opened one in Portland, I don't think I can afford to have one often. I just wish there's one closer to home.", "useful": 2, "funny": 1, "cool": 1}, {"review_id": "7RznksXTzJSnUYHTHBcnWg", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "7zec5DCEukcx8GRFn9LbLQ", "stars": 5.0, "date": "2012-12-12", "text": "I always missed this attraction on my past trips. For this trip, I told Jesse that I didn't want to miss it again. We waited fifteen minutes before the show started and got the front row. \n\nIt was spectacular. The Volcano was really hot. It was an awesome attraction, however the Bellagio fountain is still on top of my list but the Volcano is one not to be miss.", "useful": 5, "funny": 3, "cool": 3}, {"review_id": "51F736QsGXJoPfwputzsrQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "f4x1YBxkLrZg652xt2KR5g", "stars": 4.0, "date": "2013-06-12", "text": "Nomnomnomnomlicious...\n\nHash House is a solid restaurant at The Quad (formerly known as Imperial Palace) which opens late...or maybe even 24 hours (not sure on that). Every single dish here serves in large quantity. If you fancy a pancake with the size of your face + head, you will be happy here. \n\nWe came here on the night before our wedding with my family. There were 10 of us and service was top notch. Food came out hot and tasty. A few of us have burgers and they looked mighty delicious. I had an Omelette with all the fixins and I was a happy camper.\n\nI love  Hash House, but I don't love the smokey filling of the place. It was on the top floor of The Quad and if you've ever been to Vegas you know how tight and smokey The Quad is. If you've never been to Vegas..well The Quad only has one smell which is Ciggys smell. \n\nWe will be back whenever we are in Vegas for more late night giant food munching.", "useful": 4, "funny": 2, "cool": 3}, {"review_id": "mh-lH2wZEa6-qcXrFm_pgg", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "jbbFSVdIrac2QBuSV-NBLw", "stars": 3.0, "date": "2011-02-10", "text": "I thought just to grabbed an Iced Mocha and a pastry would be an easy task. Apparently at Cafe Belle Madeleine the whole process would take waiting in the line for 20 minutes or so. I had the Chocolate Twist pastry and it totally worth the price and the wait. The Mocha was alright, but yes...Chocolate Twist pastry...mmmmmm...", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "kouQUtwmCOOWj9hm9S39oA", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "NCFwm2-TDb-oBQ2medmYDg", "stars": 5.0, "date": "2011-02-21", "text": "The only way for me to enjoy Celine Dion - My Heart Will Go On is if I'm in Vegas and Fountains of Bellagio are dancing to the song.\n\n I love these fountains and it's kind of sad if you looked down to the water, people throw away trash into the water. I saw many \"girls direct to rooms\" fliers, food wrappers, cups, and even coins!!! This is not a wishing well, people. Keep your trash away and throw your coins at me. I will make your wish not come true. :).", "useful": 1, "funny": 3, "cool": 2}, {"review_id": "cyBaojKnwcF4jUBbGaxcRw", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "OETh78qcgDltvHULowwhJg", "stars": 4.0, "date": "2013-06-11", "text": "We came here the night after our wedding day to celebrate us as Mr & Mrs. We love love love love the food. The complimentary basket of bread was amazing. Those breads were so tasty. All of them. I couldn't stop eating them, I was worried I wouldn't be able to eat my dinner. \n\nWe also got an appetizer of Beef Tartar. Best Beef Tartar ever! It was so fresh and light. For main entrees, I ordered Beef Wellington & Jesse ordered the Rib Eye. They brought out the fresh meat cart and showed us beautiful cut of meats before we placed our order. We love our entrees. Those meats were cooked perfectly and tasted amazing. \n\nWe don't normally splurge but once in a while we like to do that and this place is worth every penny. The only reason I can't give five stars is because of the atmosphere of the restaurant. It's more like a night club than a dining place. The music was too loud. You can't really have conversation here and it made it not a romantic place to dine out. They also have happy hour which we may try next time we are in Vegas. Unless, I will win some $$$ in casino, then we will have another dinner here :).", "useful": 4, "funny": 3, "cool": 3}, {"review_id": "M_uF13UlCxSK80pW8KLRcw", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "ShUREGiU1IjHuPYq4jVvng", "stars": 3.0, "date": "2011-11-17", "text": "The interior decor of this restaurant made me sleepy. It's red and with dim lighting. We came here when we visited El Cortez and we had restaurant.com gift certificate to use.\n\nWe ordered two Sirloins and shared a side dish of Mashed Potatoes. Everything is Ala Carte here. If you ordered steak, your steak won't come with a side dish unless you order a side dish. Our steaks were good. I love the Garlic Mashed Potatoes. What I didn't love is the service.\n\nIn the beginning, our server was very nice. After he found out we were going to use a restaurant. com certificate, he changed his tone a little bit. Service was slow. We didn't get our food until 40 minutes later. Then it took a really long time just to get our check. \n\nIf you want steak, this place will be your good bet. However, don't expect speedy and good service. That's not their forte.", "useful": 5, "funny": 2, "cool": 2}, {"review_id": "8Q9XzBuWYWjUJE1-cBqBYQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "mz9ltimeAIy2c2qf5ctljw", "stars": 5.0, "date": "2013-06-11", "text": "My favorite Cirque's show ever. I love the music, the stories, the acrobats, and pretty much everything about the show. It was fun, but also kind of dark which I love. After the show was over, I want to go again. If you loved The Beatles and more serious aspect of Cirque, you should watch this show. It's two thumbs up!", "useful": 4, "funny": 2, "cool": 2}, {"review_id": "uyySTBzZlNjtHHR6Ft041g", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "C6C_dc78Zhzei9wrZs-tdQ", "stars": 4.0, "date": "2011-11-10", "text": "Low ceilings = smoky casino...\n\nbut I can overlook that issue because El Cortez has the lowest bet Roulette table I ever found in Vegas. $1 minimum bet and $0.25 minimum chips. Some of the slot machines still spit out coins and Cocktail Waitress came often and brought me stiff drinks.\n\nNow, I wish I'm in Vegas again and play some Roulettes.", "useful": 4, "funny": 2, "cool": 3}, {"review_id": "DB4ieVS1UPg-t9oai5C46g", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "uanCi4OGc1mHLGl_AT4JhQ", "stars": 3.0, "date": "2011-02-09", "text": "* Home of the Cirque Du Soleil - Mystere which is an awesome spectacular show.\n\n* Nice and easy to navigate general areas.\n\n* Sirens of TI show is kinda lame. The only part that I like is the fire. Besides that, is a cheesy show. I think they are trying to be like Pussycat Dolls, but the pirate version of it and in my book..they failed badly.", "useful": 2, "funny": 1, "cool": 2}, {"review_id": "GFc4y0IBXOH8Im6vJl5ZpQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "5LNZ67Yw9RD6nf4_UhXOjw", "stars": 4.0, "date": "2011-02-04", "text": "According to one of our cab drivers when we were in Vegas, The Cosmopolitan is one of the new hotels on the strip and I must say, it's really an impressive building inside and out.\n\nI love the Chandeliers. They sparkles and they are such major BLINGS. I can just stand there and just admiring those pretty bling bling bling. They have different shops than other hotels on the strip which is a big plus. It's kinda tiring to see the same shop over and over again on Vegas strip, The Cosmopolitan is definitely a breathe of fresh air.", "useful": 4, "funny": 2, "cool": 3}, {"review_id": "MIixlyF-dH36zG1koNCgCQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "0EUohlWGBPnIgzCULyWl7g", "stars": 3.0, "date": "2011-02-04", "text": "My friends and I got wristbands for free entries to ROK. I must say that I love the music that they are playing. I like the layout of the club and you can watch music videos of songs that they are playing on giant screens all over the club. So three stars for that.\n\nMinus two stars for the ridiculous drink prices. I can understand that my Vodka 7 is $11 because this is Vegas and all mixed drinks in Vegas are overpriced. Oh they don't even have 7 up, they serve Sierra Mist..yuckkk. Then my friend just got the Sierra Mist without any alcohol in it and we got charged $6!!!! Yes, $6 for a glass of soda! \n\nHighway robbery to the max.", "useful": 2, "funny": 0, "cool": 1}, {"review_id": "k1H-bO52owTM-s4L7vLrZw", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "BLIJ-p5wYuAhw6Pp6mh6mw", "stars": 5.0, "date": "2011-11-10", "text": "We reserved a non smoking KING room through bookit.com and at check in, we were told only smoking is available right now or we can get the non smoking later. We decided to check in anyway and I used the $20 trick (google $20 trick if you don't know what that is). \n\nSuddenly, there's a NON SMOKING Queen room available. I also asked nicely if we could get the Bellagio fountain view room. She said yes we would get the fountain view room. We went up to the 27th floor and we got the Sammy Davis Jr's room with full frontal view of Bellagio fountain, Caesars Palace, and The Cosmopolitan.\n\nWe were so happy with our room. The tub was nice and the separate shower was a nice touch. I love their bath products including the massage soap bar. The only downside is there's no refrigerator, so use the ice bucket for your bottled drinks.\n\nThe casino is fun. I didn't win anything there, but the Deal or No Deal machine is my new best friend now. I also love the Miracle Mile shops and pretty much you get everything you need at one hotel.\n\nI will stay here again. Thank you PH for an amazing experience. :)", "useful": 6, "funny": 3, "cool": 5}, {"review_id": "3nFSf3NYWPTL2HPDEvQPRg", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "XpWFDkRm3Hk99DbC21c3HQ", "stars": 1.0, "date": "2012-12-12", "text": "They \"tunneled\" us from the airport to The Excalibur hotel. Our cab fare was supposed to be less than $20, instead it's $26. Lesson learned and always make sure \"no tunnel\" or \"no freeway\" because these days cab drivers in Vegas are money hungry and don't care about rules and regulations.\n\nLV taxi authority...what you gonna do about it?", "useful": 10, "funny": 4, "cool": 5}, {"review_id": "wdzrx5EK0YYG9U1btumjYw", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "ByFMv3p5X1aNeZhU61rDcA", "stars": 4.0, "date": "2008-04-08", "text": "My company sent me to Las Vegas in summer 2007 for a trade show. Stratosphere was the hotel that my company chose. Nice staff, the room was okay. The bed was not super comfy, but I only slept total of 7 hours anyway when I was there.\n\nThe Polly Esther club was a bit cheesy. I used the free drink coupon and the atmosphere of the club was a bit weird. \n\nThe slot machines were pretty awesome. I won $200 from Wheel of Fortune and spent it right away when I got back to Portland.\n\nStratosphere is a good deal for an affordable lodging in Vegas.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "U0g47mwOBFMNJ6DCAkbpIQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "qjnJFZtsY_nfRzoL3J_UWQ", "stars": 4.0, "date": "2011-02-07", "text": "This review is for the casino and gift shops :).\n\nI think this casino is the most \"family\" friendly compared to other ones on the strip. The Arcade area by the Roller Coaster entrance was pretty impressive for kids all ages (including me). Too bad I'm such a chicken, I didn't ride the roller coaster. \n\nThe casino is just like any other casinos in Las Vegas. I have to say, I love the gift shops merchandise. They have cool t-shirts compared to other casinos. Who doesn't love a t-shirt with New York New York writing on it? On top of that, the t-shirt has Ed Hardy feels to it...of course you will love to get one (now I'm being sarcastic). \n\nIn all seriousness, I will consider to stay at New York New York for my next visit. :).", "useful": 2, "funny": 0, "cool": 2}, {"review_id": "CA2KWvFEWafCS7TyGFDjGg", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "Y07qIurPKiUJDnTZWxZN2A", "stars": 5.0, "date": "2013-01-30", "text": "This buffet is on my top list of Las Vegas buffets. It's almost about the same position as Wicked Spoon. Probably people will think I'm crazy, but hear me out. \n\nThe price of the buffet can't be beat. $19.99 for dinner and you get unlimited beer & wine. If you signed up with The Palms' player club, you will get $7 off your buffet price. If you don't want to sign up for anything, they always have offer for it on Restaurant.com . \n\nThe food is so good and cater more to Asian  side. Their cold Crab legs are fresh. Their hot Crabs in Oyster Sauce (too die for!) tasted like how it is in Jakarta. They also have Kahlua Pork and some other Hawaiian dishes which not very common to find. \n\nThe dessert station is pretty amazing. Everything tasted fresh and delicious. No stale cookies or pies here. \n\nYou won't feel like a tourist here because most people who dine here are locals. They know what's good. I'm glad we made the cab trip to The Palms, now I can't wait to go back.", "useful": 11, "funny": 2, "cool": 3}, {"review_id": "foj0CBLJ-p3Q70gGtOcd1w", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "Cr4ipI-tr-R8Q0NilkWNkA", "stars": 5.0, "date": "2011-11-18", "text": "One of the best meals I've had this year was at MIX. No, we didn't get the \"spectacular view\" table. We got the partial \"spectacular view\" table. We got the view of the Rio and Palms. I thought our meals were going to be decent with the help of the view, it would be amazing. Apparently, the view didn't even count towards this review because our meals were AMAZING (yes with capital letters).\n\nI like how they brought us the bread basket and instead of just butter, they brought us Peanut Butter & regular butter. Bread was delicious and the peanut butter was really good. It tasted fresh and not too sweet. We told our server, we were going to use our restaurant.com certificate. Our server was kick ass. He was very gracious and very upbeat. The fact that we had a certificate with us didn't change the quality of his service. \n\nI had the Halibut with Bok Choy, Jesse had the Duck dish. Again, for this dinner we shared a bowl of Garlic Mashed Potatoes. I was in the mashed potatoes kick during our trip. My Halibut dish was beautiful. The taste was clean, fresh, and the sauce was perfect. Jesse loved his dish too. However, the star of our meals was the Garlic Mashed Potatoes. I ate most of it and felt bad (guilty feeling) afterwards.\n\nService was excellent. Our server was very chatty, but not in the annoying way. He asked our opinions about our meals. At the end, he gave us complimentary Madeleine cookies with Chocolate dipping sauce. I thought that was really sweet of him. \n\nI will highly recommend MIX for all of you. With our without discount certificate, this place is worth a try. At least once.", "useful": 5, "funny": 2, "cool": 3}, {"review_id": "WRZ-WacIwtxowK-v5jo5YQ", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "OVTZNSkSfbl3gVB9XQIJfw", "stars": 3.0, "date": "2012-12-12", "text": "We had a free buffet pass from playing the MyVegas game on facebook. We decided to gave this buffet a shot. It was a mixed experience, here are their good and bad.\n\nGood:\n\n* The salad station. You mix your bowl and the friendly guy behind the counter will toss your salad. He had all these tricks and it was so fun. The salad tasted great too. Everything were fresh and the raspberry dressing is ohhh yummy.\n\n* Cold shrimps for appetizers are delicious.\n\n* Great selections of Asian food.\n\n* Excellent service.\n\n\nBad:\n\n* Cold Crab legs were still frozen. Not good at all.\n\n* Dessert is not their expertise. They are stale and not good. Sweet tomatoes has better cookies than them. Seriously.\n\nOverall, it's a bargain if you have free buffet passes or discount. Paying full price? Go to Wicked Spoon. It will be much better.", "useful": 5, "funny": 3, "cool": 3}, {"review_id": "wJGw6kLocaD0s6J7128Vrw", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "tHS01X7Vg-Yk3KVeKAH1vA", "stars": 1.0, "date": "2011-02-08", "text": "I think Sugar Factory target customers are people who smoke cracks. I don't care if my lollipops are design by celebrities. I do care about how much I'm going to pay for it. $25 for celebrities lollipop and $22 for standard lollipop = insanity. It's not going to happen.", "useful": 2, "funny": 6, "cool": 1}, {"review_id": "ViVAU18-apvMHapf4eCkqA", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "xTOX8D1Tavoi9vPWL-nWdQ", "stars": 3.0, "date": "2013-08-02", "text": "Spendy activity, but it's worth it for once in your lifetime kind of thing...\n\nWe came here for the night before our wedding day and it was pretty fun. The actual ice bar was pretty small compared to what I imagined. It was fun to drink cocktails in ice glasses. We had a great time chit chatting and froze our butts off.\n\nThe only issue was the photographer of this ice bar. She was very demanding and insisted on taking our pictures more than we would like it. It made the whole experience was not as fun as we would like it to be.\n\nAnyway, we had a great time, but it will be just one time visit to the ice bar.", "useful": 7, "funny": 5, "cool": 4}, {"review_id": "pLiiZpF1QVhpNpyColmSkA", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "rTS8LsUmNIiXsXydE49tPA", "stars": 3.0, "date": "2011-02-03", "text": "* Good for kids or ten years old adults.\n\n* Giant size NACHOS. I'm not kidding, the nachos is the size of my head combined with another person's head.\n\n* I had the Hawaiian type burger and it was just ok. The meat was good, but the buns got soggy really quick and they put waaaaaayyyy too much lettuce on it. The last time I check, I'm not quite a herbivore yet....\n\n* There are better restaurants in Vegas...I think...", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "AK0dU1tuRfRpacM2IQjJfA", "user_id": "wkrFqNxwTEEkG3mJV88Izw", "business_id": "VyjyHoBg3KC5BSFRlD0ZPQ", "stars": 4.0, "date": "2011-02-11", "text": "I love Caesars Palace. Just my opinion, but I think they have the best general common areas. The casino is huge and they have plenty of interesting and fun shops. \n\nIt took my friends and I couple hours roamed around the Caesars. I think the only downside is that they are not connected to any other hotels and after walking so much, it will be nice to be able to just hop from the Caesars to another hotel. \n\nP.S: Wear your most comfortable shoes. Your feet will thank you.", "useful": 2, "funny": 1, "cool": 2}]